{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: The Idle Skirmisher.\nYou show up as a hybrid between a duel-focused mid laner (Yone, Riven) and a pick/playmaking mage (Ahri, Syndra, Leblanc) but your game impact is inconsistent. Stats say: above-baseline KDA (3.5) and near-baseline damage share, but catastrophically low kill participation (~0.40 vs 0.65 baseline) and slightly low CS/min for a mid. That pattern creates a player who can win isolated fights and lane duels but often isn’t present or useful for the objective fights that decide games. You either wait for solo windows or take split skirmishes, and meanwhile dragons/barons and tower pressure are lost.\n\n2. **The Root Cause**: Map-context and role-identity breakdown — not a mechanical problem so much as where you anchor your decisions. You repeatedly play champions that require either (A) proactive map-roaming and pick-creation (Ahri/Syndra/Leblanc) or (B) split/skirmish timing and objective presence (Yone/Viktor/Riven), but you don't consistently choose the matching micro-decisions. Result: low KP because you either stay in lane farming/skirmishing out-of-sync with objective timers, or you roam but without vision/timing and get caught or are absent when fights start (the dataset shows frequent \"got picked before objective\" and \"objective_gap\"). In short — you lack a consistent objective-centered habit: tracking timers, pre-placing vision, and committing to either being the team's playmaker at objective windows or the split-push threat that draws attention at the right time.\n\n3. **The 'One Big Thing'**: Raise kill participation around objectives by 20–30% via two habits: (A) attitude: always play the next 2 minutes (dragon/baron window) instead of the current lane wave; (B) execution: one control ward + one control map position before every objective. If you fix this you turn individual skirmish power into wins.\n",
  "champion_feedback": "**Champion-Specific Adjustments**.\n\n### Ahri\nIdentity shift: Become the objective-maker, not the solo farmer.\n- Lane: Push lane fast with Q+W or shove a slow push to get priority, then look to roam between 5:30–9:00 and again on every reset. Prioritize river control and deep-energy wards. If you can’t roam, freeze and deny enemy recall to create a roam window for your team.\n- Mid game: Use Charm as an initiation or pick tool to start dragon fights; hold Charm for the squishy that will contest the objective. Don’t use R to solo chase away from objectives; save it for zoning/cleanup.\n- Late: You should be the flank/pick engine — clear vision, find the enemy backline, or force them to facecheck. Buy a Zhonya’s if you’re getting picked before objectives.\n\n### Yone\nIdentity shift: From flanker-only skirmisher to synchronized objective joiner.\n- Lane: Focus on hitting CS baseline and secure two key items before looking for aggressive flanks. Don’t overextend to chase small kills without river vision.\n- Mid game: Your value is teamfights after 2 items — prioritize grouping for neutral objectives and only side-lane when your team has a plan or the objective’s down. Always shadow the mid fight for picks rather than solo split if your team is contesting drake/baron.\n- Itemization: Prefer lifesteal/survivability options when you’re dying ahead (GA/QSS vs heavy CC). Buy control wards and Sweeper each objective cycle.\n\n### Riven (when you fill/top)\nIdentity shift: Make your split-push pressure convert to team objectives.\n- Lane: Continue dominating, but every time you take a tower, ping and move to a forward control ward to protect the next dragon/baron path.\n- Mid/Late: Don’t just force 1v1s — force enemy responses that free the objective. If you’re taking towers, coordinate a timer so your team can threaten dragon/baron simultaneously.\n\n### Viktor / Lissandra / Syndra / Leblanc (control/burst mages)\nIdentity shift: Pickmaker vs scaler — pick what the team needs and play it fully.\n- Viktor: If you pick Viktor, commit to scaling safely. Push and use upgraded Augment early, but don’t roam late and leave team uninvolved. In mid-game fights, play backline zone control and keep lanes shoved to deny flanks.\n- Lissandra: Use R defensively/peel during objective fights. She is an objective-fight CC engine — stop looking for random roams that leave you offside.\n- Syndra / Leblanc: Use your pick power to force fights around objectives. You should be the one baiting enemies into vision or executing a single target before dragon spawns.\n\n### Akali / Zed (assassin picks)\nIdentity shift: Only take assassin picks when your team will immediately convert. If you can’t guarantee follow-up, favor mobility boots and a defensive buy (QSS/GA) and time engagements to objective windows.\n\n### General mid-pool guidance\n- If you choose a roam-heavy champ (Ahri, LeBlanc, Syndra), make roams meaningful: pre-ward, shove, roam, and then be present for the next objective.\n- If you choose a split/scaling champ (Yone, Viktor, Riven), keep track of the scoreboard and always be within a TP/roam window for the objective — never be more than one wave’s travel away without vision or a plan.\n",
  "itemization_tips": "**Build Efficiency**. Pointed errors & quick fixes.\n- Repeated likely mistakes: not buying/placing enough control wards (games show frequent \"got picked before objective\"), and lacking situational defensive items when you’re repeatedly losing fights (many losses include high deaths/picks).\n- Mid champ rune/item defaults:\n  - Ahri: Electrocute > Manaflow > Transcendence; Items: Mobility/Hextech/Rabadon or Shadowflame; early Control Ward + Boots on first back; Zhonya’s vs high AD/assassin threat.\n  - Yone: Conqueror > Triumph > Legend > Last Stand; Items: Berserker’s -> Infinity Edge -> Phantom/GA or QSS if getting hard-CC. If you are getting picked often, prioritize early defensive (Phantom+PD into GA) rather than pure snowball.\n  - Viktor: Arcane Comet or Phase Rush depending on playstyle; early Hex Core upgrade; Items: early protobelt/upgrade, Morello/Rabadon, Zhonya’s situational, Void Staff late.\n  - Syndra / Leblanc: Electrocute > Sudden Impact; Lich/Shadowflame into Rabadon/Morello; early Control Ward and one Stopwatch if you’re getting prioritized in fights.\n- Universal tips:\n  - Buy at least one Control Ward every recall if you’re contesting dragon/baron. Make it a habit: \"back -> control ward\".\n  - If you die before objectives often, buy Stopwatch on one of your mid builds (Zhonya component) or QSS/GA earlier than usual.\n  - Swap to Mercury Treads vs heavy CC/AP and Plated/Tabi vs heavy AD auto-attackers — don't default to Berserker/Merc without context.\n  - Runes: If you want to be the playmaker, pick Electrocute/Phase Rush on roam champs; if you want to scale and skirmish, prefer Conqueror or Fleet for sustained trades.\n",
  "goals": "**Top 5 Strategic Priorities**. A ranked list of 5 concrete, actionable habits to fix the Root Cause. No fluff.\n1) Kill Participation Protocol (daily habit): Before minions spawn at :15 and :45, check objective timers. If dragon/baron < 90s, shove one wave and place 1 Control Ward in the river/tri-brush before joining your team. This converts lane priority to objective presence.\n2) Vision Routine (every back): Always return to lane with a Control Ward + Sweeper/Lens on at least every 2 recalls past 10 minutes. If you are mid, your control ward should live in the river or enemy raptor brush when objectives matter.\n3) Playstyle Commitment Rule (per game): Pick either \"Roam/Playmaker\" or \"Scale/Split\" pre-game and enforce it for first 20 minutes. If Roam: shove waves immediately and look for river/skirmish picks. If Scale: focus CS, buy defensive item timings, and be within reachable distance for objectives.\n4) Death-Reduction Decision Rule: When you have no vision of both enemy jungler and a side-lane opponent within 10s of objective spawn, refuse to facecheck or solo contest — back off and use abilities to zone instead. Implement a 1-second mental check before flashing/engaging: \"Is my sweep clear? Is a teammate within 2s?\" If not, don't go in.\n5) CS & Wave Management Micro-drills (3x weekly): 20-minute practice sets — 6-min segments where you must maintain >=7.5 CS/min on Yone/Viktor and 7.0+ on Ahri; practice slow/fast push recall windows (shove -> roams) so wave control becomes automatic and frees you to be present for objectives.\n"
}