{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: \"The Lone Duelist (The Duelist-Offline)\". You play like a high-skill skirmisher: comfortable in 1v1/2v2 fights and you carry a lot of damage on picks (Ahri, Yone, Syndra, Riven). Your CS and damage-share are near high-tier baselines and your avg KDA is above baseline, which shows solid mechanical ability. The problem: you operate too often as an isolated duelist — you either aren't present for neutral objectives or you arrive after fights are decided. Low KP (0.40 vs baseline 0.65), low vision (avg vis score 23), and repeated tags for \"got picked before objective\" and \"objective_gap\" show you win lanes or skirmishes but lose the macro game.\n\n2. **The Root Cause**: Macro discipline & objective presence. The symptom is repeated losses from \"low kill participation\", \"lost tower pressure\", and \"fell behind in dragon control.\" The cause isn't poor lane mechanics — it's a mindset and habit issue: you treat mid as a 1v1 lane or a solo-neutral farming lane instead of a central macro role. You either (a) play too far forward without vision and get picked before teams contest objectives, or (b) push/duel and then fail to convert lane pressure into objective control (no roam timing, insufficient warding, poor TP/rotation discipline). In short: you prioritize personal fights over team objectives and map control.\n\n3. **The 'One Big Thing'**: Own the objective window. If you make being at dragons/baron and leading vision the default habit — through wave management, predictable roam timings, and two control wards per objective window — most of your losses evaporate. Your single biggest climb lever is increasing kill participation by being present and alive at objective fights (not as a late skirmisher but as an engaged, visible teammate).",
  "champion_feedback": "### Ahri\nLane: Push less blindly — prioritize last-hit patterns that let you shove once and roam. Use Q+E trades to force a summoner or a flash before tower plates fall.\nMid game: After a successful trade or shove, immediately place deep vision and look for a roam to bot/top within 10–20s. If dragon spawns within 30s, stay mid to secure priority and present for the early fight — don't chase solo kills unless vision and allies are committed.\nLate game: You're the pick initiator. In teamfights, avoid solo flanks without vision; wait for enemy misposition or use R to flank after a frontline engage. Rune/Identity shift: become a playmaking roamer (create KP) instead of a roaming solo assassin.\n\n### Yone\nLane: Yone wants tempo and item lead. Stop hard-committing for solo kills if dragon is imminent. Use E resets to avoid overextending and always keep a control ward for side brush when you look to fight.\nMid game: If you're ahead, translate lead into tower plates and first dragon pressure — split only when your team has at least 1 or 2 vision tools around mid/drag. If behind, play safe and farm to 2-item spike; avoid solo flanks that get you picked.\nLate game: Yone must be alive to clean and pressure. Itemization shift: funnel some survivability (Death's Dance / Guardian Angel / QSS) when you repeatedly die pre-objective.\n\n### Syndra\nLane: Play as the pick mage. Push-wave control then sit on side of mid that gives pathing to dragon. Your strength is single-target removal — make that your role at objectives.\nMid game: Use balls to zone and secure vision around dragon. If you roam, shove first and use E+W to lock down a target for your team to convert — don't roam into an unwarded jungle.\nLate game: Stay in backline and be the decisive burst. If you are being dove/picked, prioritize Zhonya or Banshee earlier.\n\n### Lissandra\nLane: You're the teamfight initiator/peel. Your roams should be reactionary to jungle pressure. Don't die trying to force a 1v1 — your value is CC.\nMid game: Use R defensively to deny dives before baron/dragon. Sit with the objective, cut rotations, and be the front-line for enemy splitters.\nLate game: Play peel/engage; you want to CC a carry into ally follow-up, not solo-flank for a kill.\n\n### Viktor\nLane: Prioritize safe scaling — waveclear and control the mid-zone so you can secure baron/dragon windows. Don't take extended trades without vision of the enemy jungle.\nMid game: Your zoning from Viktor can enable objective takes. Stay mid or roam only after you fully shove and place a control ward.\nLate game: Kite and zone; don't be the first in. If your team lacks engage, stay slightly forward with a control ward to spot flankers.\n\n### Leblanc / Akali (Assassins)\nLane: Your entire identity is pick and roam. Shove, ward, and roam — but do it when your team is ready to follow. Avoid repeated greedy roams into unwarded jungle before objectives.\nMid game: Focus on removing enemy priority targets pre-dragon. If you can't reliably get picks, swap rune selection to less risk-heavy (Electrocute -> Dark Harvest only if your roam convert rate is high).\nLate game: Assassins must be patient. Wait for CC or use side lanes to apply pressure that forces enemy to recall so your team can take objectives.\n\n### Riven / Jax / Darius (when you play mid/top picks)\nIdentity mismatch: These champions demand side-lane priority and TP tempo. If you play them mid, commit fully to the split-push identity: secure control wards, force maps and call/demand jungle attention. If you prefer playing mid as a teamfight mage/assassin, avoid top-lane picks — they pull you away from mid objective control.\n\n(Overall identity shift for all picks): Move from a \"I will solo carry fights\" identity to \"I will create and convert objective windows.\" That means: better wave management, one extra Control Ward per back, and refusing to take risky out-of-vision fights within 20s of major objectives.",
  "itemization_tips": "**Build Efficiency**. Observed or likely mistakes and corrections:\n\n- Vision economy: Primary static mistake — not buying enough control wards and not timing Oracle Lens when approaching objective windows. Habit fix: buy a Control Ward every back until you have 2–3 placed around mid/dragon; sweep the enemy ward 15–30s before dragon/baron spawn.\n\n- Yone / Duelists: You're dying pre-objective because you build pure damage too often. Add one survivability mid-game (Death's Dance, Sterak's, or GA) when you notice being focused/picked. QSS against heavy CC before buying pure damage.\n\n- Mages/Assassins (Ahri, Syndra, Leblanc, Viktor): If you're the team's main damage yet have low damage share in losses, you're either building poorly for waveclear or dying early. Prioritize Sorcerer Boots + a major AP spike (Rabadon or Liandry's/Voidstaff according to enemy comp). Buy Zhonya's/Banshee when enemy engage/pick is high.\n\n- Rune alignment mistakes: If you often roam and create picks, Electrocute (or Dark Harvest if you regularly convert kills) fits Ahri/Leblanc/Syndra. If your role is poke/zone (Viktor/Lissandra), prefer Aery/Phase Rush/Glacial depending on playstyle — but don't mix a full glass-cannon rune with a playstyle that seeks frontline engagement.\n\n- Situational boots: Buy Mercury's/Plated vs heavy CC/AD if you're getting bursted before objectives. Swifties only when you need to chase/escape reliably for objective fights.\n\n- Objective items: Consider earlier Stopwatch/Zhonya's on mages when your team lacks front line and you're repeatedly targetted before fights. This is cheaper ladder insurance vs getting picked and losing objectives.\n\nSummary actionable item rules: +2 Control Wards per game minimum; if you die more than twice before a dragon, force a defensive purchase (Zhonya/GA/QSS) on next back; if your damage share <0.22 in losses, add one AP spike item earlier and play safer until it completes.",
  "goals": "**Top 5 Strategic Priorities**. Ranked, measurable, actionable.\n\n1) Objective Presence & Vision Routine (Primary): Be at 75% of dragon fights from minute 10 onward. Habit: before every dragon/baron timer, have at least 1 Control Ward placed + Oracle or Sweeper used 15–30s before spawn. Metric: avg_dragon_gap should move from -1.09 to >= -0.25 over 20 games.\n\n2) Increase Kill Participation (KP) to 0.60+: Convert shove into roams or teamfights. Habit: after you shove, count to 20 — if no push/ward vision, return to lane; otherwise roam with ping and a control ward. Target: KP 0.6 in next 50 games.\n\n3) Stop Getting Picked Before Objectives: If you are alone and enemy vision is unknown, never contest an objective without at least one ally or a control ward placed in the river. Habit: set a pre-objective checklist: 1) wave priority secured, 2) at least 1 control ward placed, 3) ally in vision. If any item missing — do not engage.\n\n4) Wave Management to Force Priority: Learn one wave-control pattern per champion (fast shove -> roam; slow freeze -> deny). Habit: practice these in 5 normal games per champion. Metric: reduce occurrences of \"lost a lot of tower pressure\" by converting mid tower plates early 1–2 times per lane win.\n\n5) Tactical Item/Rune Changes Based on Role Check: If you die twice in two consecutive objective windows, buy one defensive item next back. Habit: track your deaths vs objective spawn — if picked twice, purchase Zhonya/GA/QSS. Metric: reduce \"got_picked_before_objective\" tag rate from ~0.91 to <0.5 in the next 30 games.\n\nNo fluff — focus on making presence at objectives your default play, not an afterthought. That single change will raise your KP, objective control, and winrate much faster than chasing extra solo kills.",
  "confidence_notes": "Recommendations are driven by objective/vision tags, low KP, repeated \"got_picked_before_objective\" timeline events, and champion pool tendencies. If you want, I can convert these into a 2-week training plan with daily drills, specific ward locations per map phase, and exact item/rune loadouts per patch."
}