{
  "overview": "Markdown. **The Diagnosis**.\n\n1. **Your Archetype**: The Lone Duelist — a midlane skirmisher who wins through 1v1 outplay and wave dominance but too often operates disconnected from the map. Your KDA (3.49) and damage share (~24%) show you can carry individually, but your kill participation (0.403 vs 0.65 baseline) and repeated \"got picked before objective\" tags show you habitually play as an isolated threat rather than a coordinated objective engine.\n\n2. **The Root Cause**: A macro / identity mismatch + positioning problem. You pick or play champions (Yone, Riven, Yone-style skirmishers and Ahri as a roaming burst mage) that require either: A) disciplined wave management to create safe roams and objective pressure, or B) tight timing and vision to flank in teamfights. Instead you frequently either drift alone without vision (getting caught before objectives), fail to convert mid pressure into plates/dragons/barons (lost tower pressure & dragon gaps), or are not present for fights (low KP). Those behaviors explain the biggest loss drivers: \"low kill participation\", \"lost tower pressure\", and \"fell behind in dragon control\". When you do join fights, you sometimes die too early — a symptom of poor entry timing and lack of objective awareness.\n\n3. **The 'One Big Thing'**: Stop being a free pick before objectives. Prioritize objective-window positioning and vision discipline over individual outplays. If you can systematically avoid getting caught before dragons/baron and instead create or join clean fights (shove→roam with vision, or hold behind vision and flank), your kill participation, tower pressure and objective control will flip quickly and raise your winrate.\n",
  "champion_feedback": "Markdown. **Champion-Specific Adjustments**.\n\nYone (83 games, avg KDA 2.51, winrate 49%)\n- Identity shift: stop treating Yone as a pure solo snowball champ. Play Yone as a delayed skirmisher who either converts mid shove into objective pressure or waits to flank with vision. \n- Lane: prioritize wave management — freeze or slow-push to create safe roam windows. Avoid hard-trading under enemy tower without vision of enemy jungle. \n- Mid game: when dragon windows open, either be present with vision for flank or be the side pressure creating a numbers advantage — don’t split and then try to rejoin without control wards.\n- Item/rune note: Conqueror/Precision is standard. If you are getting picked, swap a damage item timing for Death's Dance or Mercurial when enemy CC/assassins target you.\n\nAhri (68 games, avg KDA 5.14, winrate 54%)\n- Identity shift: this is your best-fit champion — Ahri should be played as the team’s roaming engine and pick-maker. Double down on roams and objective setups. \n- Lane: shove fast when the wave is pushed and look to roam for plates / bot pressure. Keep a control ward in the river and use sweeper before roams. \n- Mid/Late: play around creating picks for dragons/barons. Use charm for pick, not solo all-in.\n- Rune/build: Electrocute or Dark Harvest for roams; consider early Morello vs heavy healing comps.\n\nRiven (42 games, winrate 62%)\n- Identity shift: Riven is naturally a side-lane skirmisher — if you play her mid, commit to split-push or be explicit about joining fights with a plan (engage or flank). Many \"lost tower pressure\"/\"lost Baron\" notes come from unclear role: are you top split or teamfight engage? Choose and stick.\n- Phase coaching: farm to 2-item spike safely; then look to hard-commit to side lane pressure or suffix as the engage tool when your team has vision.\n\nSyndra / Viktor / Lissandra (small-sample mages)\n- Syndra: play for picks — you win games by controlling vision and deleting a priority target; avoid facechecking objectives without your team. \n- Viktor: treat Viktor as a late-scaling zone-control pick — don’t force early roams; instead shove and secure mid towers and vision before objectives. \n- Lissandra: role is engage + peel. Use your ultimate defensively to prevent pre-objective picks; avoid being the first to walk into river without vision.\n\nAkali, Zed, Kassadin (assassin line)\n- If you choose assassins, accept a new identity: your job is to clean up fights after objective setups or to create picks via coordinated vision. Playing them as solo roamers without squad vision = high pick rate before objectives.\n\nGeneral guideline: pick 1 roaming-pick (Ahri / Syndra) and 1 skirmisher (Yone / Riven) and play them with distinct plans: Ahri = shove & roam to make picks for objectives; Yone/Riven = shove to create side pressure OR hold to flank, but never both at once.",
  "itemization_tips": "Markdown. **Build Efficiency**.\n\n- Vision is an item: buy and place control wards proactively before every objective window. Run Oracle/Lens to clear enemy vision when you plan to flank. Your \"got picked before objective\" stat screams missing ward timing rather than raw itemization.\n\n- Defensive swaps when targeted: on champions that die a lot (Yone, Akali, Lissandra), shift one offensive item buy into a defensive/utility option if you are repeatedly the target. Examples: Death's Dance / Sterak's / Guardian Angel on Yone; Mercury's or Edge of Night vs heavy CC/assassins; Zhonya’s Hourglass on Viktor/Lissandra/Syndra as a timing item to avoid being bursted pre-objective.\n\n- Rune tune-ups: Ahri — Electrocute (or Dark Harvest) + Cheap Shot/Ultimate Hunter for roam pressure. Yone — Conqueror/Legend + Triumph for 1v1 fights. Riven — Conqueror + Tenacity where required.\n\n- Objective-focused buys: when your team lacks objective control (dragon/baron losses), prioritize early Boots + Control Ward over a second full damage item. Boots allow you to reach fights/ward zones faster and secure participation.\n\n- Stop over-committing to pure DPS on champions you're getting picked on. If you see repeated deaths on the mid-timing (pre-dragon/baron), the shortest path to fewer deaths is a single utility/defense purchase that keeps you alive to contest and participate.",
  "goals": "Markdown. **Top 5 Strategic Priorities**.\n\n1) Vision + Positioning checklist before every objective (dragon/baron/plate). Concrete habit: before the objective spawns, place 1 control ward and sweep enemy vision in the river and flank brushes. If you cannot clear vision or hold a flank, do not be the first to step into pit — hold and wait for teammates.\n\n2) Shove→Roam→Convert routine (every time wave is shoved to enemy tower). Concrete habit: when you have minion wave on their tower, shove fast, roam within 10–20s to side lane or mid/bot to take plates or a kill, and return or take teleport. Record whether each roam secured a plate/kill/objective; aim for 3 successful conversions per 5 roams.\n\n3) Kill Participation target: increase KP from ~0.40 → ~0.55 within 4 weeks by making yourself visibly present at objective windows. Concrete habit: ping/communicate intent 5s before objective, align ultimate/flash timing with team, and only commit if you have lane vision or a saved summoner/ultimate.\n\n4) Death-minimization rule: reduce \"picked before objective\" events by 50% in the next 20 games. Concrete habit: if you would normally enter river alone to create vision, instead ask for a teammate to accompany you or wait for sweepers/wards. If you die on a flank attempt with no vision, mark it as a failed attempt and analyze the replay for exact misstep.\n\n5) Champion-pool consolidation & role clarity: restrict to 2 mid champions for ranked streaks: a) Ahri (roamer/pick) and b) Yone or Riven (skirmisher/split). For each champion, write a 3-step gameplan before queueing: lane goal (farm/shove/free-roam), midgame goal (objective pressure/vision duty), late game goal (flank/peel/split). Stick to those plans and review one replay per day to check compliance.\n\nNo fluff: these five habits directly attack the root causes — vision/positioning, conversion of lane pressure, participation in objectives, and role clarity — and will yield immediate improvements to objective control and winrate if practiced consistently."
}