{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: The \"Nice Guy Enchanter\". You play to keep teammates alive (very high KDA, low personal damage share, above-baseline CS for a utility role). You show strong lane/roam fundamentals on Ivern and create safety for carries, but you are not converting that into objective control or consistent map influence. Your games are won when you stay alive and protect — lost when your team loses map control or you get caught before objectives.\n\n2. **The Root Cause**: A macro/role-discipline mismatch. You default to a safe, peel-first identity (Ivern-style) but you don't fully take on the objective-control responsibilities that identity requires. That looks like: not committing to consistent deep vision and vision-clear before Barons/dragons, poor positioning around objectives (getting picked), and delayed or inefficient support-item and Oracle/Control Ward timing. In short: you protect in skirmishes but you don't secure the space that allows your team to take objectives safely — which becomes the proximate cause of losses (lost Baron/dragon/towers).\n\n3. **The 'One Big Thing'**: Stop getting picked before objectives. Train an objective-centered routine: pre-objective vision sweep + two safe entry positions (peel anchor and vision watcher), upgrade to Oracle when contesting Baron/elder, and buy/build Locket/Redemption timing to win AoE objective fights. If you fix the pre-objective vision+positioning discipline, everything else (KP, damage share, objective control) improves quickly.",
  "champion_feedback": "### Ivern\n- Identity shift: move from \"passive healbot\" to \"objective anchor + vision commander.\" As Ivern you must control sightlines and create safety for your team before an objective — use Daisy and brush control to zone enemies, but position Daisy as a frontline body rather than sending yourself alone.\n- Early game: prioritize scuttle/river vision and deep control wards; use bushes to threaten entrances to Baron/Dragon and deny enemy sweep.\n- Mid/late game: buy Locket (vs AP/AD AoE) and Redemption. Time your Moonstone/Shurelya choices based on whether your team needs heals or engage speed. Use Daisy to bait facechecks and to bodyblock skillshots during contests.\n- Runes/items: Guardian or Summon Aery primary; Manaflow Band, Transcendence, Cosmic Insight. Build support item -> Boots -> Locket -> Redemption/Staff of Flowing Water/Ardent. Upgrade Oracle Lens before contesting Baron (one of your highest failure points).\n\n### Morgana\n- Identity shift: from \"idle binding machine\" to \"roamer + objective pivot.\" Your strength is picks and roaming; use that to secure mid river and early dragon vision rather than staying glued to ADC.\n- Early game: take Spellthief start, build Mobility Boots if you plan to roam. Early mid roam to place deep control wards and secure scuttle or mid prio helps increase KP and reduce 'picked before objective'.\n- Mid/late game: use Black Shield proactively to enable engages and to save scorers during Baron fights. If enemy comp has heavy CC, prefer Locket + Mikael/Redemption synergy.\n- Runes/items: Aery/Guardian or Arcane Comet if you want poke roams. Key items: Locket if enemy has team AoE, Redemption for contest sustain, Mobility Boots + Control Wards to improve map control.\n\n### Xerath\n- Identity shift: stay the long-range artillery — don't become front-line. Your job is to zone the enemy from objective fights and poke them down before they commit.\n- Early game: push wave to relieve pressure and then roam vision; place deep poke from safety before Dragon starts. Use his range to contest vision control without facechecking.\n- Mid/late game: prioritize positioning behind your team during Baron/Dragon, mark flanks and punish enemies who try to clear wards. Buy Banshee's or Zhonya's situationally to avoid being the pick that loses the objective.\n- Runes/items: Arcane Comet or Aery with Manaflow and Transcendence; build AP-support items when in utility role (Imperial Mandate/Shard/Control Ward economy) or build standard poke AP if playing mid.\n\n### Mordekaiser\n- Advice: stop bringing Morde into utility games unless you're playing strictly as a split-push win condition. Morde's identity is side-lane pressure, not objective-space control for your team. If you want to influence objectives with Morde, commit to split pressure and force enemy rotations rather than trying to group as a traditional support/jungle.\n",
  "itemization_tips": "**Build Efficiency**. Observed mistakes and corrections:\n- Vision economy deficit: your loss patterns point to too few control wards / late Oracle Lens. Rule: before any contested Baron, you must have placed 2+ Control Wards and have Oracle active or a teammate dedicated to sweeps.\n- Defensive/utility items timing: many losses come from large AoE objective fights where a single Locket or Redemption would swing outcomes. On Ivern and Morgana prioritize Locket vs AoE comps and Redemption for healing zoning. Purchase Locket as your team’s second or third major completed item in objective-heavy games.\n- Support item upgrade lag: upgrade your support item earlier (ideally by minute 12–16) so you gain the warding and active utility sooner — this increases KP and vision score impact.\n- Rune mismatches: if you play Morgana/Ivern as peel/support, favor Guardian/Aery over Electrocute/Comet. Guardian/Aery increases survivability for carries and reduces 'picked before objective' frequency.\n- Situational defensive buys for poke supports: for Xerath, consider Banshee's before the final fight if you are getting focused — losing Xerath early usually means losing the objective.\n",
  "goals": "**Top 5 Strategic Priorities**. Ranked, concrete, repeatable habits:\n1. Pre-objective checklist (non-negotiable): 2x Control Wards placed on approach, at least one sweep attempt with Oracle/ally, and clear enemy wards inside 45 seconds before you start Baron/Dragon. If checklist fails, do NOT engage.\n2. Position template: define two roles before the fight — (A) peel anchor (Ivern/Morgana backline peel + Locket) and (B) vision watcher/flank (safe spot to spot enemy flank). Choose one and execute; don’t switch mid-fight.\n3. Oracle timing rule: buy Oracle Lens by the time enemy has second jungle item or at ~20–25 minutes in objective-focused games. If you are on Ivern/Morgana/Xerath, aim to have the first Oracle by the second dragon spawn.\n4. Item timing rule: prioritize completing one teamfight utility item (Locket or Redemption) before attempting to contest 2nd Baron/third dragon. If you cannot afford it, force the enemy to make the first risky play instead of you.\n5. Roam & KP routine: in the first 12–18 minutes, perform two proactive roams to mid/jungle to secure scuttle or deep vision and increase KP. Use these roams to practice the vision-clear + safe-position sequence so it becomes automatic before late-game objectives.\n"
}