{
  "overview": "Markdown. **The Diagnosis**.\n\n1. **Your Archetype**: The Isolated Duelist.\n   - Who you are: you prefer skirmish/duelist champions (Yone, Riven) and play to create individual fights and outplays rather than to be the hub of objective fights. Your output numbers show a player who often deals decent damage and farms reasonably but doesn't convert that into team-level control: KDA and damage share are slightly below high-tier baselines, and your kill participation (~40%) is the biggest divergence (well under the ~65% target).\n   - Behavior pattern: you win more when you single-handedly create advantages (Riven spikes) but you lose when those solo plays do not become team objectives or when you get caught alone — many losses show \"got picked before objective\", dropped tower pressure, and objective gaps.\n\n2. **The Root Cause**: Macro discipline + identity mismatch.\n   - Symptom: low kill participation, repeating \"picked before objectives,\" losing towers and objective control.\n   - Why: you habitually treat mid as a solo skirmish lane rather than the game's objective tempo anchor. You either push or look for 1v1s without securing vision or team proximity, so your fights are isolated and don't translate into dragons/barons/towers. When you try to play a control/scale champion (Viktor/Ahri), you still drift toward the duel mindset and fail to adjust your macro to protect objectives.\n   - Underlying habit/mindset: you prioritize mechanical skirmishes (individual outplays) over simple macro rules — vision before objective, group windows, and wave control — which turns good personal stats into team losses.\n\n3. **The 'One Big Thing'**: Stop being the solo playmaker and become the objective-attached playmaker.\n   - Concrete framing: before every neutral objective (dragon/baron/rift herald/tower contest), be in a position where you can either contest safely with vision and allies or actively back off. Your single biggest lever is raising your kill participation and presence at objectives (target: KP ~0.60). If you increase presence and reduce pre-objective picks, most of the \"lost tower pressure\" and \"objective gap\" loss reasons disappear.\n",
  "champion_feedback": "Markdown. **Champion-Specific Adjustments**.\n\nYone (11 games)\n- Stop playing Yone as a roaming solo trigger. He wins when he converts isolated kills into tower/dragon tempo. Instead: use wave control (slow push then recall) to create a roam window with the team; when contesting objectives, position to follow-up on enemy engage rather than face-checking river alone. If you're getting picked, prioritize QSS or Sterak/Death's Dance as second/third items depending on CC and burst.\n- Lane coaching: early game play safer until 2 items; avoid all-in fights without jungle priority and river vision.\n- Mid/late game: use your ultimate to join teamfights after frontliners engage; avoid splitting into enemy vision when your team lacks pressure.\n\nRiven (3 games)\n- This is your best-performing outlier. Keep playing Riven as a side-lane duelist: apply split pressure, force enemy responses, then convert to tower plates. But when teamfights go late vs scaling comps, match your split with pressure windows (create teleport/pressure to prevent your team from being outscaled).\n- Don't force 50/50 extended fights if game is clearly going to teamfight phase without proper vision.\n\nAhri (3 games)\n- Ahri's strength is picks and roams — use her to create the very thing you're missing: coordinated picks before objectives, not solo pushes. Before roaming, ensure river/top-side control wards and a visible enemy midlaner or a lane shove.\n- If behind, prioritize waveclear and safe farm; avoid roaming into unwarded river and getting caught before dragons.\n\nViktor (2 games) & Syndra (1 game)\n- These are your controlled teamfight champions. Their role is to scale and zone — play them as the team's damage anchor in fights, not as skirmish initiators. That means buy defensive stats when you're the main target: early Seeker's/negatron into zoning build, position far back, and focus on pattern: farm safely → roam only when lanes are shoved → hold for objective windows.\n\nChampion pool advice (practical):\n- Consolidate to 2 primary mid identities: 1) Skirmisher/assassin (Yone) and 2) Control/Burst (Viktor or Syndra or Ahri). Practice each identity in blocks (10 games each) and force yourself to follow the macro script for that identity: Yone = side pressure + team follow-ups; Viktor/Syndra = scale + zone + protect objectives.\n- If you want to climb faster, prefer Viktor/Syndra/Ahri as your ",
  "itemization_tips": "Markdown. **Build Efficiency**.\n\nStatic errors visible in the data (inferred):\n- You die to picks often → adaptive defensive buys are inconsistent. If you're being burst/CC'd before objectives, prioritize QSS/Edge of Night/Guardian Angel depending on threat type. For Yone, Death's Dance or Sterak's can turn \"I die first\" into \"I survive to output damage.\"\n- Boots and tenacity: vs heavy CC/AP burst, escalate to Mercury's Treads early; vs AD heavy or mobile threats, consider Plated Steelcaps.\n- Mid/AP builds: Viktor/Syndra/Ahri should prioritize waveclear + item timing that secures mid-game zone control (Viktor upgrades/later power spikes). If you're losing objective fights, augment build with Zhonya's if you're being dove/prioritized.\n- Vision items: you're losing tower & objective control — buy and place a control ward on every roam/recall (min 2 per 10 minutes). If you are the primary objective-engager, have an Eye of the Watcher/Oracle buy plan: at least 1 early Control Ward pre-dragon and an early Oracle/Red trinket swap before high-commit objectives.\n- Runes: match runes to your role in teamplay. If you plan to play Yone as the team skirmisher, take a rune set that rewards survivability and sustained damage (Conqueror/Presence of Mind or Triumph). If you plan to play control mages, take Electrocute/Aery/Phase Rush accordingly but prioritize setups that maximize teamfight contribution, not solo burst that gets you picked.\n\nShort rule: adjust your build + runes for the game state — defensive tools when your team lacks peel, vision tools when objective fights are lost, and waveclear items when you're tasked with protecting towers.\n",
  "goals": "Markdown. **Top 5 Strategic Priorities**. A ranked list of 5 concrete, actionable habits to fix the Root Cause. No fluff.\n\n1) Increase Kill Participation (KP) to ~0.6 within 8 weeks.\n   - Action: set a personal rule: be within 2500 units of any neutral objective 30 seconds before spawn OR hold river/control wards. If not, back off — don't fight.\n\n2) Eliminate \"picked before objective\" mistakes.\n   - Action: before every objective, perform a 10-second checklist: wave state (safe/pushed), vision (2+ control wards or enemy visible), allies (at least 2 teammates nearby). If checklist fails, reset and do not contest.\n\n3) Vision & Objective habit loop.\n   - Actionable habit: buy at least one Control Ward every recall in lane until 15 minutes, and swap to Oracle/Red trinket 30–60 seconds before dragons/baron. Clear one enemy ward around objective every 30 seconds while prepping it.\n\n4) Wave management discipline.\n   - Action: practice two wave states per game: slow freeze to deny roams and slow push to create safe roam windows. If playing Yone, only roam on a slow push or after securing river vision. If mid has priority, convert it immediately into either plates or dragon setup.\n\n5) Narrow and practice champion identities (2 champions, 10-game blocks).\n   - Action: pick one skirmisher (Yone) and one control/burst mid (Viktor or Syndra/Ahri). Play 10 games on one identity focusing purely on its macro script (Yone = side pressure + team follow-ups; Viktor/Syndra/Ahri = farm + zone + pick with vision). Review replays for one picked-before-objective mistake per game and correct it.\n\nIf you adopt these five priorities, the immediate measurable outcomes will be fewer pre-objective deaths, higher KP, fewer lost towers from solo plays, and more games where your individual contributions convert into team objectives."
}