{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: \"The KDA Soloist — The Quiet Objective Leak\". You consistently keep a strong personal scoreline (high KDA) and farm close to a high baseline, but you under-contribute where junglers win games: objective control, team kill participation and map pressure. You look like a player who avoids getting punished individually (so your KDA and winrate stay healthy) but doesn't reliably translate presence into dragons, barons, towers or coordinated fights. Your damage share and KP are below the Diamond/Master baseline while your KDA is above it — classic sign of a safe, low-commitment playstyle that wins some games by avoiding mistakes but loses the macro battles.\n\n2. **The Root Cause**: A habit and identity mismatch: you default to staying operationally safe (farming, scoring high KDA, picking isolated fights) instead of assuming the proactive, timing-driven responsibilities of a jungler. That produces two recurring failures: (A) poor pre-objective discipline — you (or your team) get picked before objectives because vision, lane prio checks and pathing are not enforced; and (B) failure to convert side-lane or small leads into objective/tower control (you either aren’t there when it matters or aren’t using your champion toolkit to force objective fights). In short, mindset = “don’t die, stay useful” but the job actually often requires controlled aggression and deliberate objective set-ups.\n\n3. **The 'One Big Thing'**: Become the objective controller: adopt a pre-objective routine (vision, lane prio check, flank/setup) and force your team into objective fights on your timing. If you master a repeatable pre-objective checklist and pathing that gets you to drake/baron windows with vision and flanks prepared, most of your loss patterns (dragon gap, baron gap, tower pressure, getting picked before objectives) will vanish.\n",
  "champion_feedback": "**Champion-Specific Adjustments**. Use these identity shifts per pick — think: \"How does this champion win objectives?\" \n\n### FiddleSticks\n- Identity shift: from \"safe farm and occasional ult\" to \"tempo controller and zone enabler for objectives.\"\n- Early game: prioritize enemy jungle scans and lane prio checks over slow farms. If lanes are pushable, plant deep vision and look to counter-gank; an early successful rift or deep plant gives you the numbers edge for dragon starts.\n- Mid game: use Crowstorm to zone and force enemies off drake/baron — your strongest role is to flank, clear enemy vision beforehand with Oracle/Control Wards, and ult from fog. If you ult into a losing vision situation, you get picked — so don’t ult blind. \n- Late game: you’re a fight-decider. Focus on positioning to hit the backline and deny enemy resets; if you can’t find safe flank windows, prioritize objective denial (sweep/control). \n- Practical tweak: swap a more defensive rune/playstyle for earlier control tools (sweep, extra control wards) when objective fights are likely.\n\n### Trundle\n- Identity shift: from \"side lane bully\" to \"objective and tower demolisher.\"\n- Early game: prize lane priority and shove with pillar to force rotations — translate kills/pressure directly into tower plates/first brick or secure drake setups. \n- Mid game: use pillar aggressively to disrupt enemy contester angles and cut off escape paths during dragon/baron. You should be on the objective when it matters — your pillar wins fights and steals bars when placed correctly.\n- Late game: split or flank to force 5v4s; if you get a favorable 1v1 you must turn it into tower pressure rather than just farming.\n\n### Zyra (utility/pick style)\n- Identity shift: from AP-farm approach to \"vision and pick enabler.\" Zyra in jungle is a pick tool — don’t treat her as a farming jungler. \n- Early game: look to roam/mid ganks and deep plant vision. Your plants and root are best used to secure picks off-lane; that lead must be converted into dragons/towers by pinging and warding objectives.\n- Mid game: avoid being the solo farmer; your job is to control vision around drake and provide zoning in small fights so allies can secure objectives.\n\n### Rammus\n- Identity shift: from \"occasional engage\" to \"timed frontliner who forces objective fights.\"\n- Habit change: be proactive with Powerball ganks to relieve lane pressure and force enemy summoners — pillar/taunt combos should be used to force enemies off drake and isolate carries. If you’re getting low CS and low impact, tighten jungle routes to include scuttle control and two gank attempts per clear.\n\n### Lillia / Dr. Mundo (skirmisher/juggernaut)\n- Identity shift for Lillia: farm-first to reach 2-item skirmish windows; don’t force early objective contests unless you can guarantee a flank or numbers advantage.\n- Identity shift for Mundo: use side pressure to convert into towers; when you split, ping and force enemy to respond rather than letting objectives go uncontested.\n\nChampion pool advice: narrow to 2–3 champions that you can play like an objective controller. Best fits from your data: Fiddle (teamfight/zone control) + Trundle (tower/objective pressure) as a primary duo — they complement each other and cover the two styles you need. Add 1 reliable melee engage (Rammus or another tank with higher success after focused practice) or a contesting skirmisher (Jarvan/Kindred/Graves if comfortable) to solidify early objective fights.",
  "itemization_tips": "**Build Efficiency**. Point out static build errors or rune mistakes seen in the data.\n\n- Vision first: your losses frequently list \"got picked before objective\" — the single cheapest fix is consistent Control Wards + Oracle Lens timing. Consciously buy a Control Ward before every drake and carry a sweep when approaching Baron. Make 2+ Control Wards/game a baseline.\n- Boots and Mobility: If you want to increase KP, consider Mobility-type boots on gank-focused games (or earlier boots upgrade) for faster roam to lanes and objectives. For short-range engage champs (Trundle/Rammus), early boots timing to pressure side lanes matters.\n- Damage vs. Utility balance: Your below-baseline damage share suggests either building too defensively on champions that should carry damage (e.g., Trundle/Mundo) or playing them as tanks. On Trundle, prioritize a hybrid of damage and sustain so you can threaten towers and win skirmishes quickly. On Fiddle and Zyra, prioritize item spikes that maximize AOE zoning and sustained DPS (items that increase consistent teamfight pressure vs. one-shot burst). \n- Runes: choose keystones that match your objective role rather than personal safety. For Fiddle/Zyra, keystones that reward roams and pick pressure (Dark Harvest/Electrocute) amplify your ability to force plays. For Rammus, Aftershock/Grasp is better than pure tank scaling if you want immediate gank power. For Lillia, stick to skirmish keystone that extends fights (Conqueror/Phase Rush depending on matchups).\n- Practical checklist (in items/runes): 1) Pack a Control Ward at minute ~6 and before first drake; 2) buy Oracle Lens before any contested Baron attempt; 3) choose boots/runes that enhance your early roaming pace if you must increase KP.\n",
  "goals": "**Top 5 Strategic Priorities**. A ranked list of 5 concrete, actionable habits to fix the Root Cause. No fluff.\n\n1) Pre-Objective Checklist (non-negotiable): before every dragon/baron attempt, execute: lanes pushed or pings made -> 2+ control wards in vicinity -> sweep enemy approaches (Oracle) -> your flank position set -> call the start. If any item in checklist fails, do not start the objective. Target: reduce \"got picked before objective\" to 0 in next 20 games.\n\n2) Path to KP: design and rehearse two standard early-paths per champion that guarantee 2 meaningful gank attempts before 8 minutes (scuttle control + one lane gank or counter-gank). Measurable: increase avg_kp from 0.459 to 0.60 within one patch cycle.\n\n3) Vision Budget: place at least 2 Control Wards per game and use Oracle for every objective approach. Track placement: 1 at river/tribush by minute 6, 1 swapped to drake pit before first dragon. Measurable: avg_dragon_gap should move from -1.875 to ≥0.\n\n4) Convert Pressure to Towers: whenever you win a 2v2/3v3 near side lanes, force plates/tower damage. If you’re playing Trundle or DrMundo, blueprint a rotation after every small skirmish: shove wave -> take tower plates -> reset for dragon. Measurable: reduce \"lost a lot of tower pressure\" incidents in loss logs by 75%.\n\n5) Narrow & Rehearse Pool: play only Fiddle and Trundle (plus one backup like Rammus) for your next 40 ranked games. In each champion, run focused reviews (5 replays each) where you timestamp: a) pre-objective decisions; b) moments you were absent for a dragon/baron; c) times you got picked before objective. Convert those notes into route adjustments and a one-paragraph game plan you read before champion select.\n\nFollow those priorities in order: they directly address the objective control, pick-before-objective, and low KP issues that are the primary bottlenecks to climbing."
}