{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: \"The Solo-Duelist, Objective-Agnostic Skirmisher\". You play like a 1v1/roam-first mid laner — you favor skirmish-heavy champions (Yone, Riven, Ahri, Syndra) and your raw numbers show that strength: CS/min and damage share are close to higher-tier baselines and your overall KDA is fine. But your kill participation (0.40 vs a 0.65 baseline), low vision, and repeated objective gaps show you often aren’t synchronized with the team. You win when you convert your duels into solo pressure; you lose when your fights don’t translate into dragons, towers or Baron control.\n\n2. **The Root Cause**: Macro discipline and identity mismatch. You habitually treat mid like a lane to win by outdueling and roaming rather than as the game's objective-control fulcrum. Symptoms and their causes:\n   - Symptom: Chronic \"low kill participation\" and \"lost tower/dragon/baron control.\" Cause: you either over-extend for solo plays or push waves and leave without vision/communicating, so the team doesn't get objective timing or setup.\n   - Symptom: \"Got picked before objectives\" and high deaths in several losses. Cause: repeated poor positioning around objective windows (walking into contested river/sidebrush without sweepers or team), impatience to force plays, and a habit of taking fights on your terms rather than on your team's terms.\n   - Symptom: Inconsistent performance by champion (Yone low KDA, Ahri high KDA, Lissandra poor). Cause: an over-broad pool and mixing split/duelist champions with control mages without clear role-play change (you play the same aggression template across different champions that demand different macro incentives).\n\n3. **The 'One Big Thing'**: Kill participation + objective presence. If you shift priorities from \"winning my fight\" to \"being alive and positioned to convert fights into dragons/towers/Baron,\" your winrate will increase fastest. That single behavioral change (stay for the objective windows, buy/clear vision, and only take fights where your team is ready) remediates the largest cluster of losses here.\n",
  "champion_feedback": "**Champion-Specific Adjustments**\n\n### Yone\n- Identity shift: stop treating Yone as purely a roam-first duelist. Yone's strength is a 2-item teamfight carry and side-pressure. Prioritize safe scaling to your power spike (BORK/IE or crit path you prefer) and avoid aggressive facechecks pre-spike.\n- Lane phase: play for controlled pushes and resets. Force slowpushes into mid to roam only when deep vision is available or your roam creates a guaranteed objective window (dragon/plate). Avoid risky roams that leave mid open to plates/tower damage.\n- Mid/Late: if you have tempo to side, shove a wave and join your team for neutral objectives. If the team is contesting dragon/Baron, be the flank; do not solo facecheck brushes.\n- Positioning: stop being the player getting \"picked before objectives\" — enter objectives from angles with vision and wait for teammates to commit.\n\n### Ahri\n- Play the role you already do well: roamer and pick creator. Convert roams into objective control by pinging dragon timing and tracking enemy jungler.\n- Lane: use charm to push enemies off dragon vision, then clear a wave and rotate with priority. If you pick someone, immediately force dragon or tower plates instead of chasing for long resets.\n- Mid/Late: keep playing picks but buy control wards and use Oracle Lens before objective fights so your picks aren't traded by losing vision.\n\n### Riven (when you pick it in mid/top games)\n- Identity: split/skirmish hero who needs a crafted win condition. If you draft Riven, commit to side-lane priority and TP plays, not random mid fights.\n- Midgame: if ahead, convert kills into towers and dragon control. If behind, play safe in sidelanes and wait for your team to create space — don't try to force 1v1s around contested objectives.\n\n### Viktor / Syndra / Lissandra\n- Viktor: your rune and item habits show safe scaling. Prioritize wave control (E) and buying earlier components to match mid-game spikes; your core role is zone-and-control — be present to contest barons with your zone.\n- Syndra: high winrate in few games; when you play Syndra, play for safe pick windows and use raw burst to remove a high-value target before fights start. Again: convert picks into objective claims.\n- Lissandra: low winrate signals execution issues — use Lissandra primarily as a teamfight engage/peel tool: land R -> W combos when your team is ready and don’t solo flank into visionless objectives.\n",
  "itemization_tips": "**Build Efficiency**\n\n- Yone: You lean heavily into lifesteal and hypercarry items (BOTRK, Shieldbow, IE) with Lethal Tempo. That's a valid plan, but only if you consistently reach the 2-item spike safely. If you find yourself dying pre-spike, deprioritize Shieldbow as a pacifier and instead aim to finish critical AD/crit components quicker so you can pressure towers and objectives earlier. Also carry a control ward and consider swapping an offensive potion or component for earlier survivability if you get picked often.\n\n- Ahri: Malignance + Rabadon/Lich Bane shows you favor survivability and burst. That's fine — but when you play Ahri as the team's pickmaker, buy faster magic-penetration or utility earlier (e.g., Shard/upgraded boots timing) to ensure your picks convert into objective advantages. If you repeatedly leave fights without objectives, trade an offensive late item for earlier movement/vision tools.\n\n- Riven: Your Riven builds (Sundered Sky / Death's Dance / Eclipse) are consistent with a skirmish-split identity. The execution gap is not the items — it's when you choose to use those windows. When you have a lead, convert into plates/dragon; when not, avoid risky invades.\n\n- Viktor/Lissandra/Syndra: Your item paths trend toward classic scaling; ensure you prioritize components that increase waveclear and objective pressure (i.e., earlier mana/stack components or items that let you zone). For Viktor specifically, buying the early powerspike parts instead of delaying a full Rabadon will improve your ability to influence mid-game drake fights.\n\n- Rune observations: Using Lethal Tempo on Yone is fine mechanically; for Viktor running Summon Aery 100% is unusual but acceptable if it consistently helps your laning. The larger problem is not the rune choice but the mismatch between rune/champion intent and your macro — pick runes that reinforce the game plan (e.g., roams/picks vs. scaling).\n",
  "goals": "**Top 5 Strategic Priorities**\n\n1. Objective Presence Rule: Be within 2500 units of the dragon/baron when it spawns (or be the designated split threat). If you are not within that window, do not engage deep roams that leave the objective unattended. (Concrete: set a mental timer for dragon spawn and be in river vision 15–20s before.)\n\n2. Kill Participation Habit: Before you take a trade, ask: \"Does this trade create a path to dragon/plate/Baron?\" If the answer is no, opt to farm or reset. Goal: increase KP from ~0.40 to 0.55 in the next 50 games by forcing 1–2 more objective-linked rotations per game.\n\n3. Vision & Entry Discipline: Start every objective fight with 1 control ward on the objective side and Oracle Lens cleared by the team lead (ping it). If you get picked before an objective, record the replay of that minute and identify the missing vision/angle. Goal: double your avg vision score around objective times (focus vision, not raw score).\n\n4. Pool Consolidation: Restrict your ranked champion pool to 3 primary mids in your next 100 games — one skirmisher (Yone/Riven if you insist on split), one pick/roamer (Ahri/Syndra), and one control scaler (Viktor). Practice each with a specific script: lane behavior, roam timing, and objective role.\n\n5. Wave Management Drill: Spend 20 minutes in custom/practice split doing two tasks: (a) slowpush into enemy mid and then instantly rotate to dragon within 10s; (b) freeze mid and deny plate while your team secures an objective. Apply those patterns in games: when you shove, you immediately move to the objective if your team is contesting.\n\nExecute these five in order: improving objective presence and kill participation will eliminate most of the loss patterns flagged in your review; vision/discipline and a tightened champion pool will make your mechanical strengths translate into consistent wins.\n"
}