{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: \"The Mid-Map Phantom\". You consistently hit baseline mechanical metrics (KDA slightly above, CS near high-elo baseline, damage share near baseline) but you are rarely the visible engine of teamwide objectives. You play champion types that can both carry (Yone, Ahri, Viktor) and create picks (Syndra/Lissandra), yet your kill participation (0.399 vs 0.65 baseline) and vision/objective impact are low. That makes you a mid laner who performs well in isolated fights but fails to translate lane priority into towers, dragons, Baron control or teamfights — you appear on damage/heal sheets but not on the scoreboard that wins games.\n\n2. **The Root Cause**: You have an identity/role execution gap: you oscillate between two competing mid styles without committing to the map-impact part of either. When you play skirmishers (Yone/Riven) you often treat mid like a solo 1v1 lane instead of a side-pressure engine (result: lost tower pressure, picks, and objective deficits). When you play control/burst mages (Ahri/Viktor/Syndra) you secure lane trades but then fail to convert wave advantage into roams or objective control (result: low KP, dragon/baron gaps, picks-before-objectives). Compounding this is poor discipline around objectives: frequent picks before objectives and low vision usage around objective windows (macro tags: objective_gap=1.0, got_picked_before_objective=0.75). In short: you can win lanes, but you don't reliably turn lane wins into team wins because of roaming timing, wave management, and vision/positioning failures.\n\n3. **The 'One Big Thing'**: Increase your mid-lane MAP IMPACT (roam timing + wave management + objective awareness). If you can reliably convert a pushed wave into a successful roam or properly secure vision/control before objectives, your KP, objective control, and tower pressure numbers will rise and remove the largest bottleneck to climbing.\n",
  "champion_feedback": "**Champion-Specific Adjustments**\n\n### Yone\n- Identity: Treat Yone as a split/snowball skirmisher, not a pure mid-teamfighting ADC. Your Yone games show good CS but low KP and repeated objective/tower losses. That means you're often farming but not leveraging the push.\n- Mechanical/phase corrections: shove the wave and then immediately look for a roam if enemy mid is dead or forced back — aim to convert one successful roam every time you get a clear wave (or secure deep vision and back to join for dragon if flashing is available). Avoid solo aggressive roams into unscouted enemy jungle; die-before-objectives is a recurring theme.\n- Mental cue: after clearing a wave, ask: \"Can I 20–40s roam safely?\" If not, freeze/slow-push to deny the enemy mid and help your jungler contest dragon.\n\n### Ahri\n- Identity: Your Ahri produces strong KDA but still sits out of fights/objective contests. Ahri's strength is roaming; make it explicit.\n- Mechanical/phase corrections: use W+R windows to roam after full wave shove (level 6 roam windows are gold). Place a control ward in river before committing to dragon skirmish; your team loses dragon control when mid doesn't provide vision or timely presence.\n- Mental cue: when you see bottom/top enemies pushed or their summoners down, pull the trigger to roam (or force them to use sums and then take objective priority).\n\n### Viktor\n- Identity: Viktor is a zone-control scaling battlemage. Your Viktor wins when you control mid and force fights on your terms, but losses show failure to translate that into objectives.\n- Mechanical/phase corrections: prioritize safe scaling and mid pressure—clear waves and hold mid control to deny enemy roams. Use your control to secure dragon entrances with vision rather than trading a facecheck for a pick.\n\n### Riven\n- Identity: Riven games have high winrate but are often played top — when you roam/top-split, avoid being absent at objective windows. Riven wants to split only when your team can hold or force elsewhere.\n- Mechanical/phase corrections: if you're the side-lane champ, set a split-timing rule: split when you have 2-item spike and communicate a TP or group schedule; otherwise join for dragon/Baron to avoid losing objective control.\n\n### Lissandra / Syndra (burst mages)\n- Identity: Designed to get picks and start teamfights. Your losses with these champs echo the same macro issue: pick potential wasted because you either aren't in position or objectives are lost after a single misplay.\n- Mechanical/phase corrections: play safer pre-objective: hold flank vision, go for controlled picks, and do not facecheck bushes alone. If you get a pick, immediately translate it into an objective or tower within the next 30–45 seconds.\n",
  "itemization_tips": "**Build Efficiency**\n\n- Yone: Current core includes Berserker's Greaves, BOTRK, ISB, IE. Strength: lifesteal + crit gives survivability. Weakness: BOTRK is situational—it's excellent vs heavy HP/tank comps but is less efficient vs squishy lineups where a Phantom Dancer/Bloodthirster or more pure crit spike gives better consistent DPS and survivability. Rule of thumb: build BOTRK when enemy has >1 heavy HP/tank who outduels you; otherwise prioritize crit + lifesteal to maximize teamfight carry. Also increase Oracle Lens/control ward use before objective fights (you already buy Oracle sometimes; use it systematically before dragon/Baron).\n\n- Ahri: Malignance + Sorcerer's + Rabadon/Lich Bane pattern is sensible. Leverage early Malignance for consistent scaling into mid-game roams. If you roam often, consider Lich Bane earlier for high-roam burst; if games extend, prioritize Rabadon's.\n\n- Viktor: Your Viktor item list (Sorcerer's, Lich Bane, Rabadon) is logical for zoning and burst. The micro-gap is not items — it's timing: don't delay your core offensive items when you have mid priority; convert early gold into control items that allow you to contest mid/dragon control.\n\n- Riven: Sundered Sky/Death's Dance/Eclipse are fine. The issue is not build efficiency but when you take side vs when you group; item spikes should be used to force objectives with vision, not to chase solo kills that cost objectives.\n\n- Runes mismatches to test: Yone using Lethal Tempo 90% is a coherent aggressive carry style, but if you struggle translating skirmishes into objectives, try running Conqueror in a controlled block of games to test longer-fight sustainability. Syndra using First Strike (62%) is non-standard — run a 10-game test with Electrocute or Spellbook/Arcane Comet to see which increases early snowball success and KP. Use these rune tests only with intentional review of results.\n\n- Vision purchases: your itemization shows Oracle Lens usage on many champs but your average vision score (22.9) and the 'got_picked_before_objective' tag indicate inconsistent use. Policy: for every game where you intend to contest dragon/Baron, buy a control ward on your first back after level 6 if you plan to roam or hold mid.\n",
  "goals": "**Top 5 Strategic Priorities**\n\n1) Increase Kill Participation (KP) — Target: +0.15 KP in next 50 games (from 0.399 to ~0.55). How: every time you shove a min wave, commit to a decision: roam to a lane (time check: move within 8–20s of wave hit tower) OR set a slow-push to deny enemy roams. Practice: in normals, run 20 games where you explicitly log one 'shove->roam' attempt per game.\n\n2) Objective Discipline & Vision Before Fights — Target: reduce 'picked before objective' occurrences by 75% over next 20 games. How: before any dragon/Baron contest, clear nearby vision with Oracle + place a control ward in the most common entrance; do not engage if you cannot see both flank avenues. Drill: before each objective, call your intent in chat and place two vision items (one control ward, one sweep) as a habit.\n\n3) Wave Management Windows — Target: improve mid-to-map pressure conversion. How: learn 3 wave states (push, freeze, slow-push) and a scripted action for each: push = look to roam/jungle assist; freeze = deny enemy roams and protect objective; slow-push = set up side pressure for 20–40s. Practice in a focused solo session: 30 min dedicated to only wave-state decisions, no fighting unless forced.\n\n4) Death & Pick Prevention — Target: halve your 'high deaths' loss incidents. How: before every aggressive play ask: \"What vision do I have? Where can enemy flank come from?\" If you lack this, back off. Mental checklist: sums? enemy jg visible? lanes pushed? If any are 'no', do not overextend.\n\n5) Post-Game Micro-Review Habit — Target: 3-minute focused review per lost game (first 10 losses). How: watch the 3 biggest objective moments (dragon/Baron/tower) and note: (a) was mid present? (b) was vision cleared? (c) did we get picked? Keep a running log and implement one change per week from those notes.\n\nImplementing and tracking these five habits will directly fix the mid-to-map translation problem (the single biggest climb limiter in your data). Start with 1 and 2 simultaneously; they create the fastest measurable lift in wins.\n"
}