{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: \"The Duelist with Tunnel Vision\". You are a mid-lane skirmisher/duelist who farms well and can win isolated fights (Yone/Riven/Viktor scaling games) but you frequently play as a solo threat rather than a coordinated team presence. Your damage and CS numbers are near high-elo baselines, but your kill participation and objective influence are low — you show strong individual metrics inside games but poor participation in team macro windows.\n\n2. **The Root Cause**: You are losing games because your playing identity (win 1v1s / split or look for solo picks) isn't synchronized with the macro demands of your matches. That creates two combined failure modes: (A) you get picked or overextended before objectives because you aren't prioritizing vision and tempo around dragon/baron, and (B) you aren't consistently grouping or rotating when your team needs you, producing low kill participation and lost tower/neutral control. In short — tactical/mechanical ability is fine, but strategic timing, map discipline and vision habits are broken.\n\n3. **The 'One Big Thing'**: Stop being \"the 1v1 win-condition\" in isolation — increase objective-attendance and kill participation by fixing two habits: systematic vision before objective windows (and backing/recalling with the team), and choosing when to join fights vs when to force side-plays. If you reliably show up with vision and on-time for dragon/baron fights instead of getting picked, your winrate will improve the most.",
  "champion_feedback": "**Champion-Specific Adjustments**.\n\nYone (11 games, weakest winrate):\n- Identity shift: Stop treating Yone as purely a side-lane split-pusher. On this account you often end up isolated and picked. Play Yone as an assassin/secondary front-line skirmisher — join mid/dragon fights after your key CDs are available.\n- Lane: Focus last-hitting and short trades; avoid extended oversteps without ward coverage. Use E defensively to avoid jungle ganks.\n- Mid game: Prioritize mid priority/vision and move with your team into skirmishes. You should take side-waves only when the team can force an objective or you have vision and tempo.\n- Late game: Look for flank engages or clean-up plays rather than fighting alone. Don’t split when Baron/Dragon is contested unless you have deep vision and a plan.\n\nAhri (3 games):\n- Identity shift: Pivot Ahri from \"I roam when I want\" to \"I roam when my roam changes an objective window.\" Use roams to secure drake or force tower plates rather than isolated kills.\n- Lane: Push then roam after level 6 only when your mid/side waves are reset. Avoid roaming blind — ping and ensure vision before crossing river.\n- Mid/Late: Look for picks with your charm into objective control; don't overextend into unwarded brushes.\n\nRiven (3 games, best WR):\n- Identity shift: Riven wants side pressure and clean skirmishes; keep doing that but coordinate with your team for Baron windows. When you get fed, force the enemy to respond to side-push so your team can take objectives.\n- Teamfights: Prefer flank entries and avoid extended 1v5 brawls where your team doesn't follow.\n\nViktor (2 games):\n- Identity shift: Viktor must be the zone controller and stall until his item spike. Your strength is wave control and ranged zone damage — avoid taking 1v1 duels early.\n- Lane: Prioritize safe scaling; shove and place control wards to prevent jungle access. Mid-game, use your zone to control Drake pit and force fights on your terms.\n\nSyndra (1 game):\n- Identity shift: Play Syndra as a pick-maker. Your job is poke/CC and one-shotting carries — use this to win neutral objectives by eliminating threats before a contest.\n\nGeneral advice across all picks: be the reliable presence for objective windows. If you pick a skirmisher (Yone/Riven), make a plan every time Baron/Dragon is coming up: will you join as teamfighting front/peeler or will you hold a side wave with vision and a stopwatch? Make that decision before the objective spawns.",
  "itemization_tips": "**Build Efficiency**.\n\n- Principle: Match build/runes to the game role you actually need that match (teamfighter vs side-splitter vs pickmaker). Your losses show you are often the \"best on team\" yet not influencing objectives — so build either to survive (if you must be the front/engage) or to increase burst/impact (if you are the pickmaker), not something in-between.\n\n- Yone: Standard runes = Conqueror (or Lethal Tempo if you prefer shoving), Triumph, Legend (Alacrity or Tenacity), Last Stand. Secondary: Resolve (Bone Plating/Second Wind) when you get dove/CC'd often. Items: prefer crit/attack-speed heavy spike (Infinity Edge + Phantom Dancer/Statikk) or Shieldbow if enemies kill you immediately. If you’re getting picked before objectives, favor shielding/defensive mythic (Shieldbow) rather than pure glass-cannon.\n\n- Ahri/Syndra: Primary Electrocute/Electro burst path — dominance in pick potential. Build early boots + control wards to roam safely; items focused on burst (Lich Bane on Ahri when ahead; Oblivion Orb/Liandry components situationally on Syndra rarely).\n\n- Viktor: Prioritize Hexcore upgrades and a defensive option if enemy dives you (Zhonya's). You win by scaling — do not buy early risky lethality; buy survivability if you are being targeted around objectives.\n\n- Riven: Conqueror + standard Riven rune set. If you are frequently dying in teamfights, pick Sterak's/Black Cleaver pathing that allows you to stick and be useful for Baron/Dragon fights.\n\n- Common static mistakes to avoid: buying too many early damage items when you’re consistently getting picked (trade an offense item for one defensive item); skipping control wards and relying on MS scrolls — vision is the cheaper and higher ROI investment.\n\nNote: Exact item names vary by meta; prioritize the build philosophy above: survival when you must be present, spike when you can force picks safely.",
  "goals": "**Top 5 Strategic Priorities**.\n\n1) Vision and Back Timing Discipline (highest priority): Always bring at least 1 control ward and a slot for trinket swaps into objective windows. If you are the mid laner, place deep vision and clear enemy vision 60–90 seconds before Dragon/Baron spawns. If you cannot safely clear or your team hasn’t rotated, recall instead of facechecking.\n\n2) Kill Participation Targeting: Raise KP from ~0.40 toward 0.60 by committing to one of two roles per game: (A) group for objectives/roams or (B) actively split only when enemy team is forced to respond and your team can take objective. Track KP each session and aim for +0.05 KP per week.\n\n3) Anti-Pick Routine: Before every objective, do a 10–15 second checklist: (a) wards covering flanks, (b) enemy reset timers tracked, (c) key enemy flash/TP available. If any are missing, delay the objective or force vision fight — do not be the bait.\n\n4) Champion-Role Alignment: Play champions that suit your required macro. If you want to be the lane carry and single-handedly win, play heavy side-pressure champs but explicitly commit to side-lane + sending pings for objectives. If your team needs mid priority, pick control mages (Viktor/Syndra/Ahri) and group.\n\n5) CS & Mechanical Baseline Drill: Raise CS/min from 6.87 to 7.5+ with 10-minute wave-management drills (practice last-hitting and freeze/shove scenarios in customs or normals). Better CS reduces desperation plays and gives you the freedom to buy control wards and reach item spikes that help for objective fights.\n\nExecute these five, track KP and vision score per 20 games, and the data will show where the biggest climb comes from: more presence at objectives and fewer pre-objective picks will immediately cut losses where you were otherwise one of the better-performing players."
}