{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: \"The Overzealous Split‑Diver\". You habitually pick dive/split champions (Kled, Irelia, Morde, occasional Shyvana/Master Yi) and try to create side‑lane pressure or skirmish wins, but you end up isolated or out of sync with your team. Your CS is close to a high baseline, your damage share is average, but your KDA, kill participation and objective control lag — a sign you’re playing aggressively without the macro coordination or vision to convert advantages into towers and dragons.\n\n2. **The Root Cause**: A consistent macro + discipline mismatch. The core habit causing losses is committing to side pressure, dives, or objective fights without reliable vision, teammate alignment, or timing. That leads to getting picked before objectives, losing tower pressure (you either overcommit into a wardless flank or fail to shove/pressure when appropriate), and low KP because you either split off or arrive too late. Underlying this is a scattered champion/role approach (top + random jungle/mid games) which prevents stable patterns and reinforces risky, poorly coordinated decision‑making.\n\n3. **The 'One Big Thing'**: Stop forcing isolated pressure without vision and teammates. Consciously make your next decision before you leave lane: \"Is there vision? Is a teammate within 10 seconds to help? Will I secure a plate/Herald/dragon if I push?\" If the answer is no, don't extend. Fixing this single habit will immediately reduce deaths, increase objective control, and raise KP.\n",
  "champion_feedback": "### Kled\nIdentity shift: Treat Kled as an early‑mid tempo engine — your job is to translate lane pressure into towers/Herald and team windows, not solo hero plays. Prioritize lane priority to shove for plates and force recalls, then shove again to create Herald/roam windows. Use your mount engage when your team is committed (or you have TP/vision). If you can’t get a teammate within 10s, play safer and farm for BC/Sterak/Death's Dance rather than hunting flashy solo kills.\n\nLane coaching: Control wave to create a push+reset window into Herald/plate time (avoid freezing when you want plates). Vision: place a deep ward in the river/tri when pushing and a control ward in river brush after 1st back. Midgame: group for 2‑man dives only with jungle/Mid assistance; if split‑pushing, always have TP and a warded escape.\n\n### Irelia\nIdentity shift: Irelia wants coordinated skirmishes; she is punishable when alone without jungle. Play more measured early: miss one all‑in rather than die chasing a kill. Focus on wave management to get priority, then look for coordinated dives with jungle — not solo roams into fog of war.\n\nPhase coaching: Early — trade with minion advantage and secure plates. Mid — use priority to pressure Herald and then join fights; late — look for flank windows but only when carries are CC'd or you have vision.\n\n### Mordekaiser\nIdentity shift: Be the objective isolator. Morde wins by forcing 1v1s and removing a key enemy with R during objectives. If you take Morde to sideline, commit to split pressure with vision and a TP to convert into Baron/Herald control. Don’t be the guy who dies to a 2v1 pick while trying to solo Baron vision control.\n\nItems/runes: lean Riftmaker/Rylai/Demonic for sustain in skirmishes; buy Mercury if enemy has heavy CC so your R timing isn't wasted.\n\n### Shyvana / Similar Juggernaut Picks (if you play jungle)\nIdentity shift: If you opt into jungle Shyvana/Master Yi occasionally, adopt an objective‑first mentality: clear+scout river before dragon, avoid solo contesting without vision or a lane priority advantage. Your losses show dragon gaps — if you jungle, make dragons your number one metric until your team reliably follows your calls.\n\nGeneral note on champion pool: Narrow to 2 top champions (Kled + one of Irelia/Morde). Stop alternating roles in ranked when trying to climb — consistency builds pattern recognition and improves macro timing.",
  "itemization_tips": "**Build Efficiency**.\n\n- Survivability deficit: Your high death count suggests builds or rune choices that overcommit to damage without mitigation. On Kled/Irelia, prioritize one defensive item (Sterak's/Death's Dance/GA) versus heavy AD/AP teams instead of stacking only damage. On Kled, Black Cleaver + Sterak's/Death's Dance is a safer tempo build; on Irelia pick Divine Sunderer/Trinity into sustain + Sterak's if you'll be the main engage.\n\n- Mobility vs CC: Against heavy CC/AP burst, pick Mercury Treads or Maw early. Too often dives fail because you get chained and bursted.\n\n- Vision economy: Buy at least 1 control ward every 10 minutes and upgrade sweeper on appropriate backs. Vision spending is not optional for side‑lane champions; it’s how you keep pressure alive.\n\n- Morde/Shyvana specifics: Morde — Riftmaker rush converts skirmishes into sustained fighting; buy Rylai or a Zhonya/GA situationally to survive focused dives. Shyvana (jung) — prioritize early dragon stats and Cinderhulk/Trinity‑ish tempo to secure objective windows.\n\n- Runes: default to Conqueror for Kled/Irelia for prolonged fights; choose Resolve secondary (bone plating/second wind) vs poke/short burst matchups. Avoid pure electrocute/css burst runes unless you have proven roam follow‑up — you need trades that extend, not single bursts that fail to net plates.\n",
  "goals": "**Top 5 Strategic Priorities**.\n\n1) Vision & Pre‑commit Check (Immediate habit): Before you roam/split/force a fight, ask: \"3 seconds — Is there river/tri brush vision? Is a teammate within 10s?\" If no, don’t go. Measurable: raise avg vision score from 21.7 → 30+ within 20 games; buy 1 control ward every 2 backs.\n\n2) Objective Discipline (Midterm habit): Only contest dragons/Herald/Baron when you have vision or a teammate advantage. Never fight for Baron if the enemy has flank vision or your team is out of position. Measurable: reduce \"got_picked_before_objective\" incidents from 100% timeline rate toward <50% over next 20 games.\n\n3) Champion Pool & Role Consistency (Structural change): Lock to 2 top champions (Kled + one of Irelia/Morde). Stop playing random jungle/mid in ranked for at least a 20‑game block. Measurable: 80% of next 20 ranked games on those two picks.\n\n4) Kill Participation & Grouping (Tactical): Prioritize TP/pings and lane state to be present for fights. Aim to increase KP from 0.411 → 0.55 by reducing solo side plays and joining 1 more teamfight per game. Use pings 1–2s earlier than you think you need to force coordination.\n\n5) Death Minimization Drill (Behavioral): Every death must be reviewed — annotate 3 deaths per replay and categorize: visionless overextend / bad TP / tunnel. Goal: reduce average deaths per game by 25% in the next 10 games by refusing 1v2 engages without vision or teammate backup.\n\nExecute these in order: start with Vision & Pre‑commit, then enforce Objective Discipline. Combine with a narrowed champion pool to automate decision patterns. These changes will fix the largest bottleneck: being picked and failing to convert side pressure into team objectives.",
  "notes_version": "C-enriched-1"
}