{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: \"The Passive Mid with Identity Drift\". You survive more than you die (avg KDA 3.44) but you rarely shape games — damage share (0.211), kill participation (0.465) and CS/min (6.22) are all below the competitive baseline. You oscillate between playstyles (assassin skirmishing, scaling artillery, off-role marksman) which makes your macro decisions inconsistent. The net effect: you often aren't where the objectives are being fought, you get picked before objectives, and your team pays for it.\n\n2. **The Root Cause**: This is primarily a macro discipline + identity problem, not pure mechanics. You default to a low-risk personal playstyle (protecting KDA) but don't convert that safety into map control or objective leverage. Compounding that, an inconsistent champion role mix (mid, bot, jungle, top picks over these 20 games) creates confusion about win conditions—so you don't commit cleanly to objective fights, wave control, or roaming windows. The visible symptoms (lost tower pressure, dragon/baron gaps, low kp, getting picked before objectives) all trace back to: poor vision/positioning discipline around objectives and unclear champion-level goals.\n\n3. **The 'One Big Thing'**: Fix objective responsibility and vision/positioning habits. If you stop getting picked before objectives and either reliably show up to secure/contest dragons & barons or accept the correct lane-side role to pressure towers, your damage share and KP will rise immediately. Everything else — CS, item timings, rune choices — stacks on that single change.",
  "champion_feedback": "### Ekko\n- Identity shift: stop treating Ekko like a solo skirmisher and start treating him as a controlled pick tool. Your role is to create a decisive 1-2 second window to delete a priority and then reset or zone.\n- Laning: prioritize safe wave management until you have level 6 power. Avoid extended skirmishes without vision. Look for flank roams post-6 rather than extended 1v1 fights.\n- Objective phase: use your ultimate and Stopwatch/Zhonya timings to go in only when your team is ready to follow; don’t facecheck objectives.\n\n### Kassadin\n- Identity shift: commit to the scaler identity. Your win condition is perfect CS and selective roams after Riftwalk windows are available.\n- Laning: prioritize hitting 7.5+ CS/min by farming and avoiding fights. Post-6, look to roam only when a side wave is shoved or an objective timer is favorable.\n- Objective phase: be a late-game joiner/cleaner — avoid early Baron facechecks; only contest when you have MR/HP and team coordination.\n\n### Diana\n- Identity shift: be proactive around neutral objectives. Diana is strongest when she forces fights around dragons and mid game skirmishes.\n- Laning: shove and look for roams/quick invades with jungle; do not overfi ght 1v2 without vision.\n- Objective phase: be the engage follow-up — call for vision and time your all-ins after enemy cooldowns are seen.\n\n### Ziggs\n- Identity shift: play Ziggs as an objective-control artillery mage rather than a duel champion.\n- Laning: use extreme range waveclear to secure plates and deny enemy roams; control vision around dragon/baron with safe sieges.\n- Objective phase: your bombs zone enemies off baron and let your team secure objectives — prioritize Liandry/Luden’s timings and Keep the control ward near objective pit.\n\n### Smolder / Kai'Sa (marksman picks when you play bot/mid as ad)\n- Identity shift: if you pick a marksman in mid, accept the scaling/sidelane win condition — farm, position, and avoid early risky clutches.\n- Laning: shove when safe, rotate to side lanes only with vision and when your team can threaten objectives.\n- Objective phase: be the consistent DPS in fights; don’t be the first to flank into a facecheck — position behind engage and use sweepers/wards to avoid being caught.",
  "itemization_tips": "**Build Efficiency**.\n- Vision items are missing leverage: bring at least 1 control ward and Oracle/Lens into every objective fight. Many of your losses are 'picked before objective' — you can’t fix that with damage items.\n- Assassins (Ekko/Diana/Kassadin): prioritize a faster core spike (mythic/first AP item) rather than defensive padding early. If you are getting focused/picked repeatedly, buy Stopwatch/Zhonya as your second item on Ekko/Diana or early QSS/Mercurial on AD-style picks—survivability timed properly increases participation.\n- Ziggs/Control mages: don’t delay boots or key waveclear items. Completing your waveclear item (e.g., protobelt/Liandry/Luden’s equivalents) before major objective windows wins fights by zoning.\n- Marksman off-role: if you play Smolder/Kai'Sa out of position, build earlier defensive boots and a lifeline item (Hexdrinker / Maw / Banshee depending on threat) to reduce being one-shotted before mid/late spikes.\n- Rune sanity check: on assassins, use Electrocute or PTA for reliable burst; on Ziggs/zone mages use Aery/Arcane/Phase Rush alternatives that maximize poke and wavecontrol. Avoid purely defensive rune pages that reduce your damage share.",
  "goals": "**Top 5 Strategic Priorities**.\n1) Vision & Objective Ritual (Immediate, measurable): before every Dragon/Baron — place 2 control wards and clear 1-2 enemy wards with Oracle Lens. Drill: in normals, refuse to approach objective until you have placed/cleared vision during 10 consecutive games. Metric: reduce \"got_picked_before_objective\" occurrences by 70% in the next 20 games.\n\n2) Lock a 3-champion pool and commit for 2 weeks: one control/artillery (Ziggs), one assassin/roamer (Ekko or Diana), one late-game scaler (Kassadin). Drill: play at least 12 of next 20 ranked games on these three only. Metric: expect KPI improvements in KP and damage share within those 20 games.\n\n3) CS baseline training (Mechanical & macro): practice reaching 7.5+ CS/min benchmark. Drill: 10-minute custom farm sessions or Prefarm warmups; in ranked aim for a per-game CS/min target and log results. Metric: move from 6.22 to ≥7.0 within 30 games.\n\n4) Objective presence / KP ritual: If an objective spawns and you are dead or more than 10s away, call for tempo and do not attempt a 50/50 engage. Drill: set a mental rule — \"I only engage on an objective if I have vision AND my frontline is ready\". Metric: raise KP from 0.465 to ≥0.6 by showing up/alive during 70% of dragon fights.\n\n5) Pre-objective positioning & timing (Psych + habit): 30 seconds before every objective, check minimap, ping the closest ward spot, and reposition to a safe screening angle; if you are a flank champ, wait for a mistake rather than forcing angle. Drill: in-game checklist before every objective (1. Vision placed, 2. Cooldowns seen, 3. I have escape/engage ready). Metric: reduce deaths within 20s of objective windows and reduce objective losses tied to picks.\n\nFollow these in order: vision & objective ritual first, champion pool second, and CS/KP refinements third. These target the root cause (objective/vision/identity) that is currently constraining your climb."
}