{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: \"The Duelist Who Forgets Objectives.\" You are a mechanically competent, skirmish-oriented mid player who favors champions that win 1v1s and create side pressure (Yone, Riven, Jax, Akali). Your KDA and CS are near or above high-level baselines, but your damage share and — critically — your kill participation are low. That combination tells a story: you often generate individual value (farm, duels) but fail to convert it into team wins via objective control, presence at dragons/barons, and coordinated towers.\n\n2. **The Root Cause**: You have an identity + timing mismatch. You pick or play like a solo-skirmisher but then don't consistently execute the macro follow-through that wins objectives. Concretely:\n   - You either stay split-focused or overextend for solo kills and get punished (\"got picked before objective\" frequently), or\n   - You win small fights but aren't near objective windows and therefore miss dragons/barons or tower trades. That creates repeated objective gaps (avg_dragon_gap negative, lost Baron/dragon control in many losses). Low kill participation (.40 vs .65 baseline) is the quantitative symptom; the qualitative cause is habitual play patterns: aggressive side engagements, weak pre-objective discipline (vision/timing), and inconsistent roaming/shotcalling.\n\n3. **The 'One Big Thing'**: Increase your objective participation and reduce being picked before objectives. Translate your lane/split advantages into team objective control. Practically: raise your kill participation by ~15–25% (target 0.55–0.60) and stop being the common \"picked before objective\" casualty by instituting a 60s pre-objective safety checklist (vision + position + teammate awareness). Doing that will flip most of your \"lost tower pressure / dragon / baron\" losses into wins.\n",
  "champion_feedback": "**Champion-Specific Adjustments**\n\n### Yone\n- Identity shift: Yone is a skirmisher/side-pressure champ — play him to create spacing and force enemy resources, not to solo-take objectives without vision. Your Yone sample shows the worst KDA and the most losses: likely overextension and poor timing around objectives.\n- Lane: freeze or slow-push to a safe spot if dragon is spawning; avoid hard shoves into enemy jungle without vision. If you get priority and dragon is up, shove once and either roam or base — don’t sit alone in river.\n- Mid game: prioritize being within 3000 units of objective spawns. If you cannot, force a side-wave that demands attention and then group. On fights, avoid being first — let enemy CC be used or wait for front line to engage.\n- Item/runes note: Conqueror + AD/crit build is fine. If you are getting repeatedly picked, slot an early defensive item (Death's Dance or GA) earlier than usual. Buy Control Wards pre-drake when you have lane priority.\n\n### Ahri\n- Identity shift: Ahri is your best-balanced pick — she wins mid lane and can convert priority into roams. Lean into that: Ahri should be your objective-converter.\n- Lane: push two waves quickly and look to put pressure on side lanes between 2:00 windows. Use R to secure roams safely; if you shove, immediately place a control ward and look for a skirmish around river.\n- Mid/Late: in teamfights, play pickmaker — you should be creating the picks that secure barons/dragons. If your team is contesting an objective, be within casting range but not in front of the engage.\n- Item/runes note: Electrocute/Electro burst or Phase Rush (if you want more roam safety). Build CDR/mobility/one defensive item if enemies have heavy pick (Banshee's or Zhonya). Prioritize Ionian or Sorc boots depending on magic resist and roam need.\n\n### Riven\n- Identity shift: Riven performs well for you in the top/solo role where she can split. As a mid pick she can be volatile — only play Riven mid when you intend to dominate side pressure and take over a top-style game.\n- Game plan: focus on reaching your 2-item spike and then force side pressure. If you choose to split, ping objective windows and either join quickly or ensure a teammate can contest.\n- Item/runes note: build for survivability in games where you get picked often (early Sterak/Death's Dance). If you keep getting collapsed, prefer Mercury's/GA.\n\n### Viktor\n- Identity shift: Viktor is a scaling zone-control mage — he wants to farm to his mid-game spike and be the zoning engine around dragons/baron. Your Viktor games trend to wins when you let him scale.\n- Lane: play safe early, prioritize level and item spikes over risky roams. When you have tier/plating, control vision and force fights on your terms.\n- Mid/Late: be the backline damage and zone. Don’t be the flank that dies early.\n\n### Lissandra\n- Identity shift: Lissandra should be used as a teamfight initiator/pick tool. Your Lissandra losses look like poor timing and being out of position.\n- Game plan: play to either peel as an engaged front-line or look for coordinated roams with jungler — do not solo-flank into unwarded river. Use W/E to ensure you can self-peel if you go in.\n- Item/runes note: Aftershock or Electrocute depending on your role in the comp; buy Zhonya earlier when you're being focused.\n\n(Also: Syndra and Viktor show strong small-sample winrates — keep them as your control-burst options when you want safer, objective-focused midplay.)",
  "itemization_tips": "**Build Efficiency**\n\n- Vision economy: buy at least 1 Control Ward every back when you have mid priority before objective windows (dragon/baron). Upgrade to Oracle Lens actively when you are the primary roamer and swap to a Control Ward to hold a pit.\n\n- Defensive timing on skirmish champs: You frequently play champs that take fights (Yone, Riven, Akali). If you die early consistently, stop committing to pure glass-cannon builds. Target a defensive timing: get Death's Dance or Sterak's/GA earlier (item 2–3) when your death rate is high. This preserves pressure and keeps you present for objectives.\n\n- Rune alignment with role:\n  - Assassins/roamers (Ahri, LeBlanc): Electrocute/Electrocute-style burst to convert roams into kills. Take boots/CDR runes or Transcendence if mobility is tight.\n  - Skirmishers (Yone/Riven): Conqueror for extended trades; consider Legend: Tenacity or Coup de Grace depending on matchups. Take Second Wind or Overgrowth vs poke lanes.\n  - Control/battlemages (Viktor, Syndra): Dark Harvest is risky — prefer Arcane Comet or Phase Rush (if roams) and prioritize mana/ability flow items.\n\n- Tailor boots: if you are dying to CC and picks, get Mercury's; if facing auto-dps and AD carries, Plated Steelcaps are fine; if you need to roam more aggressively, Ionian (CDR) or boots that reduce summoner cooldowns help you impact more objectives.\n\n- Avoid stale builds: don’t build full split-push/offensive only items when your team lacks frontline and you are the primary engage target. One defensive or utility item often outweighs another offensive item when your presence secures objectives.\n",
  "goals": "**Top 5 Strategic Priorities**\n\n1) Objective Pre-Check Routine (Immediate, repeatable)\n   - Before any dragon/baron spawn (60–30s): do not be alone in lane. Either shove 1 wave and be in river with a Control Ward OR shove and back with TP/flash ready. If you are more than 3000 units from the pit and have no vision, do not overextend.\n   - Metric: reduce \"got_picked_before_objective\" tag rate by 50% in the next 20 games.\n\n2) Raise Kill Participation (Team Presence)\n   - Intention: increase KP from ~0.40 to >=0.55. How: after you shove mid, look to join skirmishes or align with jungler timer windows (track enemy jungler's likely position) instead of solo-splitting.\n   - Practice: mark two obvious roam windows per game (post-plating, post-recall, post-level-spike) and act on them.\n\n3) Wave Management Discipline\n   - Learn two standard states: \"Shove and Roam\" and \"Freeze/Delay for Objective.\" If dragon is contested soon, prefer Freeze/Delay unless you have vision and teammate backup.\n   - Metric: increase average waves shoved-to-roam conversions and reduce solo deaths from overpushes by 40%.\n\n4) Vision & Positioning Checklist (Micro-habit)\n   - Every back, buy 1 Control Ward and place it on the objective side (river entrance or tri-bush) inside 20s of respawn timers. Use Oracle Lens 15s before contest windows.\n   - Metric: vision score should trend up and \"lost Baron/dragon control\" tags should drop.\n\n5) Item/Rune Adaptation Habit\n   - Before game, set a 30-second plan: which champion would you pick and which two item/rune paths are acceptable depending on enemy draft (heavy CC -> early QSS/GA, poke -> early MR/HP, team needs damage -> full AP/crit). Don't auto-build the same full glass-cannon path every game.\n   - Metric: if you die early in a game from similar causes twice in a row vs same comp, switch to safety-first item in the next game.\n\nFollow these five, and the biggest friction points (low KP, objective gaps, getting picked before fights) will shrink quickly — your mechanics already exist; the climb is mainly macro discipline and presence."
}