{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: The Skirmish Diver — a high‑KDA, carry‑oriented jungler who wins personal fights and creates kill pressure but repeatedly fails to convert those skirmishes into stable map control or objective advantage. Your numbers show a strong personal statline (avg KDA 5.09), near‑master CS and damage baselines, but low kill participation (0.507) and painful objective/pressure deficits in losses (tower/dragon/baron gaps, many \"picked before objective\" tags).\n\n2. **The Root Cause**: Identity → Discipline mismatch. You are playing Diana as an isolation skirmisher/assassin (duel-first mindset) but you are not consistently sequencing kills into objective setups. The concrete habits behind that: you take or force fights without securing vision and rotations, you often commit to side skirmishes that don’t create pressure to take towers/dragons, and you enter objective windows too late or get caught before a setup. In short: you win small fights but lose the objective war because you (and often your team) aren’t aligning on when to reset, ward, and commit.\n\n3. **The 'One Big Thing'**: Objective Discipline — before you fight, secure vision or a reliable pick. Turn every engagement into a measurable objective (plate, tower, dragon, or Baron). If a skirmish doesn’t create objective control within 30–60 seconds, don’t take it again. Train the habit: skirmish → rapid map check → objective action (ward/rotate/reset).",
  "champion_feedback": "**Champion-Specific Adjustments**.\n\nDiana (primary, 17 games)\n- Stop playing Diana as a roam-only assassin who looks for solo kills. Your strength is forcing decisive midgame skirmishes and diving backlines when your team can convert. Shift from \"I must kill the carry\" to \"I must create a window where my team secures dragon/tower.\" After a successful gank, immediately look to: push/clear wave, place vision, and force dragon or tower within the next minute.\n- Early pathing: prioritize Scuttle → aggressive gank windows at 3:30–6:00 if lanes are pushed. If lanes are not in a gankable state, take enemy jungle camps and place deep vision rather than looking for solo roam.\n- Mid/Late: play flank/zone with R instead of solo diving in front of your team. If your team cannot follow, use your kill to split and take an outer tower only if vision/backline control is present.\n\nRammus (1 game — excellent raw impact)\n- Keep him as a tactical pick vs AD-heavy comps or when you need reliable objective control and engage. Use Rammus when you want to force tower pressure and objective fights — he converts leads into map pressure more reliably than Diana.\n\nLulu (utility game)\n- When forced into utility, prioritize vision control, peel usage, and objective setup. Your low damage and CS are fine for utility — what’s missing is proactive warding pre-dragon and remaining alive during setups.\n\nKai'Sa (off-role)\n- Avoid off-role hypercarry games unless you can commit to a full farm plan. Kai'Sa requires very different habits (protect her, hit 2 core items). Your Kai'Sa game showed you attempted carry without requisite CS/tempo; only pick if you accept the farming identity.\n\nChampion pool advice\n- Keep Diana as your main but add 1–2 objective-oriented junglers to your pool (e.g., Rammus, Amumu, Lillia or Sejuani) for games where your team lacks frontline or your side lanes need proactive pressure. This reduces lost-tower and drag gaps when coordination is shaky.",
  "itemization_tips": "**Build Efficiency**.\n\n- Diana: prioritize items that let you convert skirmishes into objectives and survive the follow-up (Riftmaker/Rabadon + Zhonya/Banshee depending on the game). If you repeatedly get picked before objectives, favor defensive timing items (Zhonya/Banshee) earlier rather than full glass cannon.\n- Vision & Utility Items: as the primary initiator, buy at least one Control Ward per clear of a major objective window (dragon/baron). Slot a control ward before committing — this is more valuable than a rush offensive component when the team is losing towers.\n- Rammus: standard tank/tank‑engage items (Thornmail/Dead Man’s/Force of Nature depending on enemy comp). Build to sustain objective fights and soak turret aggro—your Rammus win showed the power of single‑role clarity.\n- General rune mistakes to avoid: don’t run scaling, late-game-only keystones when you want to force mid‑game control. For Diana, prefer a keystone that helps you win small, frequent fights (electrocute/phase rush/conqueror depending on your playstyle), not an exclusively late-game rune that encourages split farming.\n- Efficiency tip: after a kill, the highest ROI action is vision + objective attempt. If your next buy prevents a ward, rethink it—control wards win games.",
  "goals": "**Top 5 Strategic Priorities**.\n\n1) Vision-First Objective Checklist (daily habit)\n   - Before dragons/baron: place 2+ control wards and have at least one teammate in a position to follow a fight. If you can’t secure vision, don’t force the objective; instead, pressure waves and deny enemy vision.\n\n2) Convert Kills into Objectives (metric to track)\n   - After every successful gank/kill you participate in, force a 60‑second follow-up action: shove wave, place ward, take plate/dragon, or deny enemy jungle. Track conversion rate (kills→objective) and aim to raise it above 50%.\n\n3) Increase Kill Participation via Tempo Resets\n   - After a kill, don’t solo-farm. Reset (recall or move) so you can be with the team for the next objective. Your target is +0.1 KP per game within 2 weeks.\n\n4) Pathing & Timing Discipline\n   - Practice two reliable early jungle routes that prioritize scuttle and lane state. If a lane isn’t gankable, take enemy camps and deep vision rather than blind-roaming. Use a pre-objective timer routine: 90s before dragon start, ping and clear vision; 30s before, get in position.\n\n5) Expand Pool to an Objective-Focused Jungler\n   - Commit to playing 6–8 games on a tank/engage jungle (Rammus/Amumu/Sejuani) to learn to convert skirmishes into towers and dragons. This will teach you macro sequencing and reduce games lost to \"lost tower pressure\".\n\nNo fluff — these five habits, practiced consciously over your next 20 games, will shift your identity from \"I kill things\" to \"I kill things and make the map pay for it.\""
}