{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: \"The Duelist Who Misses the Dance\". You are a mid-lane skirmisher/solo-carry player (Yone-heavy with Riven/Riven-like instincts and some assassins/mages mixed in). Your numbers show a high individual mechanical ceiling (above-baseline KDA, close-to-baseline CS and damage share) but low team integration: low kill participation (0.398 vs 0.65 baseline), frequent picks before objectives, and repeated objective control losses. In short — you win or lose by your 1v1 / side pressure decisions, but you often aren’t present, healthy, or coordinated when the team needs to take dragons/Baron/towers.\n\n2. **The Root Cause**: Identity + Macro Discipline mismatch. You habitually play champions and make plays that favor isolated skirmishes and side pressure, but you are not consistently adapting those choices to objective windows and vision realities. That creates three cascading failures: (a) you either aren’t grouping for objectives (low KP / lost tower and dragon/baron control), (b) you overextend or get caught before objectives (got_picked_before_objective ~88%), and (c) you fail to convert advantages into map/objective control (lost tower pressure, objective_gap). Many losses are not because of raw mechanical failure — you are often one of the better performers — but because your decisions around when to fight, when to group, and how to use vision are costing the team games.\n\n3. **The 'One Big Thing'**: Stop getting picked before objectives — become an \"Objective-First Midlaner.\" That single habit (be present, alive, and positioned correctly at objective windows) will convert your solid mechanical play into consistent wins. If you fix vision/positioning and your timing around drakes/Baron/towers, your already-okay personal metrics will start winning games instead of leaving you carrying losing fights alone.\n",
  "champion_feedback": "**Champion-Specific Adjustments**.\n\nYone (30 games) — Stop treating every wave as a 1v1 invitation. Yone's identity is: farm to a 2‑item spike, then look for clean engages from side or flank. Tactical shifts: (lane) prioritize safe CS vs poke — shove only when you can recall; (mid game) avoid solo-splitting toward objectives when the enemy has vision — instead, push one wave and join the team to contest/secure drake or tower; (late) enter fights only after enemy CC is committed or when you have flank access. KPI focus: raise KP by 15–25% in the next 10 games by joining objective fights even if it costs a small CS wave.\n\nAhri (10 games, low winrate but high KDA) — You produce kills but lose objective control. Play Ahri as a roam-and-pick champion: use R to reset fights and secure picks PRIOR to objective windows, not after. (lane) prioritize shoving then roaming only when your wave is neutralized, not while it’s shoving into you; (mid game) take a control-vision + sweep combo before roaming for picks around drake; (late) look to force picks to open Baron rather than trying to solo-swing fights.\n\nRiven (5 games) — Your play translates well in skirmishes but Riven games show the same macro leak: you win isolated fights but the team loses objectives. With Riven, explicitly play for side-wave priority then teleport/pressure to drag/Baron windows. Concede a few solo kills to keep teleport/summoner parity ahead of big objectives.\n\nSyndra/Viktor/Lissandra (burst/battlemage picks) — You have the tools to control fights from midfield. For these champs, adopt a conservative lane stance with explicit objective-timing checks: if drake is spawning in <90s, clear your wave and path to vision control instead of chasing solo kills. Use your kill threat to secure enemy moves into objectives; don't overextend to farm an extra wave.\n\nGeneral mid-lane identity shift: move from \"I will create pressure by roaming/splitting whenever\" to \"I will create pressure in ways that secure objectives.\" That means two actionable rules: (1) never start a roam/side push without checking enemy vision / enemy summoners and (2) if an objective is contested within 60–90s, prioritize joining your team over an extra wave of CS unless you can shove and recall safely.",
  "itemization_tips": "**Build Efficiency**.\n\n- Core principle: optimize for the objective window. Early deaths before drake/Baron often come from being squishy or lacking defensive options. When you plan to join objectives, prioritize a small defensive purchase (Stopwatch/Zhonya's or Quicksilver Sash) if enemy CC or pick potential is high.\n\n- Yone: target the 2‑item spike before over-committing to side-splits. Typical priority: Mythic lifesteal/AD item → Infinity Edge or equivalent crit item → defensive/sustain situationally. If you’re getting repeatedly caught, buy early Stopwatch/GA or adjust to more lifesteal/defense rather than pure damage.\n\n- Ahri / Syndra / Lissandra / Viktor: prioritize magic-pen/ability-power spike items that let you one-shot priority targets, but build utility when you’re the obvious engage target: Zhonya’s > extra AP when getting focused before objectives. If games show you being the pick target frequently, shift 1 item toward survivability.\n\n- Runes: align keystone to champion identity but not to overextend. Yone = Conqueror (or Press The Attack) for extended skirmishes; Ahri/Syndra = Electrocute or Dark Harvest for pick priority; Lissandra = Aftershock/Glacial Augment if you want more teamfight control. Secondary tree choices should prioritize sustain (Second Wind/Revitalize) or movement (Nimbus Cloak) for objective rotations.\n\n- Vision-buy order: always enter objective windows with at least 1 Control Ward on you and Oracle/Skirmisher available in the pocket of the team (or the jungler). If you routinely get picked, buy control ward at 900g mark instead of a full damage component.\n\n- Avoid static/fixed builds when behind: if you’re behind early, prefer defensive spike early (Zhonya/Seeker's) to avoid feeding pre-objective picks — survival converts to KP and objective influence faster than chasing damage spikes that get removed by CC.",
  "goals": "**Top 5 Strategic Priorities**.\n\n1) Objective Discipline Checklist (highest priority) — Before every dragon/Baron/tower contest, complete this 3-step checklist: (A) your wave state is safe (shove/freeze as appropriate), (B) vision cleared/placed (one control ward + sweep), (C) you have SUMMONERS/ULTS available OR a plan to flank. If you cannot meet the checklist, do not be the first to overextend toward that objective.\n\n2) Increase Kill Participation (KP) by 20% in 2 weeks — Concretely: when the map pings 2+ teammates heading to objective or river, immediately move to join; practice timing one macro replay per day to find 3 windows you should have joined but didn’t. Objective attendance > lane CS in those windows.\n\n3) Reduce \"picked before objective\" events by half — Habit: buy and place a control ward before rotating for drakes/baron; ping your jungler/TP if you see enemy control vision; always check enemy champion locations (minimap check every 5–8s when rotating).\n\n4) Wave & CS discipline to hit baseline (7.5 CS/min) — Simple drills: in normals or practice tool, practice fast shove+roam and freeze+deny for 10 reps each. If you miss baseline by >0.3 CS/min in a set of 5 games, freeze more and recall less for single minions.\n\n5) One-build-for-each-match mindset — Limit champion pool to 2 mid archetypes each queue block (e.g., Yone + an AP pick like Ahri/Syndra). For each champ, have 2 item pathways: (A) normal spike build and (B) survival/itemized build for high-pick games. Before champ select, decide which pathway depending on enemy CC and vision tendencies.\n\nNo fluff — these five habits, practiced deliberately (set small daily goals: 1 replay, 5 games using checklist), will convert your strong mechanics into reliable climbing results."
}