{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: The 'Low-KP Skirmisher'. You show the numbers of a carry/skirmisher player who farms well and can produce strong individual performances (above-baseline KDA, near-Diamond CS/Damage), but you repeatedly miss the team's objective fights and picks. You play high-impact champs (Yone, Ahri, Syndra, Viktor) yet your kill participation (0.401 vs baseline 0.65) and vision are low, so your team repeatedly loses dragons/barons and towers while you are either isolated, out of position, or not present for objective windows.\n\n2. **The Root Cause**: A consistent habit-level mismatch between champion identity and macro roles. You tend to treat mid as a solo-duel lane (farm, look for skirmishes) without reliably converting lane control into presence at neutral objectives. That creates two linked failures: (A) you're not on the map for dragons/barons (low KP → objective gaps), and (B) when you do try to force impact you often get picked or die because vision and timing are poor (see 'got_picked_before_objective' and 'high deaths' flags). In short: you can win fights, but you don't show up for the fights that win games — and when you do, you often gamble without team vision or cooldown alignment.\n\n3. **The 'One Big Thing'**: Increase reliable kill-participation around objectives by converting lane advantage into objective presence and vision control. Practically: be at +one objective fight per game (dragon or Rift Herald/Baron) instead of letting the team fight without you. That single focus will close your biggest leak (objective deficits) and raise both damage share and winrate faster than squeezing CS or micro improvements alone.",
  "champion_feedback": "### Yone\nIdentity shift: Play Yone as a scaling side-lane skirmisher and teamfight follow-up, not as an independent roamer. Your losses show repeated early/ mid-game deaths and low KP — stop solo-chasing and instead freeze/slowpush into a recall that gets you to objectives.\nRunes & items (concise): Conqueror primary; Triumph/Legend/Last Stand; Second Wind or Bone Plating if you face heavy poke. Core build: crit + lifesteal + one defensive lifeline (Sterak's or Death's Dance when you need survivability). Buy Control Ward every back when you have priority.\nPhase coaching:\n- Lane: farm to 2-item spike; avoid risky 1v1s unless you have jungler presence.\n- Mid-game: shove and force side pressure; TP or path into fights only after your team has vision/CC used.\n- Late: dive only after frontline CC is committed; look for flank angles, not head-first engages.\n\n### Ahri\nIdentity shift: Double down on pick-and-roam identity. Your Ahri games show stronger KP and KDA — make that consistency intentional.\nRunes & items: Electrocute or Dark Harvest for roam/burst setups; Sorcery second (Manaflow/Aery or Nimbus depending on playstyle). Build: mobility (boots) + burst AP (Lich/Hex) and a defensive Zhonya if you are the target.\nPhase coaching:\n- Lane: use Q poke and E threat to enable early roams (post-6 roam windows every wave reset).\n- Mid: ping roams and show on side lane before dragon windows.\n- Late: prioritize single-target assassinations but also peel for carries when necessary.\n\n### Syndra / LeBlanc / Akali (burst mages/assassins)\nIdentity shift: These champs win by creating picks before objectives — but your dataset shows you miss those windows. Play them as objective-enabled pick tools rather than solo highlight reels.\nRunes & items: Electrocute / Sudden Impact / Cheap Shot for burst. Prioritize mobility (boots + one gap closer) and an early control ward to secure river brush for picks.\nPhase coaching:\n- Lane: shove and reset to be present for dragon spawn; look for 6-powerplay roams.\n- Mid-game: be the pick threat around side brushes; do not solo-invade into fog of war.\n- Late: stay on map edge, clear vision, and pressure a single target — then collapse with team.\n\n### Viktor / Lissandra (control & utility mages)\nIdentity shift: Play Viktor/Lissandra as objective controllers: waveclear → zone → protect. Your low KP and objective gaps hit these champs hard because they scale into the teamfight role.\nRunes & items: For Viktor, Aery/Arcane Comet and early hexcore/scale items; for Lissandra, Electrocute or Aftershock with Zhonya as defensive. Buy Situational MR/HP when you are getting one-shot.\nPhase coaching:\n- Lane: prioritize wave control and roams when enemy is missing.\n- Mid: hold choke points and force fights where your zone denies enemy entry to objectives.\n- Late: Lissandra should use R to secure picks around dragon; Viktor must be present at Baron/Dragon to zone and DPM for objective fights.\n\n### Small pool notes (Riven/Jax/Darius played off-role)\nWhen you play top champs off-role your objective contribution drops even more. If you plan to continue off-role: accept a different win condition (split-push and force 1-3-1) and communicate that to teammates before 10 min.\n\n(Each champion section focuses on shifting identity: be present for objectives, buy vision, and match champion role to team-objective windows.)",
  "itemization_tips": "**Build Efficiency**. Common mistakes observed and fixes:\n1) Vision economy: you underbuy control wards and don't upgrade/clear often. Rule: every back with >100 gold, buy a Control Ward until you have 1–2 on the map; use Oracle/Red when you are the roamer initiating objectives.\n2) Defensive timing on duelists: you die too often on Yone/Akali because you enter fights before cooldowns/vision are set. Add one defensive/spike item (Sterak's/Death's Dance/Zhonya) as a third item when you are being focused — it saves your teamfights and KP.\n3) Rune mismatches: some of your assassin/roam champions perform like teamfighters (low KP). If you play Ahri/Syndra/LeBlanc, prefer Electrocute/Dark Harvest to maximize kill potential and roam threat. If you play Viktor/Lissandra, prefer sustained Aery/Comet or Aftershock to maximize zone control.\n4) Boots & mobility: on roam-focused mids (Ahri/LeBlanc), pick Mobility/Ionian boots more often when lane matchups allow — being on the map faster directly raises KP and objective presence.\n5) Item timing: avoid greedy late spikes while dragon windows are open. If an objective is likely in 30–90s, favor a control ward + boots sell or component completions over saving up for a luxury item that won't be ready in time.\n\nShort checklist each back: Control Ward? — Boots? — Component toward core spike? — Ping dragon timer if missing enemy jungler? If any answer is no, adjust the next recall to fix it.",
  "goals": "**Top 5 Strategic Priorities**. Ranked, specific, repeatable habits:\n1) Show up for objectives: be at 70% of dragons/barons in the next 20 games. Concrete: if enemy jungler is spotted on other side of map or enemy mid has no TP, shove once and path to the objective within 10s of wave crash.\n2) Raise kill participation by +0.10 in 2 weeks: after every wave clear, ask \"Can I walk to dragon in 10s?\" If yes — do it. If no — slowpush and recall to join.\n3) Vision baseline: buy a Control Ward every back until your average vision score is >=35. Use Oracle/Control clears before objective fights and ping cleared vision.\n4) One-item defensive rule: when focused more than twice in a game (you die/forced flash twice), prioritize a defensive item as your next buy to ensure you can stay alive through one objective fight.\n5) Clear role clarity before 6: during champ select or in first 2 minutes, declare your game plan (\"I will roam mid->side and be on dragons after 6\" / \"I will split and force 1-3-1\"). Commit to that plan and adapt only with clear information (enemy missing, death timers, or jg calls).\n\nNo fluff — these five habits, executed consistently, directly fix the objective and kill-participation leak that is your primary climb bottleneck."
}