{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: \"The Isolated Duelist\". You are a skirmisher-first mid who prefers champions that win through side pressure and individual outplays (Yone, Riven, occasional assassins/burst mages). Your raw numbers (KDA above baseline, near-baseline damage & CS) show you can mechanically win fights and farm, but your low kill-participation (0.401 vs 0.65 baseline) and repeated objective gaps mean you often fight in the wrong place or at the wrong time. You produce fights, but not the ones that secure dragons/towers/Baron.\n\n2. **The Root Cause**: A persistent identity/decision mismatch. You pick or play champions built to create picks and skirmishes, but you then fail to convert that into objective control or team involvement. The data's repeated themes — \"got picked before objective\", \"objective_gap\", and low KP — point to two linked habits: poor objective-timing discipline (showing up late or dead) and unsafe lane behavior without vision/awareness. In short: you either overextend for solo advantage and miss the objective window, or you farm/split without coordinating with your team, leaving objectives uncontested.\n\n3. **The 'One Big Thing'**: Be alive and present for objective windows. If you can consistently avoid being caught before dragon/Baron and instead transfer your skirmishing strength into timely picks or pressure that secures objectives, most of the downstream problems (lost towers, dragon/baron gaps, low damage-share in losses) resolve. Practically: increase your kill participation by being the player who creates or follows through on objective fights rather than the one who seeks isolated fights with no consequence.\n",
  "champion_feedback": "### Skirmishers: Yone / Riven / Jax\nIdentity shift: Stop treating mid as a solo-1v1 lane with optional team duties. When you play these champs, your goal should be either (A) create a guaranteed pick that turns into an immediate neutral objective (dragon/tower/Herald) or (B) take and hold a side-wave to force enemy resource commitment while your team takes an objective. Neither = avoid.\nLane phase: Freeze or slow-push only when jungler/objective windows are not up. When you push, immediately ping and look to roam/transfer pressure. Track enemy jungle and enemy mid’s summoners before extending.\nMid-game: If you’re split-pushing, communicate TP status and have vision to avoid being collapsed on. If grouping, play as the front line skirmisher but wait for CC chain — don’t be the first to enter without peel.\nLate-game: Your 1v1 power should translate to flank pressure or zoning in fights. Don’t chase a kill away from Baron/dragon windows.\n\n### Burst / Roam Mages: Ahri / Syndra / Leblanc / Lissandra\nIdentity shift: These champions’ natural strength is increasing KP through roams/picks — that is exactly what your overall profile is missing. Convert lane leads into cross-map pressure.\nLane phase: On Ahri/Leblanc take clear-roam windows (crash wave then roam) — target enemy bot/top when objective timers are approaching. Keep wave management to create consistent roam windows (push wave to tower, recall, show for objective).\nMid-game: Prioritize being alive and on vision duty during dragon and Herlad windows. Buy Stopwatch/Zhonya if you’re being targeted often.\nLate-game: Play for picks around side-brush or river; force enemies to face check with you. On Lissandra/Viktor, play as zone-control help for your frontline rather than solo-splitting.\n\n### Control / Scaling Battlemage: Viktor\nIdentity shift: Viktor is a zone and scaling control tool — use him to lock space for objectives rather than chase small skirmishes. Your Viktor games had high winrate when you played measured (0.67) — replicate that macro patience.\n\n### Assassins: Akali / Zed / Kassadin\nIdentity shift: Pure picks only. These champs lose value if they die early or fail to join objective fights. If enemy team has strong objective control, don’t pick these unless you can snowball early and translate to towers and dragons.\n\nGeneral phase coaching summary (for all picks):\n- Lane: Track enemy jungler, wave state, and your jungler’s position before overextending. If your team is prepping dragon in ~40s, crash the wave and be in position (alive) 10–15s before spawn.\n- Mid game: Use vision to choose either to group or to force a lane-swap/split with clear communication. If you must split, clear a rotation path and leave vision for your team at objective approaches.\n- Late game: If you are the primary skirmisher, your role is to either force a numbers advantage (pick) or to flank and clean up — never be the bait that dies before the fight starts.\n",
  "itemization_tips": "**Build Efficiency**. Pointed static errors and fixes:\n\n1) Survival slot vs pick comps: Many losses marked \"got picked before objectives\" and \"high deaths\" — you likely under-value a one-time defensive purchase (Stopwatch/Zhonya on mages; early lifesteal/Immortal-style lifeline on Yone). Add a defensive midfield item earlier when enemy has reliable pick tools (assassins, heavy engage).\n2) Vision economy: Control wards and Oracle timing look neglected. Make 1 control ward and a Sweeper/Oracle mandatory before every major objective (dragon/Baron). If you die pre-objective, you did not buy/clear enough vision.\n3) Rune mismatches: If you play skirmishers but repeatedly die to picks, switch one offensive rune choice for sustain/defensive (Yone: Conqueror + Triumph is fine but consider Second Wind/Overgrowth vs heavy poke; Ahri/Syndra: Electrocute for early kill pressure if you aim to roam — otherwise Aery/Scorch for safer laning and wave control).\n4) Item sequencing: For Ahri/Syndra/Leblanc, prioritize a 3rd-item Zhonya or Banshee when enemy engages/picks are killing you before objectives. For Yone/Riven, if you're dying before fights, take a lifeline item (early Death's Dance / Sterak's or a lifesteal component) instead of all-in offensive items.\n5) Objective-focused inventory: Reserve Redemption/Control ward / Stopwatch timings in your head for 2-minute windows around dragons/Baron. If you can’t buy both a ward and a defensive item, favor vision on objective games — your team loses the objective if you die first.\n",
  "goals": "**Top 5 Strategic Priorities**. Ranked, measurable, no fluff.\n\n1) Objective Presence Checklist (must hit before every dragon/Baron): alive + control ward placed in approach + sweep/Oracle used + ult/flash status checked. Failure to meet checklist = do not contest. Target: reduce \"got_picked_before_objective\" rate by 70% in next 20 games.\n2) Increase Kill Participation to 0.55 in 20 games: practice 2-roam-per-4-wave rule on Ahri/Leblanc (crash wave then look to gank/roam) and ping/join jungler 60–30s before objective spawns to turn roams into team kills.\n3) Vision & Ward Routine: minimum 2 control wards per game as mid and average Vision Score to 28+. Place a control ward in river or enemy jungle approach at 12:00 and before each objective window.\n4) Defensive Item Discipline: if enemy has 2+ reliable pick tools OR you're dying 1+ times before objectives in >30% of losses, buy a defensive mid-game item (Stopwatch/Zhonyas or lifeline on skirmishers) by first back after 12 minutes. Track this in post-game for 10 games.\n5) Review Habit & Micro-adjust: every session, review 3 losses and flag the single moment you were out of position pre-objective. Add that timestamp to a short checklist and practice that scenario in normal/ARAM/Norms. Goal: reduce \"lost Baron/dragon control\" flags in post-game logs by 50% in one month.\n"
}