{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: \"The Duelist with a Map Blindspot\". You are a mid‑lane skirmisher/assassin type (Yone/Riven/Akali tendencies) who can win isolated fights and keep an above‑baseline KDA, but you frequently play like a solo duelist instead of a team pivot. Your damage share and CS are near high‑elo baselines, KDA is healthy, but your kill participation, vision, and objective influence are consistently low — so your personal wins don't convert into team wins.\n\n2. **The Root Cause**: You treat lane and fights as isolated mechanical contests rather than as coordinated objective windows. That shows up three ways: (A) low kill participation — you either stay top-of-wave, take risky 1v1s that don’t lead to objectives, or you arrive late to fights; (B) poor vision and timing — multiple 'picked before objective' flags show you and your team are getting collapsed because vision and approach are sloppy; (C) identity mismatch — you play champions that demand either side‑pressure or coordinated map movement, but you don’t consistently shift your role to create/secure dragons/barons/towers. The symptom is losing towers/dragons/barons; the cause is decision discipline and map‑aware role execution.\n\n3. **The 'One Big Thing'**: Stop treating fights as the primary goal — make objectives the endpoint of your fights. Concretely: increase your kill participation around objective windows by improving pre‑objective vision clearing, timing your roams/recalls, and choosing team‑safe engagements so your presence (alive and contributing) arrives before the objective starts. If your presence at the objective is consistent, nearly every other macro issue (tower/dragon/baron gaps, low damage share) starts to resolve.\n\n",
  "champion_feedback": "**Champion-Specific Adjustments**. Use these identity shifts and phase coaching for your most-played picks. Each section focuses on how to convert individual power into objective impact.\n\n### Yone\nIdentity shift: from \"solo brawler\" to \"fast tempo skirmisher who converts side pressure into objectives.\" Lane: play safer early — don't take 1v1 all‑ins unless it leads to an immediate objective or turret plate. Wave: learn a 20–35s window to shove and roam/TP for dragon or mid jungle resets. Mid game: your power spikes matter only if you show up alive to fights — prioritize flank angles that let you join post‑CC, not first‑in suicide dives. Late game: split when your team can threaten an objective or when the enemy must respond; otherwise group for baron fights.\n\n### Ahri\nIdentity shift: from roaming pick machine to reliable team fight opener and objective control facilitator. Lane: keep push+roam windows timed to dragon spawn (shove two waves then roam). Mid game: use charm more as a tool to secure picks before objectives; if you get one person and the enemy backs, convert that to dragon/tower. Late game: buy one safety item (Zhonya/Stopwatch) when opponent has single‑target burst/picks so you're not the \"picked before objective\" casualty.\n\n### Riven (and other top/skirmishers you play mid occasionally)\nIdentity shift: respect the map role — when in mid or top, your split threat must create either a numerical advantage or force a trade for an objective. Lane: if you're top, ping for your mid/jungle when you’re 2‑item and ready to force enemy rotations. Mid game: don't chase isolated kills far from objective timers. Late game: your 1v1 is valuable only if it removes a defender or draws a response; practice quick shove/push to create baron windows.\n\n### Viktor / Syndra / Lissandra\nIdentity shift: scale into zone control and reliable teamfight contribution instead of desperate all‑ins. Lane: prioritize safe CS and level/timing windows so you can control river vision. Mid game: use your zone/ult to deny enemy vision and force fights on your terms around dragons. Late game: play as a peel/zone anchor (Viktor/Syndra) or as a last‑resort engage/protect (Lissandra) — avoid being the first to die.\n\n### Akali / Zed / Kassadin (assassins)\nIdentity shift: convert roams/picks into objective windows rather than chasing kills for score. Lane: shove and roam when the enemy resets or dies; announce your intent (pings). Mid/Late: target backline only when your team is committed to the objective; avoid soloblasting into vision where you get collapsed before baron/dragon.\n\n",
  "itemization_tips": "**Build Efficiency**. High‑level, common errors implied by the data and how to fix them.\n\n- You are getting picked before objectives and dying in fights — start taking a Stopwatch in your boot slot or as a component on at least ~20–30% of games on Yone/Akali/Ahri versus heavy pick comps. A single Zhonya/Stopwatch reduces 'picked before objective' rate dramatically.\n- Control wards and upgrade trinket discipline: buy at least one control ward every back from 6min onward and keep Oracle/Control‑clearing priority before any dragon/baron. Your avg vision score (~23) is low for someone who needs to avoid picks.\n- Adaptive defensive buys over greedy glass‑cannon: when you or your team lacks peel, convert one damage item into survivability (Mercs/Null‑Magic/GA/Zhonya) depending on threat. This prevents high‑value deaths that cost objectives.\n- Runes: for duelists (Yone/Riven) favor press‑the‑attack/Conqueror only when you can reliably extend trades into objectives — otherwise run Fleet/Resolve hybrid or take Bone‑Plating if laning vs heavy poke. For Ahri/Viktor/Syndra prefer Electrocute or Phase Rush depending on playstyle, but prioritize Presence of Mind/Absolute Focus/Scorch only if it helps objective windows (mana sustain and roaming power).\n- Item timing: on waveclear mages (Viktor/Syndra), delay luxury items to get one objective‑securing item earlier (e.g., Zhonya/Morello/Oblivion slot) so you can contest dragon without dying immediately.\n\n",
  "goals": "**Top 5 Strategic Priorities**. Ranked, specific, actionable habits to fix the Root Cause. No fluff.\n\n1) Objective‑first kill participation (KP windows): For the next 20 games, commit to being within 1200 units of any objective 90 seconds before spawn or immediately after a reset. If you can't be there, shove and ping to force the enemy to choose — never be AFK on the opposite side of the map when an objective starts.\n\n2) Vision ritual: buy a control ward on your first back and every time you return with 300+ gold; use Oracle or Sweep before any attempt at dragon/baron. Make clearing the enemy control ward and placing 1 control ward a hard habit before an objective fight.\n\n3) One defensive purchase rule: whenever enemy comp has >1 reliable pick/one‑shot tool, take Stopwatch or Zhonya on the first full build cycle (before finishing that 3rd offensive item). Track this as a binary pass/fail after each loss.\n\n4) Kill Participation metric: raise your KP from ~40% to 55–60% within 6 weeks by: (a) roaming on shoved waves to help jungle for early dragons, (b) grouping 10–20s earlier for mid game objectives, (c) pinging and following up — not soloing. Log KP after each session and stop playing a champion that consistently keeps KP <50%.\n\n5) Pocket‑3 champion plan & phase scripts: reduce your pool to 3 mid champions (one skirmisher — Yone or Riven if you insist, one reliable roam/pick — Ahri, and one scaling zone control — Viktor/Syndra). For each champion write a 3‑line script (Lane: shove/roam cooldowns; Mid: objective role; Late: positioning role). Practice those scripts in normal games until they are automatic.\n\n"
}