{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: \"The Lone Diver Who Gets Picked\". You prefer lane-divers/juggernauts and skirmish-style champs (Kled, Irelia, Mordekaiser) who create side pressure and look for isolated fights. Your damage share is around baseline but your KDA, KP and vision are low — you often attempt to make plays alone or force objectives from forward positions without the vision or team presence to back it up. The result: you either win by out-dueling and snowballing on Kled/Master Yi, or you lose when you get caught, towers fall, and objectives are taken away.\n\n2. **The Root Cause**: The core issue is Macro Discipline & Timing — specifically, repeated overextensions and poor objective timing. The data shows a 100% \"got_picked_before_objective\" rate in timelineed games, a large objective gap (dragons/barons down), and \"lost a lot of tower pressure\" in the majority of losses. Those are not isolated mechanical errors — they're decision errors: you engage or hold forward space without sufficient vision, you mis-time fights around objective windows, and you fail to convert lane pressure into secure objectives or safe recalls. Low kill participation and vision score are both symptoms of the same habit: trying to create value alone instead of coordinating vision and timing with the team.\n\n3. **The 'One Big Thing'**: Stop getting picked before objectives. If you fix your objective-timing and vision discipline (place/clear vision, wait for flank coverage or team to group, and don't facecheck chokepoints), your tower/objective deficits and low KP will fall away and your natural strengths on duel-heavy tops will carry games. This single shift will convert most of the \"close but lost\" matches into wins.\n",
  "champion_feedback": "### Kled\nIdentity shift: Commit to Kled as an early-mid tempo driver — you should be *the* lane priority threat that forces the enemy top/jungle to respond. If you can't get priority, don't overextend alone.\n- Lane (0–15): Play to win short trades that remove enemy teleport parity and force enemy recalls — use Q+E windows and Remount timing aggressively. Push to river control after winning trades, then reset and buy a Control Ward. Prioritize denying CS and plates; each plate converts into mid-game tempo.\n- Mid (15–25): Look to force 2v2/3v3 skirmishes, flank around objectives, or commit to a side-split when your team is grouping poorly. If Baron/Dragon starts, be the vision anchor — place a deep control ward and wait for your team before engaging.\n- Late (>25): Either split and take towers or look for flank engages in coordinated fights; do not facecheck brushes to force picks.\n- Runes/Build quick wins: Conqueror/Presence or PTA depending on matchup. Core: Black Cleaver + Sterak/Death's Dance. Buy early Plated Steelcaps/Merc Treads situationally. Always carry a Control Ward and upgrade sweeper by 10–14 min.\n\n### Irelia\nIdentity shift: Irelia is a lane bully and roamer — convert lane control into objective pressure or mid roam, don’t play her as a late-game isolated carry.\n- Lane: Abuse level 2–6 windows; if you win early, shard wave and look to roam mid or force Rift Herald to break plates. If you lose early, play safe and use Teleport to minimize tower loss.\n- Mid: Use your mobility to isolate and execute priority targets during skirmishes. Fight around vision control and avoid starting objective fights without flank vision.\n- Late: Prioritize flank access or isolate the enemy backline with ult. Don’t be the sacrificial engage — wait for CC windows.\n- Runes/Build: Conqueror; Trinity Force -> Sterak/Death’s Dance. Adaptive boots choice vs heavy AP/CC. Consider early Executioner's or Maw depending on matchup.\n\n### Mordekaiser\nIdentity shift: Play Mordekaiser as a side-lane raid boss who converts a solo kill into objective control.\n- Lane: Push and freeze when ahead; deny enemy roams. You excel at forcing them to respond — turn that into tower plates or Heralds.\n- Mid: Use your ult to remove a key target from fights around Baron/Dragon. Before starting an objective, ensure the ult is available and you have at least one Control Ward on the pit approach.\n- Late: Use Maiden or ult to create 5v4 scenarios in high-value fights; avoid facechecking when Baron is contested.\n- Runes/Build: Riftmaker/Rylai core for extended fights. If you frequently get dove, pick Zhonyas or Spirit Visage earlier.\n\n### Similar Picks / Pool Management\nIdentity shift: Narrow to 2–3 top champions (Kled + 1 melee skirmisher + 1 juggernaut) and learn their matchup/rotation patterns intensely. Recommended pairings: Kled + Irelia (skirmish/roam) or Kled + Mordekaiser (side pressure). Avoid broad role swaps mid-quarter — jungle/mid experiments scatter your macro habits and increase objective timing errors.\n",
  "itemization_tips": "**Build Efficiency**. Common static errors inferred from your stats and loss patterns:\n- You under-invest in objective vision (Control Wards) and sweeper timing. Rule: buy at least 2 Control Wards per game and upgrade sweeper by ~12 minutes on primary tops.\n- Kled: Do not over-prioritize pure glass-cannon when the enemy comp has reliable crowd control. Black Cleaver -> Sterak/Death's Dance is the safer default; GA/Edge of Night later if you're getting locked down and picked before objectives.\n- Irelia: Trinity into Sterak/Death's Dance. Resist buying early lifesteal-only items if you're behind; defensive MR/tenacity are more impactful than raw damage when you're the engage tool.\n- Mordekaiser: Riftmaker first on most maps this patch (15.24) to scale into teamfights; follow with Rylai/Spirit Visage or Zhonyas depending on threats. Use Oblivion Orb/Executioner where enemy healing is decisive.\n- Boots: Take Mercs vs heavy CC/Ap comps, Plated Steelcaps vs AD auto-attackers. If you’re getting soloed or stuck out, defensive boots earlier.\n- Runes: Be consistent — pick runes that match your identity (Conqueror for long trades on divers, PTA for burst trades). Switching runes between games worsens your matchup consistency.\n",
  "goals": "**Top 5 Strategic Priorities**. Ranked, concrete habits to fix the Root Cause.\n1) Objective-Vision Protocol (highest priority): Before any Dragon/Baron attempt or lane shove into river, ensure: 2 enemy-side Control Wards placed, 1 sweep, and at least one teammate covering the flank. If \"got picked before objective\" happens, stop — back and re-clear vision. Metric: reduce \"picked before objective\" occurrences from ~100% to <30% over your next 20 tracked games.\n2) Carry a minimum vision budget: buy 2 Control Wards and upgrade your Sweeper by 12–14 min on every game of your top-2 champions. Metric: raise avg_vis_score by 8–12 points in 20 games.\n3) Champion Pool Stability: Lock to 2 primary top champions (Kled + one) for the next 50 games. Use the second slot as situational counter. Metric: winrate and KP should rise on those champs; aim for +10% winrate on your primary.\n4) Convert Lane Priority into Objectives: After winning a trade or getting lane priority, always push one wave and then threaten Herald/plate/river vision rather than immediately roaming alone. Practice a 2-step checklist: (1) shove, (2) place ward in river/tri, (3) recall/live reset. Metric: \"lost tower pressure\" incidents should drop by half over next 20 games.\n5) Kill-Participation & Grouping Habit: If you have lane priority, look to roam with priority — ping early and take a mid roam or run interference in side bushes rather than solo-chasing. In grouped objective windows, do not engage if you don't have flank vision or teammate numbers. Metric: increase avg_kp from 0.41 -> 0.55 within 30 games.\n\nFollow these in order: fix vision/timing first, then stabilize champion pool, then refine conversion of lane wins into objective control. These are practical, measurable, and will directly attack the biggest reasons you are losing games.",
  "final_note": "Keep a simple tracker: after each loss, note if you were 'picked before objective' (Y/N), and whether you had a Control Ward in the objective area. That single self-check will accelerate learning faster than mechanical practice alone."
}