{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: The Lone Skirmisher.\nYou primarily play duel/skirmish mid/top champions (Yone, Riven, Jax) who thrive in isolated fights and side pressure. Your raw per-game numbers (CS, damage, KDA) are near high-elo baselines, but your kill participation (~39%) and vision/objective numbers lag. That pattern paints a player who is mechanically competent in 1v1s and wave management, but who often plays out-of-sync with team objective windows — either off-splitting too far from fights or getting picked before objectives.\n\n2. **The Root Cause**: Identity mismatch combined with poor objective discipline.\nSymptom: low kill participation, frequent 'picked before objective', and repeated objective gaps (dragon/baron). Root: you favor creating isolated skirmishes or side pressure with skirmisher champions but you don't reliably translate those skirmishes into team advantages at neutral objectives. That shows up two ways: (A) you are not on the same timetable as your team (so you miss or intentionally avoid objective fights), and (B) you position aggressively without the vision or peel needed before objectives and get caught. Both behaviors lead to lost tower pressure and surrendered dragons/barons — the primary reasons your losses snowball.\n\n3. **The 'One Big Thing'**: Be a team-timer, not just a duel-timer.\nThe single most important change is to align your play around objective timers and vision windows. Concretely: commit to either being at the neutral objective with vision and timing (for teamfights) or commit to safe, recognized split-push that forces rotations (and is backed by vision/TP). Stop wandering into objective areas alone without sweepers/control wards and avoid engaging fights that happen right before or during objective setups.\n",
  "champion_feedback": "**Champion-Specific Adjustments**\n\n### Yone\n- Identity shift: Yone is a side-lane/duelist who must convert solo pressure into objective or tower gains. Prioritize hitting the 2-item spike (attack-speed + crit) before forcing risky engages.\n- Lane phase: Trade and farm until you have your first major spike. Use wave control (slow push into enemy turret then roam) to create pressure windows where you and jungler can secure dragons.\n- Mid game: If you split, keep a Control Ward in the nearby river and ping your intention early. If you join fights, wait for enemy CC to be used or for your front line to engage — don't flank into an unseen objective area.\n- Teamfights: Enter fights after front-line CC is used. Your role is clean-up/skirmish — don't try to single-handedly zone for baron without vision.\n\n### Riven\n- Identity shift: Riven is excellent at forcing numbers advantage via roams/teleport plays. Use that to secure mid-game towers and dragons rather than solo skirmishes away from objectives.\n- Lane phase: Freeze or slow-push to deny enemy roams and look for early lane roams to help bot/jg for dragon control.\n- Mid/late: Avoid getting picked out side lanes; if you press split, ensure either a friendly objective timer or enemy pressure that forces them to respond.\n\n### Ahri\n- Identity shift: Ahri should be your primary tool for increasing kill participation. She roams naturally — use that.\n- Lane phase: Push and look to roam at level 6 for easy picks. Your loss games show low KP and high deaths on Ahri — you likely overextend. Use R defensively when roaming into jungle visionless areas.\n- Teamfights: Your value is pick pressure. Prioritize vision and look for flank angles rather than threading risky charm dives into objective pits.\n\n### Viktor\n- Identity shift: Viktor is your clean, high-value scaling pick. His strong winrate shows you can play a safer, team-oriented midstyle.\n- Lane phase: Prioritize safe CS and hex-core progression. You should be at objectives for mid-game fights — Viktor's zoning and sustained DPS help secure dragons/barons.\n- Teamfights: Zone and kite; don't overextend for solo kills. Viktor is a 'be there' champ for objectives.\n\n### Lissandra\n- Identity shift: Use Lissandra as a pick-and-control tool. You often lose when objective fights happen — keep your W/E for disengage during objective contests.\n- Teamfights: Your value is CC and zone control; be the initiator only when your team is ready to follow.\n",
  "itemization_tips": "**Build Efficiency**\n- Yone: You're buying Immortal Shieldbow + Blade of the Ruined King often alongside Berserker's and IE. Buying both Shieldbow and BOTRK delays your crit power spike. Decide lane-matchup intent: if you need survivability vs heavy burst/assassin, Shieldbow first; if you want split sustain vs tanky champs, BOTRK is fine — but prioritize completing a crit item (IE or PD) by item 2–3 to hit meaningful DPS. Also push Oracle Lens (sweeper) earlier when contesting dragons/barons — runes/builds alone won't save you from being picked.\n- Riven/Jax: Your Riven core is consistent (Sundered Sky / Death's Dance). Keep that but spend on vision/control instead of an extra offensive item when approaching objective windows. If you are split-pushing, consider Sterak’s/Death’s Dance timing to survive 2v2s and maintain tower pressure.\n- Ahri: Your Malignance and Lich Bane patterns are fine. The bigger issue is not items — it's being present for objectives; spend 75–100 gold on control wards before fights and consider early Stopwatch/Zhonyas situationally to avoid being collapsed on during objective fights.\n- Viktor/Lissandra: Complete your core scaling pieces earlier. For Viktor, ensure you upgrade core/hyper-scaling items and do not delay them chasing kills. For Lissandra, Zhonya’s timing matters: build it before you attempt to make solo plays around objectives.\n- Vision vs Sweeper timing: Across champions you underinvest in objective vision. Make Oracle Lens or Control Ward purchases a non-negotiable ritual before any dragon/baron contest. If you get picked before objective more than once, clamp down on sweep ordering: your job is to Clear -> Place -> Contest.\n- Rune adaptation: Yone uses Lethal Tempo mostly — fine vs many AD carries and for extended fights. However, vs heavy CC/tankier comps consider Conqueror or a more defensive rune setup. For Viktor and Viktor’s Aery usage, if it's working (78% winrate), keep it — but don't use rune choice as an excuse for poor objective alignment.\n",
  "goals": "**Top 5 Strategic Priorities**\n1. Increase Kill Participation to >50% in the short term: commit to one roam per wave and track dragon/baron timers — if you roam, ping and be at the objective if a fight forms.\n2. Vision Before Objective: make a hard rule — before any dragon/baron, you or your support must have cleared enemy vision and placed at least 1 control ward in the pit or river brush. If you're split, place deep vision and ping your presence.\n3. Two Styles, One Commitment: For each champ, decide pre-game whether you'll play 'team-timer' (join fights/objectives) or 'safe-split' (teleport-ready, deep vision, force rotations). Do not hedge. For Yone/Riven: default to team-timer until you can reliably force baron threats.\n4. Stop Getting Picked: adopt a simple checklist before entering objective areas — (a) minimap: allied positions, (b) wards: is enemy vision cleared, (c) CC used: are enemy flank tools available? If any are 'no', do not facecheck.\n5. Narrow & Practice Pool: play 2–3 champions consistently for the next 50 games (e.g., Yone, Viktor, Ahri). For each, record one replay / session focusing on the mid-game decision to either join or split at dragons/barons. Make that replay review short and focused on whether you followed your 'team-timer' rule.\n\nFollow these priorities for the next quarter of games — if you convert a single objective alignment habit (be at the right objective with vision), your low kill participation and objective gaps will close and your winrate will reflect your mechanical skill much more consistently.\n"
}