{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: \"The Lone Dagger (Isolated Diver)\". You play high-impact, skirmish/diver junglers (Diana, Briar, Rammus) that win fights and create flashy KDA, but you systematically under-index on team objectives and coordinated teamfights. Your KDA and CS are strong, your damage share is slightly below the target, and your kill participation is significantly low for a high-tier jungler. That combination points to a player who gets successful solo or small-scale fights, but often isn’t present or correctly positioned for objective fights and tower-pressure windows.\n\n2. **The Root Cause**: A consistent macro-discipline and timing problem. You habitually take or seek isolated engages and flank skirmishes without locking down vision, without confirming teammate commitment, or at the wrong tempo — which leads to \"picked before objectives\" and objective gaps. In losses you’re frequently underperforming relative to teammates because those solo plays either don’t translate to objectives or they get you killed before crucial dragons/Barons/tower fights. The symptom (low KP, objective gaps, picks before objective) is caused by a mindset of \"find the solo play first, convert later\" rather than \"secure vision, align with team, and convert fights into objectives.\"\n\n3. **The 'One Big Thing'**: Be at objectives on time with vision and a clear team plan. If you stop getting picked or stop being out-of-sync with your team around dragon/baron/towers, your low KP and objective gaps collapse — and your existing mechanical strength will carry games much more reliably.",
  "champion_feedback": "### Diana\n- Identity shift: from solo assassin to objective-diver. Use your burst to win 2v2/3v3s around Dragons and mid-priority skirmishes, then immediately convert to dragon/tower.\n- Early pathing: prioritize scuttle + early gank mid or top to create priority for dragon control. If mid is shoved, path through river first to deny enemy scuttle.\n- Vision & approach: always clear enemy control wards and place 1-2 control wards 45–30s before a dragon. Approach from fog with a sweeper; don’t dive the backline if you have no flank or teammate CC available.\n- Runes/items: Electrocute or Dark Harvest if you want pick power; prefer Hextech Rocketbelt (or Night Harvester if you use it) into Zhonya for mid-game objective fights. Consider early Oblivion Orb if enemy healing is high.\n- Phase coaching: early — aggressive ganks to create lane priority; mid — look to flank and force fights where you can immediately translate kills into dragons; late — avoid solo dives that lose Baron timing; focus on isolated picks only if a control ward and teammate commitment exist.\n\n### Briar\n- Identity shift: use Briar to force fights that lead to towers and dragons, not just to delete targets. Your strongest value is creating windows for objectives by isolating an enemy and forcing the enemy to respond.\n- Pathing: early invade when the enemy jungler is on the opposite side to deny dragon control; make aggressive early plays into side lanes to push plates/towers.\n- Runes/items: Electrocute/Conqueror depending on matchup; early lethality/AP depending on kit scaling — prioritize items that let you stick in skirmishes and reset for next objective.\n- Phase coaching: early — force priority; mid — convert picks into plates/dragons; late — don’t single-handedly contest Baron without vision and smite advantage.\n\n### Rammus\n- Identity shift: play Rammus as the objective-engage anchor rather than a solo scorer. Your 100% winrate shows you excel in straightforward engage/peel roles.\n- Pathing: be first to river control and set up flank CC for Baron/Dragon fights. Use pre-emptive taunt + knockup combos to deny smite fights.\n- Runes/items: full tank items (Sunfire/Thornmail/Dead Man’s) and early Control Wards. Get Locket/Redemption if allied carries need protection.\n- Phase coaching: early — secure scuttle and contest enemy pathing; mid/late — prioritize vision and engage windows that secure objectives.\n\n### Jax (and similar skirmishers)\n- Identity shift: treat Jax as a side-lane tempo tool who forces objectives by drawing pressure, not as a split-push gambler who ignores Baron/Dragon windows.\n- Pathing & play: push to create priority and then join for neutral fights when your team can leverage that pressure. On even numbers, you assist objectives rather than split blindly.\n- Runes/items: Conqueror into Trinity Force or Divine Sunderer (per patch changes); build defensive item third to survive teamfight windows.\n\n(General): For all champs: increase pre-objective vision (1–2 control wards + sweeper 30–45s before), ping earlier, and confirm teammate readiness before starting Baron/Dragon or diving towers.",
  "itemization_tips": "**Build Efficiency**. \n- Common static errors inferred: either overprioritizing solo-damage spikes or picking hybrid builds that reduce objective sustain. On divers (Diana/Briar) avoid pure glass-cannon builds that make you unable to secure objectives after a kill.\n- Rammus: keep full-tank mythic and buy early Thornmail/Brambles vs heavy heal/AD — don't roam with squishy offensive items.\n- Diana/Briar: take a balance of AP + CDR/Zhonya for survivability post-dive. If you sometimes finish games with low damage share, it often means you’re buying off-role items (too much utility or early defensive) — commit to an item path that ensures you can both secure kills and smite/finish objectives.\n- Runes: prioritize consistent, fight-enabling trees (Electrocute or Conqueror for skirmishers; Aftershock/Resolve options for engage tanks). Avoid runes that only serve 1v1 snowball if you want to help objectives.\n- Vision items: buy Control Wards every back when contesting dragons and always carry Oracle Lens at stage transitions. The data shows \"got picked before objective\" — many of those are purely vision failures.\n- Smite/Timing: never contest an objective you can’t smite-win. Adjust build if you are frequently losing Baron/Dragon fights — buy earlier objective control items (e.g., QSS is rarely needed as a jungler; focus on team utility items or defensive mythics).",
  "goals": "**Top 5 Strategic Priorities**. A ranked list of 5 concrete, actionable habits to fix the Root Cause. No fluff.\n1. Pre-Objective Ritual: 45–30 seconds before any dragon/baron, place 1–2 control wards and sweep enemy vision; ping \"on my way\" and check teammate availability before committing. If teammates are not ready, do not start.\n2. Increase Kill Participation by Pathing with Lanes: In the first 10 minutes, favor ganks that create lane priority over solo farming. Two well-timed ganks per side lane per game should raise your KP toward the 0.65–0.75 range.\n3. Anti-Pick Discipline: If you want to solo flank, ensure either a control ward or a teammate visible in fog; never facecheck or start Baron/Dragon alone. If you are the engage, commit only when you can immediately follow with smite/ally cooldowns.\n4. Convert Wins into Objectives: After a successful skirmish or kill, automatically rotate to take plates/dragon when safe. Make it a mechanical rule: \"If I kill someone in river/side, I buy 15–30s to secure plate/dragon vision and objective.\"\n5. Post-Game Micro-Review Template: Spend 3 minutes post-loss checking: (a) Were you at objective X on time? (b) Did you have control wards placed 45s prior? (c) How many times did you get picked before objective? Keep a 2-column log (what I did vs what I should have done) and correct one specific error per session.\n\nImplement these five priorities for the next 20 games: your mechanical play is already good — make presence and objective timing the habit and your winrate will scale more consistently."
}