{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: \"The Skirmish Specialist with Missing Map-Strings.\" \n\nYou play melee mid skirmishers (Yone primary, occasional Yasuo/Riven). Your numbers show a mid laner who farms and deals respectable damage (damage share ~25.5%, CS/min ~7.03 — near high-elo baseline) but doesn't consistently show up when the team needs him. Low kill participation (0.393 vs a 0.65 baseline) + repeated \"got picked before objective\" and objective-control failures paint the picture: you are mechanically capable in 1v1/2v2 skirmishes, but you lose leverage in coordinated objective phases and teamfights. KDA is slightly below baseline (2.81 vs 3.0) and death-related loss patterns indicate timing/positioning errors rather than pure mechanical failure.\n\n2. **The Root Cause**: Weak macro discipline around objective phases and a repeated identity mismatch. You treat mid as a lane to win 1v1s or farm to a personal spike, but you then either: (a) roam or fight at the wrong times without vision and get picked, (b) fail to group or influence fights (low KP), or (c) enter objective fights without setup/peel and die, surrendering Baron/Dragon/towers. In short: you can produce fights, but you don't consistently choose the right fights or coordinate your timing with your team and vision control.\n\n3. **The 'One Big Thing'**: Fix objective-phase decision-making: vision + timing + participation. If you consistently stop getting picked before objectives and start making deliberate, timely contributions to mountain/baron fights (through positioning, wards/Oracle, and choosing when to engage), your winrate and responsibility index will improve far faster than marginal mechanical gains.\n",
  "champion_feedback": "**Champion-Specific Adjustments**.\n\nYone (primary, 15 games) — Shift from solo flanker to timed teamfight anchor:\n- Identity shift: Stop treating Yone purely as \"find isolated kills.\" Instead treat him as a controlled skirmisher who hits power spikes and engages when your team has vision/control. \n- Lane: Prioritize wave management — shove once you can roam safely or slow-push to create roams; freeze when opponent can all-in you or when the map is hostile. After you hit 2 items, look to join grouped objectives rather than chasing solo picks in enemy jungle.\n- Mid game: Do not facecheck brushes near objectives; hold a defensive angle, wait for your team's initiation or take a flank only when you know enemy CC is committed. If you get picked frequently, favor defensive timing (backline flank) or wait for a setup (Z-ability/knockup from ally).\n- Late game: Target priority is enemy backline when there's a frontline/peel present — if the team has no frontliner, pivot to split pressure and force the enemy to respond.\n- Runes/Items: Use Conqueror or Press the Attack depending on matchup; prefer a survivability item (Stopwatch→Zhonya adaptation via Stopwatch/GA/Shield Bow) when facing heavy pick/CC. Consider Teleport over Ignite in a portion of games to increase map pressure (see pool advice).\n\nYasuo (2 games) — Stop solo-manning fights without setup:\n- Identity shift: Yasuo thrives with knockups and team setups. If teammates lack reliable knockups or you don't have good coordination, swap to a more teamfight-oriented mid (Orianna/Azir) or pick Yasuo only when your comp provides setup.\n- Lane/mid game: Don't overextend to create plays if jungler isn't nearby — Yasuo's playstyle requires either winning lane and creating pressure or freezing and scaling. If behind, play safe and aim for mid-game farm/TP plays.\n- Item/rune notes: Conqueror is standard; QSS is high priority vs heavy hard-CC teams.\n\nMorgana (1 game) — Use as a control/roam anchor, not a side-lane skirmisher:\n- Identity shift: When you pick Morgana mid, lean fully into roaming and vision control. Push the wave, place key deep control wards, and look to create picks for your team before objectives. Morgana can directly fix the \"got picked before objective\" pattern by clearing vision and enabling safe objective starts.\n- Item/rune notes: Morello/Athenes vs sustain, Zhonya for survivability around Baron contests.\n\nThresh (1 game) — If you ever flex to support, keep his core goals: vision, picks, roaming:\n- Identity shift: Thresh should be played as a vision-control roaming support; if you take Thresh into mid role only as a flex pick, be aware you lose objective pressure if you don't rotate to help sweep wards.\n\nRiven (1 game) — Side-lane skirmisher only when you can 1v1 or be the split threat:\n- Identity shift: Riven needs space and time to farm to the 2-item spike. Don't force Riven into clustered objective fights if your team lacks peel.\n\nChampion pool advice (practical additions):\n- Add 1 consistent control/teamfight mid (Orianna or Azir) to stabilize objective-phase impact and to give you a reliable pick when team needs a clean Baron/dragon engine.\n- Consider Twisted Fate if you want to increase KP and objective responses quickly — TF's global pressure reduces the \"got picked before objective\" issue by enabling you to create man advantages and push lanes while keeping vision control.\n- Keep Yone as your carry identity, but pair him with at least one champion in your pool who dictates objective fights (Orianna/Azir/Twisted Fate/Galio).",
  "itemization_tips": "**Build Efficiency**.\n\nGeneral static errors inferred from data and how to fix them:\n- You get picked before objectives: buy and use vision tools proactively. Bring a Control Ward every Baron/Dragon attempt and use Oracle Lens on cooldown in the 2 minutes before objectives start. If you die while attempting to secure vision, you are building damage where a Stopwatch/QSS or early defensive component would have saved you.\n- Defensive items matter for skirmishers: against teams with heavy pick/CC, prioritize a survivability option earlier (Stopwatch→Zhonya, Shieldbow/GA, Sterak's when facing consistent burst). Dying first as Yone/Yasuo often costs the objective. Treat one defensive item as part of your core in games where you are getting targeted.\n- Rune choices and role adaptability:\n  - Yone/Yasuo: Conqueror is standard. If you struggle to impact objectives, try Flash + Teleport on a few games (instead of Ignite) to improve rotation and participate in side-lane/Baron plays.\n  - If enemy CC is the reason for repeated picks, prioritize QSS early (buy third or fourth item) and consider Biscuit/Second Wind runes in tough lane matchups for sustain.\n- Boots and Adaptation: Don’t default to Berserker’s in every game. If the enemy has heavy CC/AP poke, Mercury Treads or Plated Steelcaps are legit earlier purchases. Your survivability in teamfights often depends on choosing boots that reduce the most deaths.\n- Objective-specific items: If your team struggles to contest Baron/Dragon vision, force the issue with Control Wards and use a Stopwatch in your build path when you foresee repeated Baron attempts.\n\nPractical in-game checklist (before an objective):\n- 2 control wards placed in the river/jungle approach.\n- Enemy sweepers cleared 15–30s before starting the objective.\n- Confirm jungler+frontline position and only commit if you have numbers/vision or a reliable AD/CC carry alive.\n",
  "goals": "**Top 5 Strategic Priorities**.\n\n1) Stop getting picked before objectives — Vision & Approach Protocol (highest priority)\n- Before every Baron/Dragon: place 2 control wards on approach, clear enemy wards with Oracle, and only start the objective when you have either vision + numbers or a clear flank plan. If you die in the 60s leading up to objective, do a death-review on that moment.\n\n2) Raise Kill Participation via disciplined roaming\n- After pushing a mid wave, commit to one purposeful roam per wave where it’s safe: either to help jungler invade, pressure side lane, or plant vision; ping intention and track successful roams. Aim to move your KP from ~0.39 → ~0.6 within a month by increasing deliberate roams.\n\n3) Adjust item/rune decisions to reduce early deaths\n- If you die repeatedly to picks or burst, take Stopwatch early, prioritize an early defensive component (Shield Bow/GA/Sterak/Zhonya depending on damage type), and adapt boots. Try Flash+Teleport on 10 games to improve map impact if you’re missing roams.\n\n4) Wave management discipline (lane → objective linkage)\n- Learn two default mid wave states: shove-and-roam (push then leave 10–15s after wave hits tower) and freeze (deny enemy ability to roam if jungle pressure exists). Use slow-push windows to create large waves that force enemies to rotate so you can join your team for objectives.\n\n5) Post-game micro-action habit: 90-second objective replay\n- After any loss tagged with \"got picked before objective\" or \"objective_gap\", watch the 90 seconds before the objective start. Log the single reason you died/failed (vision, overextend, timing, wrong item) and set a corrective action for the next game.\n\nExecute these five in order: vision+approach first, then committed roams and defensive builds, then wave discipline, and finish with a short replay habit. Fixing objective-phase choices will unlock your damage and farm into consistent wins rather than high-variance skirmishes."
}