{
  "overview": "Markdown. **The Diagnosis**.\n\n1. **Your Archetype**: \"The Mid-lane Island Duelist\". You play like a high-skill skirmisher/duelist who oscillates between two identities: a pick/roam mage (Ahri/Syndra) and a side‑lane duelist/split threat (Yone/Riven). Your raw mechanics and lane farming are near high-elo baselines (CS and damage), your KDA is healthy, but you habitually operate off-island — you win local fights or farm, then aren’t on the same clock as your team for objectives. That creates games where you look fine on paper but your team loses objectives and gets punished.\n\n2. **The Root Cause**: Objective-misaligned play and poor objective discipline. Data shows extremely low kill participation (avg_kp 0.403 vs 0.65 baseline), a huge rate of \"got picked before objective\" tags, and repeated dragon/baron/tower control failures. The symptom (low KP, losing objectives, getting picked) points to a single behavioral stack: you prioritize solo windows (split 1v1s, late shove, chasing personal advantage) and/or push tempo without the vision/clear communication needed to be safe around objective windows. This becomes a cascade: you're off-map when dragon/baron fights spawn → team fights 4v5 or loses vision → you get blamed or die trying to contest → objectives fall.\n\n3. **The 'One Big Thing'**: Stop being off the map during objective windows. Convert your duel-wins into team-power by being present and playing to objective windows: pre‑objective vision, timing recalls to arrive, and refusing to be the player who gets picked before a fight. If you fix objective presence (and the related warding/positioning), the largest cluster of losses disappears.\n",
  "champion_feedback": "Markdown. **Champion-Specific Adjustments**.\n\nYone (83 games) — \"Stop being a lone split pusher\":\n- Identity shift: treat Yone as a skirmish/secondary engage champion who enables fights rather than a pure side-lane rat. Your Yone games show decent CS but low KP and many objective losses.\n- Lane: farm and shove only when a clear win-state exists (enemy mid recalled/pushed). If you shove, use the shove window to roam to scuttle/secure vision — don’t shove then remain out of vision for dragon.\n- Mid‑game: synchronize your ultimate engages with your jungler — look to flank for teamfights rather than committing alone. Buy 1 defensive mid-game item (e.g., GA or Sterak’s situationally) when you are getting picked off before objectives.\n- Late-game: your role is playmaker or cleanup — don’t walk into enemy control wards. Prioritize flank entry or post-engage cleanup, not the frontline.\n\nAhri (68 games) — \"Lean into roaming and picks\":\n- Identity shift: Ahri is your best team‑oriented champion here. Your Ahri stats have higher KDA and damage share; use her to create map pressure.\n- Lane: shove level 1–3 when safe, then roam at first opportunity (recall timing + mid‑lane priority). Your KPI must increase by converting early roams into kills/objective pressure.\n- Mid‑game: be the primary vision remover and pick tool around dragon. If you spot a target, commit; otherwise, use R to reposition for disengage to avoid getting caught.\n- Late-game: prioritize Zhonya’s timing on Baron plays — a well-timed Zhonya prevents a pre-objective pick.\n\nRiven (42 games) — \"Use Riven to draw pressure, not to force objectives\":\n- Identity shift: treat Riven as a split pressure win-condition. Your winrate is strong; use that to create side pressure so the enemy must respond and your team gets objectives safely.\n- When on mid: avoid Riven mid unless you have clear side-lane follow-up. If forced mid, emphasize roams and map pressure rather than 1v1 brawls at dragon.\n\nSyndra / Lissandra / Viktor (9–6 games) — \"Pick for teamfights or don’t pick them\":\n- Syndra: keep playing her as a pick/leverage champion — prioritize vision and Q+E picks before objectives.\n- Lissandra: she should be your engage/zone tool. If you’re using Lissandra but repeatedly get picked, swap to Ahri/Syndra until your map-awareness and roam timing improve.\n- Viktor: play him when you expect to play a safe, scaling mid‑game zoning role; avoid picking him in games where you’ll be the primary roamer.\n\nChampion-pool recommendation:\n- Narrow to 2 primary identity lanes: Ahri (primary teamfight/pick) + Yone or Riven (primary carry/side pressure). Limit one offpick (Syndra) for games requiring pure pick/one-shot.\n",
  "itemization_tips": "Markdown. **Build Efficiency**.\n\nObserved build/rune themes to correct:\n- Use item/rune choices to solve the visibility problem. If you are getting picked before objectives, add defensive/timing items (Zhonya's on AP champs; GA or Sterak's/Death's Dance on duelists) in games where enemy pick threat is high — this is cheaper ELO than trying to mechanically outplay poor positioning repeatedly.\n- Runes: match runes to the role you want for the game. If you plan to roam/pick as Ahri/Syndra, take Electrocute (or Dark Harvest for snowball) + Ultimate hat is fine. If you plan to skirmish/split on Yone/Riven, take Conqueror and run sustain/secondary defensive options. Don’t play Ahri with full-extended split-push runes; that’s an identity mismatch.\n- Waveclear vs teamfight items: On champions where you must group (Ahri, Syndra, Viktor), prioritize scaling/zone items that increase teamfight impact (Rabadon's/Lich Bane/Shadowflame depending on enemy MR) so your damage share rises when you finally group. On duelists, prioritize one survival item so you don’t become the frequent \"got picked\" before objectives.\n- Vision spending: buy at least 2 Control Wards per game and prioritize upgrading to Oracle Lens on at least one back before objective windows. This is an 'item' efficiency issue—spending gold on vision control yields more climb than rare exotic builds.\n",
  "goals": "Markdown. **Top 5 Strategic Priorities**. A ranked list of 5 concrete, actionable habits to fix the Root Cause. No fluff.\n\n1) Objective Presence Checklist (Immediate habit): 30 seconds before any neutral objective spawn (Dragon/Baron), be on the map and in position — either in mid with vision or rotating from lane. If you can’t be there in 30s, recall or teleport back; do not stay solo-shoving. Target KP increase to 0.55 within 20 games.\n\n2) Pre-objective Vision Rule (Concrete action): Before you or your team engage an objective, ensure at least 3 enemy vision denial actions: 2 control wards placed around the pit and one cleared path (Oracle or sweep). If you are the mid laner, it is your responsibility to be the second control-ward/plaque sweeper prior to first dragon after 10 minutes.\n\n3) Champion-pool constraint (Practice habit): For the next 50 ranked games, restrict picks to two primary champions and one situational: Ahri + (Yone OR Riven) + Syndra as situational. This forces consistent gameplans and reduces identity mismatch.\n\n4) Pre-objective Positioning Drill (Micro behavior): Whenever pinged for objective (ally or enemy ping), run a five-second micro-check: find nearest enemy ward, check enemy ultimates/jungle location, and then commit or back out. If you die inside this 5-second window, record the replay timestamp and review one death per day.\n\n5) Measurable targets & review cadence (Accountability): Weekly review of 10 losses: annotate whether you were on the map for objectives or got picked. Targets for next quarter: CS/min -> 7.2+, damage_share -> 0.27+, avg_kp -> 0.55+, reduce \"got_picked_before_objective\" tag rate by 50%. If targets not met, reduce champion pool further and re-emphasize vision/objective drills.\n"
}