{
  "overview": "Markdown. **The Diagnosis**.\n\n1. **Your Archetype**: \"The Isolated Diver\"\n\nYou play like a hard-skirmishing, solo-execution jungler (Diana-centric) who reliably wins 1v1s and gets clean KDA lines but rarely converts those personal plays into team advantage. Your KDA is high (5.38) while damage share and kill participation are under or barely at baseline (0.186 dmg share, 0.516 KP). That says: you are effective at picking or soloing targets, but you're often not on the same page as the team for objectives, vision, and coordinated fights. Game outcomes show the pattern — frequent lost towers, repeated objective control deficits, and a very high rate of getting picked right before objectives.\n\n2. **The Root Cause**: Macro Discipline + Identity Mismatch\n\nSymptom: you win small fights/duels but lose games to drake/baron/towers and get caught before objectives. Root cause: you default into a solo-diver mentality without the macro steps that must accompany it. Specifically:\n- Poor objective timing and vision discipline: your play pattern shows many \"got picked before objective\" events and an average dragon gap of -1.64 — you are either overextending to force picks or pathing into objective areas without proper vision/timely backing from teammates.\n- Conversion failure: when you do make picks, you do not consistently convert them into towers, dragons, or barons (lost tower pressure and lost Baron control are the top loss reasons).\n- Positional/participation mismatch: low KP indicates you often aren’t in the right place during decisive teamfights — either off split-pushing too deep or cleaning fights after objectives are already lost.\n\n3. **The 'One Big Thing'**: Stop treating fights as isolated wins — make every play translate into objective control. Prioritize vision and timing over solo aggression: if you get a pick, immediately clear vision and force an objective or take plates/tower. If you're rotating for Baron/Dragon, don’t be the first to facecheck; insist on wards, work with a front line, and only commit after confirming enemy positions.\n",
  "champion_feedback": "Markdown. **Champion-Specific Adjustments**. Group by champion. Focus on identity shifts (e.g., 'Stop playing Vayne like a lane bully').\n\nDiana (17 games — primary):\n- Identity shift: Stop playing Diana as a pure solo flanker who looks for isolated kills without setting up vision or objective follow-up. Play Diana as a tempo-creator: your goal should be creating windows to force drakes/towers or to blow a key enemy cooldown and immediately take plates.\n- Early pathing: prioritize scuttle and river control early (Diana’s early clears allow fast vertical pressure). If you take enemy jungle camps, leave a ward behind to track enemy pathing before you pressure objectives.\n- Midgame: after a successful skirmish, take a 20–40 second vision and objective checklist: clear enemy control wards with sweepers, place deep control ward, and then push for plate/dragon. If teammates are dead, don’t overstay — reset and pressure a side lane only if you can still force map pressure.\n- Teamfights: stop exclusively looking for single-target assassinations when team has no frontline. If frontline is missing, prioritize getting to the highest-threat target only when your team can follow — otherwise stall and zone.\n\nRammus (1 game — off-pick):\n- Identity shift: Rammus is an engage/peel anchor. Use him to secure objectives by forcing enemy to run away or face CC, not as a solo pick-tool. If you swap to Rammus when ahead, convert that pressure into towers and dragons by engaging in front of the objective with vision.\n\nLulu (1 game — support experiment):\n- Identity shift: as a support you should not roam into fights as Diana would. Your role was to protect carries and secure vision — play safe in fights and keep vision perimeter; you don’t need to force picks.\n\nKai'Sa (1 game — off-role):\n- Identity shift: Kai’Sa requires farm and proper frontline. On a game where you’re not the primary AD, allow her to clean fights rather than you trying to be both the diver and the carry.\n",
  "itemization_tips": "Markdown. **Build Efficiency**. Point out static build errors or rune mistakes seen in the data.\n\n- Jungle item & rune clarity (Diana): pick a reliably burst-oriented rune set and jungle item path that enable faster 6 and first CC combo. If you’re using a scaling rune (Dark Harvest) but then playing for early skirmishes, you have an identity mismatch — prefer Electrocute/Phase Rush (or the aggressive keystone in your patch) for early pick power and clear speed.\n- Mythic & core items: stick to high-exec burst mythic items that maximize your ability to delete targets quickly (mythic AP burst into Zhonya/obvious defensive if you get dove). Avoid hybrid or split builds (mixed AP/tank) that lower your single-target threat and make it harder to snowball picks into objectives.\n- Boots timing: take boots early if you struggle to get on carries in teamfights; if your ganks are timing-sensitive, Ionian boots earlier to lower ability cooldowns and increase your gank pressure.\n- Vision tools: buy Control Wards every back and use Sweeper actively before objective fights. Losing Baron/Dragon control repeatedly suggests your item/rune choices are fine but you are not investing in vision items consistently.\n- Situational items: if you’re getting repeatedly picked before objective fights, consider Zhonya’s early in games where enemy burst/targeting CC is high to avoid being burst before your team can fight.\n",
  "goals": "Markdown. **Top 5 Strategic Priorities**. A ranked list of 5 concrete, actionable habits to fix the Root Cause. No fluff.\n\n1) Pre-objective Checklist (mandatory): before any dragon/baron attempt, confirm 3 things in order — enemy positions seen (sweep/wards), at least one control ward cleared, and at least one teammate ready to help take objective. If any step fails, disengage and reset.\n\n2) Post-pick Conversion (practice habit): whenever you secure a kill or force a summoner, execute an immediate 12–25 second conversion plan: place control ward in enemy jungle, push nearest wave/plates, and take dragon/tower or force vision denial. If you can’t convert because team is dead/rotating, back off and prepare for next window.\n\n3) Pathing for presence (daily drill): open each game with a path that secures at least one enemy scuttle and a deep-recon ward toward the enemy jungle entry you plan to pressure. This increases KP and reduces getting-out-of-position picks.\n\n4) Vision-first fights (golden rule): never facecheck objective pit alone — be the initiator only when you have sweeped and your front line/engage is ready. If you’re the only one alive near an objective, don’t try to contest it solo.\n\n5) Simple KP target: increase kill participation by being present for lane roams or objective fights — set a minimum goal of being within 800 units of every drake/baron attempt. If you miss it, record why (dead, top-side pathing, no vision) and correct the single weakest reason next game.\n"
}