{
  "overview": "# **The Diagnosis**.\n\n1. **Your Archetype**: The 'Isolated Duelist'.\n   - You play like a skirmisher/duelist who prefers side‑lane pressure and 1v1s (Yone, Riven, Jax), and you also run prioritized pick-mages (Ahri, Syndra, Viktor). Your raw numbers show a player who can carry fights (decent KDA and near‑baseline damage share) but frequently chooses fights or rotations that leave you out of objective windows or vulnerable to being picked.\n   - Evidence: very high volume on Yone/Riven (skirmishers), solid KDA overall (3.49) and damage share near mid/high baseline (0.239), but very low kill participation (0.403). That combination is classic: you often create or chase isolated kills but aren’t synchronized with your team around dragons/barons and towers.\n\n2. **The Root Cause**: Macro discipline + positioning mismatch with your champion identity.\n   - Symptom: massive frequency of 'got picked before objective' and 'lost tower/dragon/baron control', plus low KP.\n   - Why: you habitually take high‑risk windows to side‑lane, invade, or look for solo skirmishes without ensuring vision, teammate presence, or objective timers. That yields either: (a) you die and lose fight tempo, or (b) you refuse to join team windows and miss out on objectives. In short: your micro (duels/skirmish) is often stronger than your macro (objective timing, vision setup, team-synchronization).\n   - Psychological layer: a strength bias — you trust your outplay potential and therefore accept higher variance plays. That works in isolated skirmishes but backfires on team objective windows where safety, setup, and patience win.\n\n3. **The 'One Big Thing'**: Stop being the first person on the map to be caught around objectives. Fix pre‑objective behavior by making your default action referral to team/vision before leaving fog-of-war. Concretely: make 'no vision + no teammate = no step' your rule when approaching dragons/baron/tower fights. This single habit will reduce deaths, raise KP, and immediately improve objective control.\n",
  "champion_feedback": "# **Champion-Specific Adjustments**.\n\nYone (83 games)\n- Identity shift: Stop treating Yone purely as a roam/split pick. Turn him into a controlled power-spike champion: farm to 2 items, then look for clean flank engages or isolated duels only when you have vision and a clear escape.\n- Lane: Prioritize waves until level 9–11 spike. Trade only when enemy overextends or you have river/jungle vision.\n- Mid game: If you split, keep a control ward and leave a visible path to escape. Avoid soloing into enemy jungle to contest dragons/baron.\n- Late game: Be the finisher, not the initiator. Let your team absorb initial CC so you can enter after key enemy disables are used.\n\nAhri (68 games)\n- Identity shift: Use Ahri as your 'objective maker' — high KP and winrate indicate you can create picks. Roam earlier and more reliably, but only off proper wave management.\n- Lane: Push when you plan to roam. Communicate ping and ensure jungler/side-lane can follow for dragon fights.\n- Mid game: Use charms to set up picks around drake and neutral fights; avoid overextending for solo roams without vision.\n- Late game: Stick to pick‑and‑poke role; if your team struggles with engage, use Ahri to pick and force fights on your terms.\n\nRiven (42 games)\n- Identity shift: Keep Riven as a split pressure tool but stop playing her like a solo assassin in objective windows. If you take top Riven, your goal is to draw pressure away from mid and create numbers advantages — not to chase solo kills that result in objective loss.\n- Lane: Secure early plates, then back to base with TP timing aligned to objective windows.\n- Mid/Late: If your team loses teamfight control, split and trade towers, but only when you have deep vision and teleport available.\n\nSyndra / Viktor / Lissandra (small sample)\n- Syndra: Play as pick setup. Don’t force extended fights; safe waveclear into zone control around drakes.\n- Viktor: Prioritize safe scaling—push to force enemy to respond and then rotate to dragons when your jungler is present.\n- Lissandra: You are playing a teamfight engager/peeler—use her to lock down high-value targets near objectives; avoid solo dives that become pick opportunities.\n\nAkali / Assassins\n- Temp bench until your macro discipline improves. Assassins punish poor vision/coordination heavily; you’re getting caught too often for safe assassin play.\n\nGeneral pool guidance\n- Lean into Ahri and Viktor in games where you need to create picks and objective control.\n- Use Yone and Riven when you can guarantee a side-lane advantage with vision and TP available. If you cannot secure vision/control, default to Ahri/Viktor to impact KP safely.\n",
  "itemization_tips": "# **Build Efficiency**.\n\n- Defensive buys are underused relative to how often you get picked. When 'got picked before objective' is common, prioritize one defensive/on-demand survival item mid-game on skirmishers: QSS (against heavy CC), Stopwatch/Zhonya's (for AP burst), or Guardian Angel if you're being focused constantly. Example: Yone → earlier QSS or GA when facing heavy CC/targeting; Riven → consider Death's Dance / Sterak's for survival when games extend.\n\n- Vision items and trinket management count as items in your macro build. Buy and place 1 control ward every 4–6 minutes; upgrade or swap to Oracle as the game approaches objective windows. This reduces picks more than an extra damage item would.\n\n- Rune guidance (broad rules):\n  - Skirmishers (Yone/Riven/Jax): Precision tree (Conqueror/Press) for sustained fights; take Second Wind or Bone Plating vs heavy poke/CC lanes.\n  - Pick mages (Ahri/Syndra/LeBlanc/Viktor): Domination (Electrocute for burst) or Arcane/Scorch depending on playstyle; take Magical Footwear/Cosmic Insight for better mid-game roaming capacity.\n\n- Item tempo: on waveclear/battlemages (Viktor, Syndra), commit to the spike (Hexcore upgrade / Lost Chapter → RoA/Seraph) rather than buying many combat items early. Losing spike timing reduces presence at drake windows.\n\n- Avoid static builds. If you die often pre-objective, a single defensive purchase (QSS/Stopwatch/GA) in your 3rd or 4th item recovers far more winrate than a pure damage item.\n",
  "goals": "# **Top 5 Strategic Priorities**.\n\n1) \"No Step\" Pre‑Objective Habit (Highest priority)\n   - Rule: When approaching drake/baron/tower, if you do not have: (a) a control ward in the area, AND (b) at least one teammate present or visible on the map, do not step into river/brush. Practice by pausing 1–2s before every objective to check vision/jungle timers.\n\n2) Raise Kill Participation to 0.5+ via smart roams\n   - Action: On Ahri, shove and roam on every meaningful wave (post‑6 roam window). Ping and communicate: 'Roam now' or 'Don't take dragon' if you will be absent. Track your KP over next 20 games and aim to increase it from ~0.40 to >=0.50.\n\n3) Make Vision Purchases Non‑Negotiable\n   - Action: Buy a control ward by 6 minutes, place one before any objective attempt, and swap to Oracle/minor sweeper before contested objectives. Track 'control wards placed' stat each session.\n\n4) One Defensive Item Rule When Targeted\n   - Action: If you die to focus/picks 2+ games in a row, commit to a defensive purchase next game (QSS for CC, Stopwatch/Zhonya's for burst, GA for late survival). Test for 3 games and measure differences in deaths and KP.\n\n5) Wave Management Routine to Force Team Windows\n   - Action: Develop a 3-step lane routine: (1) Assess wave state at 40s intervals, (2) If you plan to roam/join objective, shove and leave a deep ward, (3) If you plan to split, ensure TP or escape path and that objective contesting is covered by teammates. This reduces lost tower pressure and creates clearer objective control moments.\n\nNo fluff: practice these five habits in block sessions of 10–20 games. Track two metrics: deaths near objectives and kill participation. Improving those by 20–30% will unlock immediate climbing potential.",
  "notes": ""
}