{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: \"The Safe Hypercarry (KDA-Saver)\". You consistently avoid deaths (avg KDA 4.16) and win a solid portion of your Tristana games, but you don't show the damage footprint or objective presence expected from a climbing AD carry. Your damage share (0.205) and kill participation (0.458) are below high-elo ADC baselines while your CS/min (7.12) sits under a typical diamond/master ADC baseline. That profile reads as a player who survives and cleans fights but rarely drives the game early or controls objectives.\n\n2. **The Root Cause**: Identity + Objective Discipline. You have an identity mismatch between champion choice and how you play them. You're playing hypercarry/power‑spike champs (Tristana, Jinx) but acting like a passive, low-engagement marksman: you miss plate timings, you don't convert lane advantage into dragon pressure, and you get picked before objectives. The data shows 100% of tracked timeline games had \"objective_gap\" and \"got_picked_before_objective\" tags — meaning the practical reason you lose is not mechanical in teamfights, it's that you aren't present, farmed, or positioned to contest and secure dragons/Baron. In short: safe play + low map control = losing towers and objectives you should influence.\n\n3. **The 'One Big Thing'**: Objective Security & Role Execution. If you fix how you prepare for and inhabit objective fights (vision responsibility, wave/TP resets, position so you’re not picked, faster spike timing), you will immediately convert more wins. Right now you’re often either not there, underfarmed, or dead when the team needs you — solve that and your already-decent mechanical baseline becomes climbable.",
  "champion_feedback": "**Champion-Specific Adjustments**.\n\nTristana (14 games — your main): Stop treating Tristana like a pure late-game insurance policy. Her strength is flexible: plates + fast resets turn into dragon control and early tower pressure. Identity shift: play Tristana as a plates-first skirmisher in the first 12 minutes — use E + R to secure trades and tower plates, reset to buy components, then force dragon fights. Targets:\n- Lane: focus plate timings and tower trades (use W+E reset combos to secure plate gold).\n- Mid game: you must be alive and with vision for dragons — your job is DPS from safety, not roaming alone.\n- Late: position slightly back but practice proactive target priority; you should be the cleanup carry.\n\nJinx (1 game): Play her as a patient farmer. If you choose Jinx, accept the responsibility to hit 9–10 CS/min and let the front line start fights. Only pick Jinx when you can safely reach spikes; avoid Jinx into heavy pick comps unless vision and peel are guaranteed.\n\nDraven (1 game): Draven is a lane bully that demands jungle attention or lane dominance. Only pick him as an intentional snowball pick and commit to aggressive plate/dragon windows — do not treat Draven like Tristana (no passive resets).\n\nSyndra / Ahri (mid picks): These are pick/roam champs. If you play them in bot (or flex), shift identity: look for roams to mid/jungle rather than trying to scale. Prioritize roaming for vision and early objective fights when you have lane priority.\n\nLee Sin (one odd game top): Out-of-role plays here; Lee Sin’s macro goals are to force picks and secure early objectives. If you play him jungle, adopt an aggressive objective-first plan — otherwise avoid it.\n\nOverarching: stick to 1–2 archetype identities per queue. For you: primary = hypercarry marksman who proactively farms plates and secures objective windows; secondary = pick-oriented AP (Syndra/Ahri) only when you intend to create picks for dragons.",
  "itemization_tips": "**Build Efficiency**.\n\n- Tristana core: prefer a fast power spike. Typical path: BF -> Zeal/Essence -> Mythic (Kraken Slayer if you need consistent DPS vs tanks; Galeforce if you need mobility and assassination tools) -> Infinity Edge -> Rapid Firecannon / Runaan's per team comp. Avoid overly defensive first items when you need damage to secure objectives.\n\n- Rune choices: Tristana = Lethal Tempo vs extended fights or Press the Attack vs short burst trades; Fleet is suboptimal for your objective-focused style. On-season specifics: take Triumph/Legend/Last Stand and adaptive secondary (domination for sudden picks or resolve vs heavy poke).\n\n- Situational: QSS if you are repeatedly getting picked/locked (you have \"got_picked_before_objective\" flagged). Buy a Control Ward every back and prioritize oracle/vision removal before dragon/Baron.\n\n- Common static errors to avoid: 1) Building for lategame-only (full crit late) while not achieving the farm to reach it — instead take earlier spike items and aim to convert those into objective control. 2) Passing on Zeal items that let you threaten plates and solo dragons earlier. 3) Not buying vision items/wards — as a bot laner you are co-responsible for dragon-area vision.\n\n- Support coordination: call resets to buy Control Wards + place a sweeper before objective start. If your support doesn’t, commit to buying and placing at least one control before contest.",
  "goals": "**Top 5 Strategic Priorities**.\n\n1) Objective Prep Ritual (highest priority): Before every dragon/baron window, ensure: minion wave state is safe (push or freeze), you have a control ward placed in the approach, and you are alive/positioned. If any of these fails, do not commit. Practice this checklist every game — it fixes the \"picked before objective\" pattern.\n\n2) CS & Plate Targets (measurable): Raise CS/min from 7.12 -> ≥8.0 within 2 weeks by forcing plate plays and practicing last-hit timing. Weekly target: +0.3 CS/min improvements. Use wave management: get plates 1–2 then reset for components.\n\n3) Vision Responsibility: Buy a Control Ward every two recalls in the mid-game (10–18 minutes). Use Oracle/Sweeper when approaching objective area and ping enemies' likely flank paths. Track the support’s warding and fill gaps.\n\n4) Champion Discipline: Play Tristana as your primary 70% of games; only pick Jinx/Draven when the draft and support allow for safe scaling or snowballing, respectively. Avoid off-role or off-archetype picks unless you have a clear plan and backup (jungle help, vision).\n\n5) Death Prevention Before Objectives: Change decision rule from \"I can get a kill\" to \"I must not be the pick.\" If you get caught within 30s of a dragon/baron spawn, treat it as a loss for that objective and reset. Practice micro: keep flanks visible, maintain spacing from throwy engages, and play behind the front line 1–2 steps further than usual.\n\nNo fluff — do these five in order. Objective Prep + CS target will deliver the largest, fastest wins; vision and champion discipline will make your good KDA translate into carry-level damage share and climb."
}