{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: The Isolated Skirmisher. You play aggressive, duel-focused mids (Yone, Riven, Ahri, Syndra/Viktor) and perform fine in isolated fights (KDA 3.5, several strong champ winrates). But you operate too often as a lane/side threat rather than a coordinated objective force: damage share and CS are near high baseline, but your kill participation (0.40 vs baseline 0.65) and vision score are low. The data shows you either win when your solo fights succeed or lose when the team needs coordinated presence — you frequently aren’t in the objective fights, get picked before objectives, or overextend and die.\n\n2. **The Root Cause**: Macro discipline + map-awareness mismatch. The primary habit causing losses is an identity/macro mismatch: you pick and play champions that demand either coordinated teamplay (Viktor/Syndra/Ahri roams) or disciplined split pressure (Yone/Riven), but you default into solo skirmishes or lane isolation without the vision and rotations those playstyles require. That produces two recurring failures: (a) you are absent from 73% of losing games' teamfights/objectives (low KP), and (b) you get caught before objectives (insufficient vision checks, timing, and discipline). In short — good micro, poor objective presence and risky positioning.\n\n3. **The 'One Big Thing'**: Stop being a lane island — raise your in-game presence around objective windows. Concretely: before every dragon/baron window, ensure you have a control ward, a teammate pinged, and you are physically present or farming a wave that crashes into a turret while you rotate. If you can’t do that reliably, narrow your champion pool to picks that either force side-pressure safely (and then immediately join for objectives) or are explicitly built to roam and secure picks for the team. Improving KP + vision discipline will unlock your wins far more than marginal mechanical improvements.\n\n",
  "champion_feedback": "**Champion-Specific Adjustments**. Use these as identity shifts — what each champ must be for you in the team game.\n\n### Yone\nIdentity shift: From \"solo snowball duelist\" to \"conditional side pressure + timely objective joiner.\"\n- Lane: Focus on stable wave management. If you win lane, immediately shove and either threaten enemy bot/top to pull pressure or TP/roam for dragon windows. Don’t stay deep in enemy jungle looking for solo kills before a drake — that’s where you get picked.\n- Mid game: If ahead, split and force enemy to respond; if behind or even, shove one wave then join team for dragon/baron — your team needs your DPS to contest. Prioritize vision control around side bush before split pushing.\n- Late game: You’re a finisher — wait for frontline CC to be used and enter after the pick/engage. Avoid initiating objectives alone.\n- Rune/build notes: Conqueror/Lethal Tempo if going full skirmish, but consider earlier defensive (GA or Edge of Night / Sterak) once you have frequent deaths to picks.\n\n### Ahri\nIdentity shift: Roamer-first playstyle to increase KP.\n- Lane: Crush waves with QW then look to roam at 6/9/11. Your strongest win condition is creating numbers advantage and converting it into drake/tower pressure.\n- Mid game: Keep one control ward on your side of river. If a roam fails, don’t overextend into the jungle — return to lane or group for objective. Use charm to secure picks before dragon/baron, not as a lone all-in.\n- Late game: Play off vision — flank to pick off carries and immediately call for objective or replace into teamfight when picks land.\n- Rune/build notes: Electrocute or Dark Harvest if you want pick power; build Hextech Rocketbelt or Luden's depending on burst vs waveclear needs.\n\n### Riven\nIdentity shift: Side-lane skirmisher who converts leads into objective control.\n- Lane: Win or stabilize. If you get priority, shove and threaten enemy TP to pull pressure off drake. If you’re winning a side, ping and rotate to contest drake windows rather than dying farming deep.\n- Mid/Late: Your value is drawing pressure and creating windows. Communicate (pings / chat) that you need drake traded for your push or that you will join for Baron when you have priority.\n- Rune/build: Conqueror, Black Cleaver, Sterak; build defensive depending on being picked off.\n\n### Lissandra / Syndra / Viktor\nIdentity shift: Play these as objective controllers and pick-makers, not isolated bursters.\n- Lane: Prioritize safe farm and vision so you can use ult/W to lock a pick when the jungler or support starts a fight.\n- Mid game: Hold Control Wards and play around choke points. You should be the player anchoring front-to-back or creating picks for drake fights.\n- Late: Zone with Viktor/Lissandra and look to CC/zone rather than dive.\n- Rune/build: Viktor — prioritise rapid power spike (first hex core variant) and Banshee vs heavy pick comps; Syndra — Electrocute + early Rabadon's/Liandry when prolonged fights expected.\n\n### Akali / Leblanc / Zed\nIdentity shift: If you play assassins, your job is specific picks earlier — don't try to skirmish at neutral objectives. Win games by denying vision, creating picks, then immediately converting to objective or lane pressure.\n- If you can’t secure reliable picks because vision/communication is poor, drop these until you have a stable roaming pattern.\n\n",
  "itemization_tips": "**Build Efficiency**. Common static mistakes and quick fixes observed from your profile:\n\n- Overcommit to pure offense when you’re getting repeatedly picked. If deaths before objective are common, build one early defensive/cleanse option (Mercurial / QSS / Edge of Night / Banshee) depending on the primary threat. Small defensive item earlier is better than delayed full DPS.\n- Not prioritizing Control Wards or upgrading trinket before objective fights. Buy at least one Control Ward before dragons and two before Baron windows; put them in river entrances and tri-brush on your side.\n- Slow or inconsistent power spikes. For wave-control mids (Viktor/Syndra/Ahri), secure your first major item (Viktor hex core stage 2 / Luden's/Rocketbelt) before fighting for neutral objectives. If you frequently lose fights at 15–25 min, you’re contesting without your spike.\n- Runes mismatch vs team needs: When playing Ahri/Syndra vs roaming/pick comps use Electrocute/Dark Harvest to increase single-target kill potential for picks. For extended fights (Viktor/Yone), prefer Conqueror or Grasp-spectrum choices that synergize with sustained damage.\n- Mobility vs CC item balance: If you die to crowd control repeatedly, swap one offensive item for QSS/Hexdrinker/Banshee earlier rather than later.\n\n",
  "goals": "**Top 5 Strategic Priorities**. Ranked, concrete habits to fix the Root Cause — no fluff.\n\n1) Increase Kill Participation to >0.55 within 30 games: practice a 3-step roam checklist before every roam/dragon/baron window — (a) shove and freeze or back the wave to deny XP to the opponent, (b) place a Control Ward + ping teammates you are rotating, (c) physically show in river or lane 15–25s before objective. Track KP each session.\n\n2) Vision-before-objective rule: always have at least one Control Ward and blue trinket coverage on the side you’ll contest. If you cannot place both, do not contest alone — fall back or force the enemy to face-check.\n\n3) Two simple 'no‑go' rules to stop picks: (a) If you don’t have vision of both river entrances and enemy jungler is visible elsewhere, don’t commit to objective. (b) If enemy crowd-control itemization exists (hard engage) and you lack QSS/Banshee, don’t be primary engage target. Enforce these by muting tilt and following checklist.\n\n4) Narrow and specialize champion pool to 3 mid-choices with clear team roles: (a) Ahri — roamer/pick-maker, (b) Yone/Riven — side-pressure skirmisher (only play when you can reliably join objective windows), (c) Viktor/Syndra — teamfight/objective controller. Practice each role in focused blocks (e.g., 10 games Ahri block focused on roams and KP tracking).\n\n5) Phase-specific KP & Objective practice: In every game, set tiny phase goals: lane (min 85% of wave resets and 80+ CS by 10 if farming), mid (participate in 2+ objective fights or secure 1+ successful roam between 10–20), late (avoid first-in dives — wait for frontline or pick). After each loss, log one replay clip showing where you were absent for objective or where you were picked; review and note a single corrective action.\n\n"
}