{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: The Quiet Skirmisher — you are a mid-laner who puts up decent KDA and damage numbers overall (avg_kda 3.49, dmg_share ~24%) but plays too disconnected from objective fights and team tempo. You lean toward skirmish/duelist champs (Yone, Riven, Yone-heavy) and a reliable control/utility pick (Ahri, Syndra) when you want to stabilize. Your profile: relatively good individual mechanical output, solid CS, but low team involvement (avg_kp 0.403) and recurring macro mistakes around objectives.\n\n2. **The Root Cause**: Identity + Macro Discipline mismatch. You're toggling between two competing identities — a sidewave skirmisher who needs to pressure lanes and a roam-oriented pickmaker who should create picks for objectives — without committing macro decisions that convert those strengths into objective control. That manifests as: low kill participation, getting picked before objectives (90%+ in timeline-tagged games), poor flank/vision discipline, and frequently being absent for dragon/baron fights. In short: you win isolated fights but lose the objective game because you either aren't there, you walk into unscouted areas, or you take fights at the wrong time.\n\n3. **The 'One Big Thing'**: Stop being the best isolated damage dealer on your team and simultaneously the reason objective fights are lost. Convert your mechanical advantage into objective influence by forcing two habit changes: consistent vision clearance before objective windows, and committing to either side-pressure (push-and-split) or full-group objective timings — not neither. If you solve vision + timing, everything else (KP, towers, dragons, barons) improves fast.",
  "champion_feedback": "**Champion-Specific Adjustments**.\n\n### Yone\n- Identity shift: from \"solo skirmisher who looks for 1v1s\" to \"pressure engine + conditional teamfighter.\" Prioritize wave management: shove and threaten a sidewave or freeze and deny recall windows so enemy team must respond, creating objective windows for your team.\n- Lane / mid-game coaching: after level 6, push a full wave then look to roam to side lane or place a deep ward and reset — do not roam into unwarded jungle to contest dragons. If your team calls dragon, show on the flank and do not be first to facecheck.\n- Item/rune guidance: build at least one defensively-stacked option when games show frequent picks (Death's Dance / Sterak's / GA situational). Conqueror or Lethal Tempo is fine, but pick the rune that lets you sustain vs consistent engage.\n- Late-game: split or flank depending on vision. If side-split, ping and place deep vision; if grouping, play backline skirmisher and wait for key CC.\n\n### Ahri\n- Identity shift: double down on Ahri's best role for you — roam-to-objective creator. Ahri's roam potential is huge; use waveclear then look for picks that immediately turn into drake/tower plates.\n- Lane / mid-game coaching: post-6, shove then leave a single ranged minion to keep tower pressure while you roam. Prioritize clearing choke vision (control wards + sweep) before enabling your team to start dragons/barons.\n- Item/rune guidance: Ludens/Lich Bane path depending on burst vs sustained; always consider Zhonya when you anticipate being the target pre-objective. Take Absolute Focus + Manaflow if you want consistent roaming power.\n- Late-game: your value is picks and reliable burst — call targets and be the play-starter, but don't facecheck into fog for a solo charm attempt.\n\n### Syndra / Viktor (burst & battlemage pool)\n- Identity shift: play these purely as pick/zone mages. With Syndra, look for stun combos that instantly remove an objective defender — then use that window to place control wards and start the objective.\n- Lane / mid-game coaching: push, place a control ward in the tri-bush or river, then roam. Syndra should be the 'bring the point-man' into the objective rather than the guy who 1v1s a side lane and misses the fight.\n- Item/rune guidance: Syndra—Electrocute or Aery depending on matchup; Zhonyas often beats getting picked. Viktor—accelerate Hexcore to maintain lane control and waveclear so you can rotate to objectives.\n\n### Lissandra / Akali / Leblanc (assassin/utility backups)\n- Identity shift: use them only when you commit to roam/pick playstyle. If you pick an assassin and then sit in lane, you create a mismatch — either roam early or avoid these high-risk picks.\n- Lane / mid-game coaching: avoid solo dives before objectives; your greatest value is finding single targets away from the objective and converting that into objective control.\n\n### Riven (top/mid off-meta games)\n- Identity shift: Riven games show strong individual results when you can force side pressure. If you take Riven mid, commit to split/tower pressure and lane dominance, but be ready to TP or rotate to fights with vision covered.\n\n(Short version: narrow to a 2–3 champion core for mid — Ahri as your primary organized/vision/pick tool, Yone as your pressure/split tool, Syndra/Viktor as your scaling teamfight/pick tool. Play to each champion's objective role rather than forcing the opposite.)",
  "itemization_tips": "**Build Efficiency**. Pointed fixes based on patterns:\n\n- Defensive buys on duelists: Your Yone and other skirmisher losses include many \"picked before objective\" deaths. Against teams with crowd control or multi-target engage, prioritize at least one defensive item (Death's Dance or Sterak's) or buy Guardian Angel if you're repeatedly targeted late. This is not \"tilt\" — it's removing the single-point failure that costs the baron fight.\n\n- Zhonyas timing on mages: In several Ahri / Syndra losses that list \"got picked\" or lost Baron/dragon, Zhonya's timed purchases (instead of late buy) swing objective fights. If you're the player initiating with Charm/Scatter, buying Zhonya earlier allows you to be aggressive without being the first corpse.\n\n- Vision spending efficiency: Buy and place Control Wards per objective window. If the team is contesting dragon/baron, you should have 1 control ward and an Oracle/Red trinket active; if you don't, don't be the flank check. Convert 1-2 recalls into vision control — that beats an extra offensive item when objective control is the problem.\n\n- Runes/mode: For roamer-mage (Ahri, Syndra) prioritize runes that give you reliable roam pressure (Manaflow/Transcendence/Scorch or Sudden Impact/Electrocute depending on assassination vs pick style). For Yone, prioritize sustain/extended trades runes and prefer lifesteal/Conqueror if you plan to fight extended teamfights.\n\n- Stop 'all-in' glass-cannon builds when your team struggles to follow. If your games repeatedly end with you alone in the jungle dead before an objective, your build is costing the team more than it wins fights.",
  "goals": "**Top 5 Strategic Priorities**. Ranked, concrete habits to fix the Root Cause.\n\n1) Vision-before-objective rule (Daily habit): Never approach dragon/baron without clearing the two closest flanking wards and placing at least one control ward yourself. If you cannot safely clear vision, do not start/contest — ping and reset. (Metric: reduce 'got_picked_before_objective' tag by 50% in next 20 games.)\n\n2) Two-role commitment (Champion pool discipline): Narrow to 2 primary mid picks and 1 flex (Ahri + Yone + Syndra/Viktor). For each champion, predefine your objective-role: Ahri = pick-maker/roamer, Yone = side-pressure/splitter, Syndra/Viktor = zone/damage in fights. Stop picking assassins unless you commit to roaming. (Metric: keep kp on picks above 0.5 within 30 games.)\n\n3) Wave-timing -> Roam routine (Macro habit): After pushing a mid wave post-6, set a timer: 0s place a deep ward, 4–6s roam or recall, 6–12s be on the map assisting objective or applying side pressure. Practise this until it is automatic — it converts lane control into objective control. (Metric: increase kill participation and reduce 'lost a lot of tower pressure'.)\n\n4) Defensive purchase checklist (In-game decision rule): If you died in the previous objective contest or were the focus of engages 2+ times, buy one defensive item next back (Sterak/Death's Dance/GA/Zhonya as appropriate). This small change prevents repeat single-point failures. (Metric: deaths-per-objective contested drops by 30%.)\n\n5) Play-by-the-clock for objectives (Teamplay habit): Learn and call objective windows: take plates / shove mid by 10:30–11:30 as the first drake window approaches; if your team is grouped at 12:30–15:00, be there or force a side lane pressure that creates a 5v4 for the objective. In short: choose group or split, then execute the vision checklist before starting. (Metric: fewer games marked with \"lost dragon/baron control\".)\n\nStick to these five for your next 50 ranked games: vision discipline + commitment (pick-to-role) will flip your low KP and objective losses into wins much faster than micromechanical tinkering alone."
}