{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: \"The Solo-Momentum Diver\". You play like a high-impact assassin/diver (Diana) who reliably generates kills and high KDA but struggles to convert that personal pressure into objective control or team coordination. Your damage and CS are near high-elo baselines and your KDA is above baseline — you often look like one of the better players in losses — but you are frequently not involved in team objectives and you get picked around objective windows.\n\n2. **The Root Cause**: A macro-discipline and identity-mismatch problem. You are treating Diana like a solo-skirmisher who must find flashy picks, but you are not consistently using those picks to secure towers, dragons, or Baron. That shows up as low kill participation, frequent \"got picked before objective\" tags, and a large dragon gap. In short: you win small fights but lose the map. The behavioral pattern: you engage or path alone (or without vision/peel), win or get a few kills, then the team fails to convert vision/tower pressure or you overextend into objective setups without proper control. This becomes a repeatable leak opponents punish by trading objectives or collapsing when you commit.\n\n3. **The 'One Big Thing'**: Objective Discipline. Prioritize vision/timing and team commitment around dragon/Baron and tower windows over hunting individual picks unless the pick directly secures the objective. Make your dives and picks be the *tool* for converting map control, not the end goal.",
  "champion_feedback": "**Champion-Specific Adjustments**.\n\nDiana (JUNGLE) — Shift from \"solo assassin\" to \"objective-focused diver\":\n- Early game: adopt a slightly more funnelled clear that leaves you with HP/spell readiness to gank—clear into a 3–4 minute gank window rather than full-farm until level 6. Scout enemy jungle early to create pressure and deny drake control.\n- Mid game: when you get kills, immediately convert by forcing a tower, a dragon, or deep vision. If you can\u0019t secure an objective within ~20 seconds of the fight, back out and reset vision/cooldowns rather than chasing side-lane picks alone.\n- Late game: your role is flank/diver. Do not single-handedly start Baron or Dragon setups — go in after vision is cleared and after your frontline has engaged or created pressure. If you are the first into Baron pit, you are getting picked.\n- Playstyle shift: stop treating kills as an end. Every kill should be an objective signal.\n\nRammus (JUNGLE) — Use as a counter-pick and reset tool:\n- When your team lacks engage or needs peel, pick Rammus. Your job is to create a pick-and-convert macro: secure deep vision, flank on the squishy, and force reset/teamfight front-to-back.\n- Build/play to force immediate tower pressure after successful engages (you convert engages into objectives).\n\nLulu (UTILITY) — If forced into support:\n- Accept a strict enchanter identity: protect the hypercarry, prioritize vision around dragon/baron, and avoid roaming to mid alone unless your carry can immediately take turret/dragon.\n- Your impact is measured in objective survivability and carried CS uptime, not kills.\n\nKaisa (BOTTOM) — If you play AD as odd pick:\n- Be strict about CS until your core items. Your CS/min (4.48 in that game) is a clear blocker. Play safely to hit item spikes and avoid early-high-risk fights if your frontline cannot reliably peel.\n- Only play Kai'Sa when your team gives you protection/priority or when you can convincingly farm to 2–3 core items quickly.\n\nGeneral pool advice: Narrow to 2 reliable jungle identities: Diana (carry skirmisher who converts to objectives) and one reliable engage/tank (Rammus or a meta equivalent). If you can\u0019t coordinate dives into objectives consistently, temporarily favor the engage/tank pick to win through clearer macro.",
  "itemization_tips": "**Build Efficiency**.\n\n- Diana (Jungle) common errors: building pure solo-assassin items and overextending without defensive options. Make your core: an early AP jungle mythic that gives survivability/engage utility, followed by a defensive/utility slot (Zhonya\u0019s or Banshee\u0019s) when you are the primary diver. Choose Sorc Shoes vs AP/low-CC teams and Mercury\u0019s vs heavy CC.\n- Rune guidance (Diana): prefer burst/skirmish runes (Electrocute or Hail of Blades for faster all-ins; Conqueror is viable for extended fights) and a secondary tree that gives sustain/tenacity (Second Wind or Bone Plating if you die to pick attempts). If you are consistently getting picked before objectives, add Tenacity/defensive choices.\n- Rammus: Aftershock or Resolve keystone, early armor/HP items (Thornmail, Dead Man or Turbo Chemtank depending on engage style). Buy mobility/engage tools early to make your ganks meaningful.\n- Lulu: Prioritize utility items and vision (Shurelya\u0019s/Ardent/Cherish pieces depending on patch names), always buy an early Control Ward and use it proactively at drake timings.\n- Kai'Sa: Pragmatic buy: prioritize mythic + defensive choice if you\u0019re getting collapsed (e.g., Immortal Shieldbow vs raw lethality when opponents are diving you). Otherwise, focus on attack speed and lethality to reach spike.\n\nItemization habit: after a successful skirmish, evaluate: will a single offensive buy secure the objective, or do you need defensive buys/runes to survive the next engagement? Err on the side of staying alive and converting objectives.",
  "goals": "**Top 5 Strategic Priorities**.\n\n1) Objective-First Routine (Daily Practice): before every dragon/Baron attempt, run a 4-step checklist: (1) vision cleared (2) enemy sums/CC status known (3) your team is grouped (not solo) (4) your diver has an immediate follow-up plan. If any check fails, don't commit. Measure: reduce \"got_picked_before_objective\" tags from 86% to <40% in two weeks.\n\n2) Raise Kill Participation via Communication: ping and commit to coordinated ganks — if you get a kill, call for tower plate/tower/preset objective within 15–20s. Set a KPI: increase KP target from 0.507 to ≥0.65 over the next 20 games.\n\n3) Limit Champion Pool to Two Identities: play Diana OR an engage tank (Rammus) per series. This reduces identity confusion and forces clearer macro decisions. Winrate will be more consistent when your team knows what to expect.\n\n4) Vision Discipline: buy and place Control Wards proactively at every drake spawn and enemy jungle entrances 45–30s before objective. Assign roles in chat (you as jungler should place the first deep control ward or ensure someone does). KPI: reduce objective_gap (dragons lost) from -1.4 to ~0 in the next 20 games.\n\n5) Post-Kill Conversion Habit: after every multi-kill or successful gank, spend the next 12–20 seconds deciding between (A) tower pressure (if lane priority exists) or (B) immediate objective (drake if alive). If neither is available, reset and buy vision rather than chasing another solo kill. Track conversions: aim to convert ≥60% of successful ganks into objectives or towers.\n\nNo fluff — these five concrete habits directly attack the macro leak: use your kills to create map control, not highlight reels."
}