{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: The Reluctant Skirmisher.\nYou play high-variance, duel-focused champions (Yone, Riven, Jax) and also a good amount of roamer/poke mages (Ahri, Viktor, Syndra). Your stats show you can mechanically carry (KDA above baseline, near-Diamond CS and damage share on average), but you consistently under-index on map impact: low kill participation (0.399 vs 0.65 baseline), objective gaps (dragons/barons), and frequent tower loss. That pattern fits a player who wins isolated fights and lanes but fails to translate those wins into map pressure and team objectives.\n\n2. **The Root Cause**: Identity + Macro discipline mismatch.\nSymptom: Low kill participation and repeated objective/control deficits; frequent 'got picked before objective' and losing tower pressure. Root cause: you treat many games like 1v1 skirmishes (get farm/spikes, look for duels) without adopting the complementary macro habits needed for mid-lane impact: consistent wave management to create roam windows, vision control before objective plays, and conscious timing to join or force objective fights. Additionally, when you do try to affect the map you get caught — indicates either poor timing (showing on the map without vision/jungle info) or insufficient vision/communication before committing.\n\n3. **The 'One Big Thing'**: Increase proactive map presence around objectives. Concretely: raise kill participation by being on the map when objectives spawn — push, leave the wave correctly, place control wards and Oracle lens before dragon/baron, and only commit to objective fights when you have vision or backup. Fixing this one habit will simultaneously raise your tower pressure, dragon/baron control, and winrate more than marginal mechanical improvements.",
  "champion_feedback": "**Champion-Specific Adjustments**\n\n### Yone\nIdentity shift: stop treating Yone purely as an isolated outplay champ. Adopt a split + join role: farm to 2-item spike reliably, then use that threat to force opponents to respect side pressure and create windows for team objectives.\nLane: prioritize wave management (freeze or slow push) to create clear roam or safe recall windows. Avoid extended trades without vision — many losses show \"high deaths\" and \"got picked\".\nMid game: if you can't 1v1 safely, split and draw pressure instead of forcing fights in foggy areas. Swap to Conqueror/Press-the-Attack if you plan to fight extended skirmishes — Lethal Tempo makes some sense for DPS but is often the wrong tempo for map play.\nLate game: don't dive alone into objective fights. Wait for your team's engage or for enemy cooldowns. Use Q mobility to re-enter fights after enemy crowd control is burned.\nMechanical corrections: sharpen E timing as an escape tool, and always check jungle location before committing to extended sidelane pushes.\n\n### Ahri\nIdentity shift: play Ahri as a roaming playmaker rather than only as a laner. Your Ahri games show decent winrate and KDA — leverage that to secure dragons and towers.\nLane: push and roam on priority; use E for pick setups around river/control wards. If Malignance is core in your builds, use it situationally (vs heavy AP or burst) not by default.\nMid game: look for deep wards on enemy raptors/river brush to time roams. If bot side has priority, show and force numbers around dragon instead of solo hunting side lanes.\nLate game: use charm to peel for your backline or catch splitters — avoid chasing into fog without vision.\n\n### Riven\nIdentity shift: treat Riven games as side-pressure wins that force objectives rather than brute-forcing teamfights. Your Riven winrate is strong — double down on that but stop playing her as pure top-lane solo influence when your team needs mid-map presence.\nLane: aggressive, but convert leads into towers and map priority. Buy and use Oracle/Control when preparing to contest scuttle/dragon.\nMid/Late: you often lose Baron/dragon control in losses — coordinate with your jungler; your split pressure should coincide with objective windows so the enemy can't freely take Baron.\n\n### Viktor\nIdentity shift: Viktor is your safe-scaling control mage. Prioritize hitting your mid-game power spike and zoning in teamfights rather than roaming constantly.\nLane: focus on rapid hex-core or equivalent upgrade (force early item completion), and use waveclear to deny roams.\nMid game: control zones in contests; Viktor wants to fight around objectives where he can stack his damage.\nLate game: kite back; you have high winrate on Viktor when you can reach scaling.\n\n### Lissandra & Syndra\nLissandra: stop playing her as high-risk roam if you can't guarantee backup. Use her CC to set up picks around vision, and play safer early to avoid being repeatedly caught before objectives.\nSyndra: your Syndra results are very good in small sample — play her as lane bully and teamfight assassin. If you choose First Strike, ensure you’re using it to buy short trades; otherwise swap to Electrocute/Comet for more reliable one-shot windows.\n\nGeneral note: prioritize 2–3 champions (one skirmisher Yone/Riven, one roaming assassin/roamer Ahri, one control scaler Viktor/Syndra). Narrowing the pool will accelerate the macro corrections above.",
  "itemization_tips": "**Build Efficiency**\n\n- Yone builds: You're buying Immortal Shieldbow + Blade of the Ruined King frequently. That mix gives sustain but delays or fragments your critical 2-item spike (IE + PD/Statikk). If your goal is to win duels and 1v1s, plan a clear pivot: vs squishy comps prioritize crit spike (Infinity Edge + Phantom Dancer/Statikk). Vs heavy tanks or when you need sustain to survive poke, keep Shieldbow/BOTRK, but only as a deliberate anti-tank adaptation. In short: pick a win condition pre-10 minutes and build toward it.\n\n- Ahri: Malignance appears as your core buy. It's fine vs heavy AP/CC comps, but don’t auto-buy it every game. If you want roams and snowball, prioritize Lich Bane/Rabadon as early third item for burst. If you die a lot before item spikes, keep Malignance earlier.\n\n- Viktor: your Viktor purchases show safe starts (Doran's / Farsight). Make Hex-core progression (augment) your priority; delay luxury items until your zone control is active. Rabadon/Lich Bane are fine as finishing items once augmentation is completed.\n\n- Rune mismatches to correct:\n  - Yone: Lethal Tempo in 90% of games is unusual for the skirmisher playstyle you should be embracing. Test Conqueror or Press-the-Attack for more consistent sustained dueling and better 1v1 scaling.\n  - Syndra: First Strike (62%) can work but Electrocute or Arcane Comet typically produce more reliable kill pressure in lane — consider swapping depending on whether you want raw burst or poke.\n  - Ahri/Akali/Leblanc: Electrocute is a strong default on assassin/roam builds; elect to run it when your roaming/one-shot plan is primary.\n\n- Vision & item timing:\n  - Buy Oracle Lens or Control Ward consistently before dragon and Baron contests. Your data shows many 'got picked before objective' tags; the quickest remedy is buying/using vision tools proactively (not after you’re already committed).\n  - If you plan to force side pressure (Riven/Yone), ensure you have 2 control wards near the flank and an Oracle by 18–20 minutes when objectives become contestable.\n\n- Boots choices: stick with movement/attack-speed boots that complement your champion role (Berserker's on Yone is fine if you commit to attack-speed crit play; switch to defensive boots when you’re getting consistently dove/picked).\n\nSmall rule: always decide your build path pre-8 minutes based on enemy comp: do you need tank shred (BOTRK/Executioner-like items), burst (Rabadon/Lich Bane), or sustain (Shieldbow)? Make that choice early and don't mix components that push you in three directions.",
  "goals": "**Top 5 Strategic Priorities**\n\n1) Increase Kill Participation to 0.55+ by focusing roams and wave discipline.\n   - Habit: every time you push a full wave into enemy turret, look to roam or place a deep ward and leave within 6–10 seconds. Logically: wave pushed = opportunity to join objective/side-lane play.\n\n2) Zero picks before objectives (reduce 'got picked' rate by 80%).\n   - Habit: before dragon/baron starts, always have at least 1 control ward and either your jungler or one other laner visible. If you can't secure vision, do not facecheck — call time and reset.\n\n3) Standardize 2 build/rune templates per champion and stick to them for 10–20 games.\n   - Example: Yone (Crit/Conqueror template) and Yone (Sustain/Shieldbow vs tanks). Ahri (Electrocute roam template) and Ahri (safety Malignance template). This reduces indecision and improves consistency.\n\n4) Improve wave management and CS baseline to 7.5+.\n   - Habit: set a simple CS checkpoint every 5 minutes (e.g., 35 at 5:00, 70 at 10:00) and track misses. If you fall behind, stop roaming and freeze until you hit the catch-up numbers.\n\n5) Vision-first objective routine.\n   - Habit checklist before contesting an objective: lane priority or lane pushed; 2 control wards placed; enemy jungler pinged/seen in last 10s; Oracle on if you are the main objective engager. If any of these are missing, delay or force a different play (side pressure or pick instead of objective).\n\nImplement these in order: focus on 1 and 2 first (they will produce the largest immediate winrate uplift). Track progress across the next 50 ranked games and iterate builds/runes once your macro baseline stabilizes."
}