{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: \"The Side‑Lane Anchor (Lane Kingdom)\". You reliably outfarm and outduel in lane, keep damage share and KDA at or above high‑level baselines, and win most matchups you play — especially on split‑push/juggernaut picks (Tryndamere, Illaoi, MonkeyKing, Garen). Your strengths are lane dominance, wave control and 1v1 threat; your weakness is converting that lane advantage into team objective control and coordinated fights.\n\n2. **The Root Cause**: You're playing like a solo lane sovereign — you prioritize lane pressure and individual scaling over synchronized objective timing and team positioning. That creates two predictable failure modes: (A) you either stay isolated and let your team lose neutral objectives (dragons/barons) because you weren't present or didn't force a trade, or (B) you overextend side pressure and get caught before objectives (\"picked before objective\"). The data supports this: below‑average kill participation (0.401 vs 0.55 baseline), repeated dragon/baron gaps, and timeline tags of \"got_picked_before_objective.\" In short — good mechanical/laning identity, poor objective coordination and timing discipline.\n\n3. **The 'One Big Thing'**: Stop treating lane pressure as an end; treat it as leverage to secure neutral objectives. Concretely — convert side‑lane dominance into timely map presence: roam or TP for dragons/barons, clear/deny vision before objectives, and refuse to overextend without vision or team windows. If you fix this single macro habit, your already strong lane metrics will translate into consistent wins rather than individually strong losses.\n",
  "champion_feedback": "**Champion-Specific Adjustments**.\n\n### Tryndamere\nIdentity shift: Keep split‑push identity, but make your split-push purposeful: push to threaten towers only when your team has priority on the opposite side or when an objective timer is approaching. Always have TP ready and a recall window so you can join for dragon/baron skirmishes (or threaten to at least draw a collapse).\n- Playbook: Push a wave, shove onto plate phase, then recall and TP to Dragon/Baron if it spawns within 30s. If you can't TP, shove and back to buy control wards and base for a proper recall window.\n- Runes/items: Lethal Tempo or Conqueror; maintain lifesteal (Kraken/Infi + Phantom) + Sterak's/Ghostblade vs heavy AD. Consider early QSS/GA if you keep getting picked.\n\n### K'Sante\nIdentity shift: Be the objective anchor. K'Sante should trade some solo lane greed for presence — he wins teamfights and zones objectives when played as a pivot.\n- Playbook: Take early control ward and push to shove, then path to objective to front and zone enemy team. Use ultimate proactively to deny Baron/Dragon pit engages.\n- Runes/items: Grasp/Sett‑style tank build (Black Cleaver if team needs shred) + early armor/mr appropriate to enemy carries.\n\n### Illaoi\nIdentity shift: Double down on side‑lane pressure but prioritize forcing picks or splitting with vision denial rather than blindly 5v5ing where you can be kited.\n- Playbook: If you’re going to split, place deep vision and watch Baron/Dragon windows; TP into fights only when you have a flank or numbers advantage. Avoid committing into 5v5 without CC chain.\n- Runes/items: Grasp/Conqueror, Sterak's/Black Cleaver, Sterak + Spirit Visage vs heavy AP.\n\n### Riven / Irelia / MonkeyKing (skirmishers)\nIdentity shift: Convert skirmish wins into objective control. On champions that thrive in short fights, your goal is early roams and creating numbers advantages around the first dragon and Rift Herald.\n- Playbook: After a winning trade, shove and either roam mid or secure vision around the next objective. If you get a kill, ping and immediately look to help take vision/control rather than soloing further tower plates.\n- Runes/items: Conqueror, Black Cleaver, Death's Dance or Sterak's. If your team lacks engage, build some early HP/armor to be a front‑line during objective fights.\n\n### Garen / Mordekaiser / Sett (juggernauts)\nIdentity shift: You're a raid boss in side lanes — your role is drawing pressure and then denying enemy objective plays. When the enemy commits resources to stop you, your team should be taking objectives.\n- Playbook: Track enemy TP cooldowns. If the enemy teleports to stop your push, call for your team to use that window to secure a neutral. If enemy has TP, be ready to disengage and join for objective instead of dying for a plate.\n",
  "itemization_tips": "**Build Efficiency**. Pointed recommendations based on pattern analysis:\n- Vision economy: Carry 2 control wards every game and buy Oracle/Control timing before every major objective (45–60s before dragon/baron). Many losses came from getting picked — that's often from lacking sweep/control wards.\n- Adaptivity over cookie‑cut: On split-pushers (Trynd/Illaoi), players often overcommit damage items. Add one defensive or utility item (Sterak's, GA, QSS) when enemy has reliable picks/CC or when you are consistently dying before objectives.\n- Boots & defensive choices: If you are getting picked before objectives, prefer Mercury's or Plated Steelcaps earlier depending on CC/AD threats. Buying Tabis into heavy AA comps or Mercs into CC can stop being the pickable target.\n- Anti‑heal and anti‑kite: If objectives are lost to sustained fights, adapt (Mortal Reminder/Thornmail vs heavy sustain, Death's Dance/Sterak vs burst). For champs who need to stick (Illaoi/Sett), buy Tenacity only when it preserves your objective presence.\n- Runes: Match rune to macro role — splitters: Conqueror/Lethal Tempo + Triumph/Coup de Grace; teamfight anchors: Grasp/Aftershock; skirmishers: Conqueror + Presence of Mind or Tenacity when getting picked.\n",
  "goals": "**Top 5 Strategic Priorities**. Ranked, concrete, measurable habits to fix the Root Cause. No fluff.\n1) Objective Presence Checklist (most critical): Before every neutral spawn (Dragon/Baron), run a 3‑step checklist: (A) Do I have TP up? (B) Do I have at least one control ward and sweep? (C) Can I reach the objective in <20s from my current position? If any answer is no, stop split‑pushing and recall/rotate. Goal: be physically present or one TP away for 90% of dragon/baron windows this quarter.\n2) Vision & Sweep Routine: Carry 2 control wards, buy Oracle/Control 60s before major objectives, clear enemy vision in the pit before committing. Goal: place or clear at least 2 vision tools around each rift objective in every game.\n3) Kill Participation Target: Intentionally join at least 2 team fights/contests per game (dragons count). Use a simple metric: every time dragon spawns, either be within 20s of it or have created a map threat that forces an enemy to respond. Goal: raise KP from 0.40 toward 0.55 baseline in the next 20 games.\n4) No‑Solo‑Objective Rule: Never fight for a neutral objective alone without vision or a nearby ally. If you want to take plates, ensure you have a 30s recall window to join objective after shoving. Goal: reduce \"picked before objective\" tags to zero in your next 10 losses (track occurrences).\n5) CS & Wave‑management Drill: Maintain or exceed 7.5 CS/min by practicing controlled freezes and quick shove‑recall cycles in custom games: practice getting to 80 cs by 10 minutes on your main champions and rehearse the shove+recall that leaves you TP‑ready at common dragon windows. Goal: +0.3 CS/min within 2 weeks.\n\nImplement these in order: objective presence & vision first, then KP and CS drills. If you hit #1 and #2, your existing lane strengths will convert into consistent team wins rather than lone‑good performances.\n"
}