{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: \"The Solo-Spike Specialist\". You tilt between two identities: a duel-first skirmisher (Yone/Riven/Jax) and a pick/roam mage (Ahri/Syndra/Viktor). Your numbers show a player who farms well and gets power spikes (CS ~7/min, KDA above baseline) but rarely translates that into team impact — low kill participation (0.399), recurring objective losses (dragon/baron/towers), and frequent ‘picked before objectives’ moments. In short: you win lanes or get items, but you don't consistently turn that into team objectives or coordinated fights.\n\n2. **The Root Cause**: Role-identity mismatch + macro neglect. You treat many games like isolated skirmishes: you focus on 1v1/duel windows and mechanical play instead of intentionally converting lane priority into objective control. That combination creates repeated, predictable losses: you either miss roams and teamfights (low KP) or you overextend and get caught before objectives (picks). Low vision (vis score ~23) and poor objective checklist habits amplify this — you either arrive late to dragon/baron or you arrive outnumbered and without vision. Mechanically you can carry, but your macro habits (when to leave lane, where to put wards, when to group) are the bottleneck.\n\n3. **The 'One Big Thing'**: Increase intentional team-impact per priority window. Concretely: whenever you win or hold lane priority, convert it into a measurable objective action (ward + roam + secure dragon/tower or force enemy reset) instead of only seeking solo kills or extending side pressure. Making that conversion habitual will eliminate the majority of your losses tied to objectives and low KP.\n",
  "champion_feedback": "### Yone\nWhy you picked him: duelist who wants side pressure and 2-item spikes. The shift you must make: stop treating Yone as a solo win condition and treat him as a tempo engine. Lane: freeze or slow-push to create safe roam windows; do not shove blindly into river without a ward. Mid game: when you hit 2-item, look to either flank for a teamfight or push a side wave and immediately path to contest dragon or herald — always bring a control ward or ask support to prep vision. Late game: your teamfighting should be controlled — target backline only when a frontline engage/peel exists. If you die first, your team loses tower/dragon trade potential.\n\n### Ahri\nWhy you picked her: ideal roam/pickmaker. The identity shift: be the map-maker rather than the lane-soloist. Lane: shove to create roam windows and shove back after making plays. Mid game: use R + charm to create picks around vision edges; prioritize helping mid-jungle axis on dragon trades. Buy a control ward before you go for an objective; your pick should open the objective, not be a lead into it. Late game: stay the pick/peeler — don’t solo flank into enemy vision.\n\n### Riven (and general melee skirmishers)\nWhy you picked them: split pressure and strong side-lane carry. Identity shift: if you’re splitting, you must create pressure that forces enemies to respond (towers taken or jungle pressure), or else join teamfights on call. Lane: maintain wave discipline so you can TP/roam with priority. Mid game: if team needs you at drake/baron, freeze a wave and path with TP or shove two waves then group. Don’t keep trying to win solo trades while objective windows open elsewhere.\n\n### Viktor / Syndra / Lissandra (control/burst mages)\nWhy you picked them: waveclear and teamfight control. Identity shift: these champions should be your objective guarantees — strong waveclear and zone control let your team take dragons/baron safely. Lane: prioritize pushing to relieve pressure. Mid game: sit as the zoning tool for objectives — control the choke, force enemy engages into your zone, or create picks with Lissandra/Syndra. Buy Zhonya/Hourglass or more frontline-focused defensive options if you’re getting picked before objectives.\n\n### Assassins (LeBlanc / Akali / Zed / Kassadin)\nWhy you picked them: execute priority targets and snowball. Identity shift: only play them when you can convert early picks into towers or dragons — otherwise you become a kill-only score that doesn’t enable objectives. If you roam for picks, ensure a follow-up: ward the dragon pit and communicate with jungle/AD carry before committing.\n\n### General pool advice\nSimplify to a 3–4 champion pool that shares macro goals: pick either (A) roam/pick mages (Ahri, Syndra, Viktor) to be the team's objective initiator or (B) side-lane duelists (Yone, Riven) to be a split pressure / flank carry. Don’t queue with both mindsets in the same session. Training blocks: run 5-games focused on Ahri+Syndra (map control practice) and 5-games on Yone+Riven (wave management and objective split pressure).",
  "itemization_tips": "**Build Efficiency**. Pointed corrections observed from your profile and losses:\n\n- Defensive items are underused on champs that need to survive objective windows. For mages (Lissandra, Viktor, Syndra) you often want one defensive timing (Zhonya's/Hourglass or Banshee) before full offensive stacking. This prevents being the \"picked before objective\" casualty.\n\n- Skirmisher builds (Yone/Riven): you appear to favor pure offense; add a single survivability item (Sterak/GA/Death's Dance) as item 3–4 to turn your solo kills into sustained objective pressure. Dying first on a flank repeatedly costs Baron/Drake more than the DPS you gain.\n\n- Waveclear vs single-target: if you play control mages to secure objectives, prioritize waveclear items (e.g., ability haste/area scaling, early mana/spellblade equivalents on Viktor) so you can shove and rotate. On Syndra/Ahri, don’t over-prioritize single-target lethality itemization when your role is to create picks and rotate.\n\n- Rune alignment with macro role: when playing Ahri/Syndra, pick rune setups that favor quick roams and burst picks (short cooldown burst/phase rush or electrocute for picks). For Yone/Riven go press-the-advantage runes (Conqueror/resolve hybrids) that reward sustained fights and survivability. Avoid runes that heavily scale only for late-game if you intend to influence early dragon fights.\n\n- Trinket and control-ward habit: clear anti-pattern — you frequently lose objective vision. Buy and place at least one control ward before each contested dragon or Baron attempt. Use Sweeper before group commits.\n\nSmall checklist to apply midgame: before any contested dragon/baron, confirm: (1) you have a control ward or your support has one, (2) enemy jungler position known, (3) you have at least one summoner on primary engages, (4) your team is positioned to follow a pick. If any fail, do NOT force contest.\n",
  "goals": "**Top 5 Strategic Priorities**. A ranked list of 5 concrete, actionable habits to fix the Root Cause. No fluff.\n\n1) Convert lane priority into a concrete objective action every game. Rule: when you have priority for >10s, either (A) shove two waves and roam to mid/jungle to pressure dragon/herald, or (B) take plates/control wards on a side tower. Track this in-game: goal = 3 \"priority-conversions\" per game.\n\n2) Kill participation target & checklist. Aim KP >= 0.55 within 20–30 minutes. Before joining an objective or fight, run a 4-second checklist: vision present, enemy jungler tracked, teammates in range, your summoners available. If checklist fails, delay or reset.\n\n3) Vision-first habit for objectives. Place at least 1 control ward and use sweeper before starting dragon/baron. Increase avg vision score by 30% over next 20 games. Make a habit: buy a control ward every back between minutes 8–20 if you plan to fight.\n\n4) Wave management drills (daily warmup). Spend 15 minutes in custom/smurf practicing: slow push, freeze, and shove-to-roam on your main 2 champions. In ranked, before leaving lane for any roam or side pressure ensure wave state is one of: crash into enemy tower, slow push away from you, or safely frozen.\n\n5) Simplify pool + role commitment. Play blocks of 5–7 games focused on either (A) roam/pick mages (Ahri/Syndra/Viktor) OR (B) side-split duelists (Yone/Riven). After each block review 2 replays for objective conversions and picks-before-objectives. If you keep mixing identities in the same session, your macro will stay inconsistent.\n\nExecute these five habits in order: vision + checklist (3) and conversion (1) are immediate; wave management (4) supports conversions; KP target (2) is the KPI to track; pool simplification (5) reduces cognitive switching and accelerates adoption.\n"
}