{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: \"The Duelist with Tunnel Vision.\" You are a mid-lane skirmisher who can win isolated fights and farm reasonably well (CS/min ~7) but underutilizes that strength for team-level impact. Your damage share and CS are near high-baseline, KDA is above baseline, but your kill participation (~40%) is far below where it needs to be for consistent wins. You often play champs that want to create side-pressure (Yone, Riven) or picks (Ahri, Syndra, Viktor) but your map/vision/rotation behaviour leaves the team short on objective fights and tower pressure.\n\n2. **The Root Cause**: Identity mismatch + macro discipline. You repeatedly take a micro-first approach (win lane/duel) without converting that advantage into map control, objective security, or coordinated fights. That shows up as low kill participation, frequent loss of tower/objective pressure, and getting picked before objectives. In short: you either (a) stay on your lane fighting when team fights/objectives are happening elsewhere, or (b) rotate but without vision/timing and get caught. This is a habits + decision-timing problem, not a pure mechanical ceiling.\n\n3. **The 'One Big Thing'**: Turn your solo-win potential into team leverage by forcing meaningful roams and objective pressure with vision-first timing. Concretely: every time you shove a wave (or reach a full minion reset), have a plan — roam to make a play that secures a dragon/tower/vision or help your jungler force an objective — and never attempt a roam/contest without basic objective vision and a teammate near the objective.\n",
  "champion_feedback": "**Champion-Specific Adjustments**. Use '### ChampionName' headers for each group. Focus on specific identity shifts.\n\n### Yone\n- Identity shift: from \"I duel and split\" to \"I split-to-create-objective-windows.\" Shove one wave, then either freeze to deny enemy mid roam or roam with intent (river vision + one body for dragon). Don't solo-dive for plate kills without vision — your deaths are frequently timing errors before objectives.\n- Play patterns: farm to 2-item spike, then look to flank or join fights once vision is established. If you're ahead topically, convert side pressure into tower plates or a secured dragon; prioritize fast Herald/dragon plays with your team.\n\n### Ahri\n- Identity shift: from roam-for-kills to roam-for-objectives & vision denial. Ahri already has the numbers to impact games (good KDA and KP relative to your pool) — make your roams count by sweeping enemy wards and taking a control ward or helping set up dragon picks.\n- Play patterns: push wave once, then look mid->side roam or river control. In teamfights, play pick-first and avoid overextending to chase kills that leave objective exposure.\n\n### Viktor / Syndra (control/burst mids)\n- Identity shift: scale and zone to control objectives rather than hunting isolated skirmishes. Viktor especially should prioritize safe scaling to his waveclear power spike — then use zoning to contest Baron/Dragon and force fights where your DPS matters.\n- Play patterns: hold mid priority to place vision and control the river before objectives. Use Ult/zone to prevent picks on your team; for Syndra, punish overextensions and translate pick into tower pressure.\n\n### Lissandra\n- Identity shift: use your strong teamfight toolkit defensively and as a pick tool around objectives. Your losses indicate you either overcommit or fail to convert CC into objective control.\n- Play patterns: prioritize flanking angles with control wards and R to secure or stall Baron/Dragon fights; don't use R to start a solo engage without front-line backup.\n\n### Assassins (Akali, Zed, LeBlanc)\n- Identity shift: play conditional roams — look to finish off isolated targets that directly lead to Dragon/Herald/tower, not roam for free kills. Your games show picks-before-objective problems — don't be the pick that hands the enemy objective.\n- Play patterns: take side-lane or jungle roam only when enemy vision is cleared or you have reliable info on enemy location.\n\nChampion pool recommendation: consolidate to 3 mid identities you commit to in ranked sessions: (1) Yone for skirmish/split games, (2) Ahri for roaming/pick games, (3) Viktor or Syndra for controlled teamfight and objective zoning. That reduces identity mismatch and makes your macro decisions repeatable.\n",
  "itemization_tips": "**Build Efficiency**. Point out static build errors or rune mistakes seen in the data.\n\n- Defensive buys: your losses often include getting picked before objectives. When the enemy has strong burst/CC, buy one defensive item earlier (Seeker's Armguard -> Zhonya's on AP matchups or Plated Steelcaps/Mercs vs heavy AD/CC). A single percent of effective HP often turns a death into a fight-winning contribution.\n- Vision items: prioritize Control Wards and early Oracle/Lens checks before objective timers. If you are the primary roamer (Ahri/LeBlanc), buy at least one control ward by 8–10 min and a sweeper for objective windows.\n- Rune choices (general): align runes to role identity. Yone = Conqueror/Resolve hybrid for sustained duels; Ahri = Electrocute or Dark Harvest for pick power; Viktor/Syndra = Aery/Comet for poke & waveclear. If you struggle to impact fights, prefer runes that increase your teamfight zoning (Comet/Aery) over purely single-target burst.\n- Item timing: Viktor — prioritize Hexcore upgrade and the upgraded ability spike before forcing fights; Ahri/assassins — delay aggressive items if you’re the only threat and buy survivability or utility if your team lacks frontline.\n- Stop buying full glass-cannon against heavy pick compositions. One defensive component (Zhonya's/Edge of Night/Spirit Visage/Banshee) drastically reduces 'got picked before objective' occurrences.\n",
  "goals": "**Top 5 Strategic Priorities**. A ranked list of 5 concrete, actionable habits to fix the Root Cause. No fluff.\n\n1) Kill Participation Checklist (Daily habit)\n   - After shoving a wave twice or hitting a reset, ask: \"Will my roam secure a dragon/tower/vision or force 1+ enemy summoners?\" If yes, roam; if no, freeze/hold mid. Track KP increases — target +10% in the next 50 games.\n\n2) Vision-First Objective Rule\n   - Before any Dragon/Baron contest you attempt: you or a teammate must have a control ward in a primary pit approach and enemy vision cleared from the pit (sweepers). If not met, do not engage or contest alone. Make placing/clearing one Control Ward a non-negotiable.\n\n3) One-Item Defensive Check\n   - When enemies have 2+ one-shot tools (assassin/AP burst or heavy CC), add one defensive item before contesting major objectives. If you die once before Baron/Dragon, treat it as a failed rule and adjust builds next game.\n\n4) Narrow Your Pool & Session Goal\n   - Play only 2–3 champions per queue session (Yone + Ahri + Viktor/Syndra). For each session set 1 concrete macro goal (e.g., \"Convert 3 side-waves into towers or dragons\"). Micro mechanics get you kills; macro goals get you wins.\n\n5) Coordinate Timing, Not Just Chasing Kills\n   - Use pings and short chat calls: 5s before dragon: \"ward?\" \"clear?\" \"I can roam in 10\". If your team is unwilling to commit, do not force a solo contest — instead create split pressure in side lane while pressuring vision. Record one replay per week of a lost objective and identify whether the cause was vision, people, or timing; then apply one corrective action next game.\n"
}