{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: \"The Skirmisher Who Forgets the Map\". You're primarily a Yone-style mid laner — you win 1v1s and produce respectable personal stats (KDA above baseline) but your game impact is inconsistent. Your damage share and CS are near high-elo baselines, but your kill participation (~0.40) and objective influence are low. That mix reads as a mechanically competent duelist who often plays into isolated fights or solo XP rather than reliably converting lane advantage into team objectives.\n\n2. **The Root Cause**: You lose games not from pure mechanical failure but from a consistent macro and positional habit: you either (A) get picked before objectives or (B) stay isolated and fail to be present/alive for dragons/barons and tower defense. The data shows \"got_picked_before_objective\" at ~88% of tracked objective-gap games and frequent \"lost tower pressure\" + \"lost Baron/dragon control.\" In short — decision framing and discipline around objectives. Symptom examples and causes:\n   - High count of \"lost tower pressure\" + low KP: you push or take isolated fights instead of translating pressure into grouped objective control (Wave management + Team-focus mismatch).\n   - \"Got picked before objective\": poor flank vision and positioning, entering objective windows without coordinating alive/wards with team (Macro discipline & presence).\n   - When you do die, it’s often before objectives or during overextensions as a skirmisher — those deaths are higher cost than isolated lane deaths because they hand objectives and map control away.\n\n3. **The 'One Big Thing'**: Be alive and present for objectives. Rewire your mid-lane win condition from \"win trades/duels\" to \"convert lane pressure into objective control and map safety.\" If you prioritize being alive and grouped for enemy dragon/baron windows (and avoid being the pick), your winrate will rise quickly even if your raw KDA or mechanical execution stays the same.\n",
  "champion_feedback": "**Champion-Specific Adjustments**.\n\nYone (30 games) — Stop playing like a solo split-carry every mid game.\n- Identity shift: from \"I need to force 1v1s\" to \"I need to hit my 2-item spike and be a team fight presence or flank — not a lone flanker who gets caught.\"\n- Lane: focus wave control (slow push to deny roams when you're missing or to create side pressure). Prioritize getting to 2 items safely instead of chasing kills.\n- Mid game: ping/confirm jungle presence before committing to side fights; if the team is grouping for Dragon/Baron, clear one wave then join the team — do not base/TP back late.\n- Late game: play the flank or follow hard-CC — enter after a key CC is used, not as the first target. Buy one defensive/spellblock/survivability option when you find yourself repeatedly getting collapsed on (Shieldbow / Sterak's / QSS depending on threat).\n\nAhri (10 games) — You have high personal KDA but low wins. That implies safe roams/picks that don't convert to objectives.\n- Identity shift: stop treating Ahri as a pure roaming assassin; convert picks into objectives. If you land a pick, immediately convert it into turret plates, dragon or baron vision control.\n- Lane: clear waves fast enough to roam, but time roams with your jungler. Avoid solo roams that can't force an objective.\n- Item/rune: Electrocute for pick-focused games; Comet or Presence of Mind if you need lane shove and scaling.\n\nViktor / Syndra (small sample) — Your winrate is high; make them part of a \"team objective\" sub-pool.\n- Identity shift: play them as zone-control/slow-scaling answers when you want to guarantee teamfight presence. Prioritize sieging and control wards; your natural strengths counteract your Yone weaknesses (teamfight zoning over isolated skirmishes).\n\nRiven (top) / Zed / Lissandra / Thresh — Use sparingly or as a counterpick; don't treat them as core to fixing the objective problem. If you fall back to Riven or Zed, be explicit pre-game about split vs grouping roles to avoid mixed identity in mid/late game.\n",
  "itemization_tips": "**Build Efficiency**.\n\nGeneral patterns to correct:\n- You are getting picked before objectives. Build and itemize to survive being collapsed on during objective attempts. For melee skirmishers like Yone that get dove often, consider one early defensive spike (Immortal Shieldbow or Sterak's) on games where enemy CC/burst is high. If your death pattern is CC-chain > delete, prioritize QSS early (2nd or 3rd item) instead of a pure DPS greed build.\n- If playing Ahri or Syndra and your team lacks frontline, prefer items that help you influence the objective fight from range (Morello / Horizon Focus / Zhonya's). Zhonya's timing is critical — use it to win stall fights at baron.\n- Boots: switch to Mercs vs heavy CC/pick compositions. If you're getting stunned/ulted in fights you're expected to survive, Mercs lose you fewer objective fights than extra DPS.\n- Vision buys: spend 2 Control Wards per game minimum and swap an early Trinket to Sweeper before every major objective. The macro tags show you are getting caught flanking — corrective spend on vision is cheaper than dying and losing Baron.\n\nRunes:\n- Yone: Conqueror for extended teamfights; if you prefer quicker burst in low-KP games, Press The Attack is fine but be prepared to need survivability. Take Triumph + Legend: Alacrity + Last Stand and consider Presence of Mind only if you overextend and need mana/sustain to stay in fights.\n- Ahri/Syndra: Electrocute for pick/burst; take Ultimate Hunter if you want more R uptime for roams and picks. Take Magical Footwear or Biscuit based on lane matchups.\n\nMicro tip: when your damage share is below team baseline often, it can be a byproduct of not being present in teamfights. The fix is not always \"more damage items\" but simply being in the fight and alive — items that increase survivability can increase effective damage output over the course of objective windows.\n",
  "goals": "**Top 5 Strategic Priorities**.\n\n1) Objective Presence Checklist (Immediate habit): before every dragon/baron, confirm 3 things: you are alive, your jungle/another teammate is visible, and at least 2 vision items/Control Wards cover flanks. If any item fails, do not facecheck; delay or clear vision first. (Goal: reduce \"picked before objective\" by 60%.)\n\n2) Kill Participation Target (Metric): raise KP from ~0.40 to 0.55. How: stop AFK-split pushing during enemy objective windows; ping and move to contest or at minimum be in the river/tri-brush with vision. Track KP each session and review 1 loss where KP < 0.35.\n\n3) Wave Management Routine (Skill): every mid wave state, practice one of three actions: slow push -> roam; shove -> reset + vision for objective; freeze -> deny enemy roam. Execute the appropriate action 10 times in customs or normals before implementing in ranked.\n\n4) Death Audit (Mindset drill): after each game, tag up to 2 deaths that directly led to objective loss. Ask \"was this kill necessary?\" If answer is no, write the alternative action. Do this for 10 games; your pattern will show whether you die because of aggression, poor vision, or mechanical misplay.\n\n5) Champion Pool Simplification (Strategic): narrow to a 2+1 pool for climbing: Yone (primary), a reliable control mage (Viktor or Syndra) for when you want grouped teamfights, and Ahri as a situational pick for pick-play. Play Yone only when you commit to the \"be alive for objectives\" plan; otherwise pick your control mage to force team-focused macro.\n\nNo fluff: adopt the single rule of thumb — \"If an enemy objective is alive, prioritize being present and alive for it over a risky solo fight.\" Everything else becomes easier once that is internalized.\n"
}