{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: \"The Isolated Skirmisher.\" You favor duel/split-focused mid/top champions (Yone, Riven, Jax, occasional assassins) and your numbers show it: above-baseline KDA and near-baseline damage/CS, but chronically low kill participation (0.403 vs 0.65 baseline) and repeated objective-control losses. That combination reads as a player who wins small fights or matches individually but doesn’t consistently translate those wins into team objectives. You either push for side/solo pressure or look for 1v1s and then the game loses cohesion around dragons/baron and towers.\n\n2. **The Root Cause**: A persistent identity + macro discipline mismatch. You default to a skirmisher/solo-impact mindset but do not adapt to the team’s objective windows or protect vision before objectives. The data shows you get picked before objectives nearly every timeline (got_picked_before_objective ~91%) and lose dragon/baron/tower control frequently. In short: you create isolated advantages but don’t (a) communicate/coordinate those advantages into team objective control, or (b) change build/behavior when the game demands group play — so leads evaporate or you are caught alone before objectives.\n\n3. **The 'One Big Thing'**: Convert individual pressure into team objectives. Measured, practical target: raise kill participation to ~0.55+ by (a) prioritizing roams/assists on power windows (post-push roams on Ahri/Syndra), (b) buying and using vision aggressively before major objectives, and (c) shrinking the times you are alone near objectives. Fixing this single habit will flip the major loss vectors (dragon/baron/towers/picks) that account for most losses.\n",
  "champion_feedback": "### Ahri\n- Identity shift: Move from \"solo burst to carry a lane\" to \"primary roamer and pick-maker.\" Ahri’s best leverage for your profile is to turn lane pressure into cross-map skirmishes. After pushing 2 waves, look to roam (prioritize mid-priority wards and enemy jungler track).\n- Lane: Push, chunk, and shove to reset lane at ~minute 6-12 windows and look for side-lane influence. Use Q/W to shove safely then roam.\n- Mid game: Before starting an objective, be the vision leader — place a control ward and sweep the approach you plan to cross. Use your charm as a pick tool to start fights, not to solo kill and die.\n- Late game: Play peel/assassin hybrid—focus one-shot priority only when your team has engaged or your frontline is present.\n\n### Syndra / Viktor / LeBlanc (control/burst mages)\n- Identity shift: Choose one identity per game: teamfight zone control (Viktor/Syndra) OR roam pick assassin (LeBlanc). Don’t try to do both.\n- Lane: Syndra/Viktor should farm safely and scale — prioritize waveclear and vision. LeBlanc should push and snowball lanes with roams.\n- Mid/Late: Syndra/Viktor: group with team for objectives; play space-control and force enemies out of objective circles. LeBlanc: catch isolated targets but never facecheck objective corridors.\n\n### Yone / Riven / Jax (skirmishers)\n- Identity shift: Commit fully to either split-push power-spike or teamfight survival. Right now you’re often in-between: you take skirmishes but then are caught before objectives.\n- Lane: If you pick Yone/Riven, set an explicit plan: \"split until team contests dragon/baron\" OR \"group at 20+ with defensive item (Sterak/Zhonya/Death's Dance) and control wards.\" If splitting, ping your intent and leave a deep control ward for the team at the objective.\n- Mid game: Never solo contest vision near objectives. If you go for flank or pick, ensure one ally follows or you have a flanking control ward and timer on enemy cooldowns.\n\n### Lissandra / Akali / Zed (assassin/engage mages)\n- Identity shift: Use assassins for timely picks before objective fights, not to chase kills on side lanes. Given your \"picked before objective\" trend, assassins must be reserved for coordinated engagements where your team can cash in on the pick.\n- Build/runes: On Lissandra, prefer more utility/peel items (Zhonya) when games trend objective-heavy.\n",
  "itemization_tips": "**Build Efficiency**. Pointed patterns and corrections:\n- Defensive vs offensive split decision: You consistently pick duel-heavy champs but frequently die before/around objectives. When your champion will be the primary engage/skirmisher (Yone, Riven), adapt one defensive mid-game item (Sterak/Death's Dance/Zhonya) on a second recall if opponents have heavy pick/CC/assassins. That small durability change reduces \"picked before objective\" losses.\n- Boots selection: Use Mobility Boots on Ahri/LeBlanc for roam windows; use Mercury/Tabi when enemy CC/AD threats are high. Swap early if enemy comp demands it.\n- Vision economy: Buy a control ward every back when you have priority or before objectives. If you skip control wards to save gold, you’re directly enabling the biggest loss vector (picks before objective).\n- Rune alignment: For Ahri/LeBlanc/Syndra, pick keystones that support your role that game. If you commit to roaming/playmaking, prefer electrocute/press-the-attack variants for reliable burst on picks; if you must scale for teamfights, lean into arcane/comet (or variants) that increase sustained teamfight DPS.\n- Item sequencing: Against backline threats, prioritize one survivability item before full carry completes. Against squishy comps where you can safely one-shot, lane aggression is fine but still ensure vision before objective calls.\n",
  "goals": "**Top 5 Strategic Priorities**. Ranked, concrete habits to fix the Root Cause.\n1. Kill Participation Target: Raise KP from 0.403 to 0.55+ in the next 50 games. How: after pushing two waves mid, roam or join teammates for next skirmish/objective (explicit micro-habit: within 8–12 seconds of pushing a wave you should be moving to lane/ward/objective or pinging intent).\n2. No-Objective Solo Rule: Never be alone within 1200 units of an objective (dragon/baron) without a control ward and at least one teammate or visible enemy cooldowns. Make it a hard mental rule — the majority of your \"picked before objective\" losses break this.\n3. Vision Financial Plan: Buy one control ward every back when you have wave control. Also buy/upgrade sweeper or control ward pre-dragon (2 minutes before spawn) and clear the enemy approach path. Objective control failures drop sharply when mid starts owning vision.\n4. Champion-Role Commitment: Reduce playstyle ambiguity by tightening pool to 3 mid identities: (A) Roamer/Pick (Ahri, LeBlanc), (B) Teamfight Control (Syndra, Viktor), (C) Split/Skirmish only when coordinated (Yone/Riven) with a declared game plan before min 10. If you pick a champ from (C), ping/announce split intent and buy a defensive item by first back.\n5. Short Post-Game Ritual: After every loss, log one sentence: \"Why did we lose objective X?\" and list one actionable change for next game (vision placement, grouping earlier, buy item X). This cements learning and reduces repeat macro mistakes.\n"
}