{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: The 'Isolation Skirmisher (Objective-Blind Duelist)'. You play a mix of skirmish-first mids (Yone, Riven, Jax) and pick/roam mages (Ahri, Syndra, Leblanc). Your KDA and damage numbers show you can win lanes and dish out damage — especially on Ahri and Syndra — but your kill participation (0.40) and vision score (23) are low for a mid who should be central to objectives. You show strong solo carry potential in lane or short skirmishes, but you frequently aren’t converting that pressure into team-objective control or presence in teamfights.\n\n2. **The Root Cause**: A consistent identity + macro mismatch and poor objective-discipline. Symptoms (low KP, repeated \"lost tower pressure\", \"fell behind in dragon control\", \"got picked before objectives\") point to the same underlying habit: you prioritize isolated skirmishes, side pressure, or solo play over two things that win games — timely vision setup and deliberate objective presence. That leads to: getting caught before objectives, not being on the map for dragon/baron fights, giving up tower plates and map control, and sometimes overcommitting in unfavorable fights (hence the spikes of high deaths on Yone). In short: you can create local advantages, but you don't reliably translate them into map/objective advantage because your macro routine (vision, timing, TP/roam coordination, and teamfight posture) is inconsistent.\n\n3. **The 'One Big Thing'**: Fix your objective routine and vision discipline. Before every major objective window (dragon, rift herald, baron, tower dive attempt) you must have: wave state managed, at least one control ward in the area, an oracle/vision plan, and an explicit decision (commit or back) communicated with pings. Making this a reflex will immediately raise your KP, prevent the \"picked before objective\" losses, and convert your lane pressure into wins.\n",
  "champion_feedback": "### Ahri / Leblanc / Syndra (burst/pick mages)\n- Identity shift: From \"make flashy solo plays\" to \"create picks that lead into objectives.\" Your Ahri results are your best — she fits a playstyle that both roams and helps objective control if timed. Lean into that: shove, immediately place a control ward, and roam only when the bot/jungle can follow or when dragon is impossible within 30s.\n- Runes/items: Electrocute or Dark Harvest for kill pressure; take Magical Footwear + Cosmic Insight for roaming windows, and always carry a Stopwatch/Zhonya's in games where you get picked before objectives. Build path: early boot+control ward -> damage (Lich Bane/Hextech/Luden variant) -> Zhonya's vs. pick-threat teams -> Morello/Shadowflame situationally.\n- Lane -> Mid -> Late: In lane, use Q/W to keep wave in a position where you can shove level 6 and immediately look for side roam. Mid-game, stay around neutral objectives — if the jungler is on the objective, your job is flank/zone and control vision; late-game, play as the pick threat that forces opponents to facecheck into your vision or waste time clearing it.\n\n### Yone / Riven / Jax (skirmishers / duelists)\n- Identity shift: These champs want 1) cleanly won sidelane pressure and 2) controlled re-entry to objectives. Stop trying to force teamfights as primary; your value is split-push or skirmish follow-up. If you commit to dueling and take a lead, use it to take a tower or force a response that creates an objective window for your team.\n- Runes/items: Yone/Jax — Conqueror/Pressing keystone and prioritise a lifesteal/defensive mid-game spike if you're dying (early Death's Dance/Bloodthirster or a defensive Mythic/GA). Riven — standard lethality/AD spike but pick a defensive mid-game item (Sterak's/GA) when games trend toward being decided by picks.\n- Lane -> Mid -> Late: In lane, focus wave control: either slow push to draw jungle attention or freeze to deny enemy jungle access. Before you roam or attempt to dive, place/ask for vision and ensure the wave is in a favorable state so you don't lose tower plates for free. In mid/late: do not contest Baron/Dragon alone — your jobs are flank, zone, or split depending on comp.\n\n### Viktor / Lissandra (scaling & zone control)\n- Identity shift: Viktor is your scaling control tool — treat him as the \"safe objective control\" pick. Lissandra should be the engage-safety pick: use her to force picks and then convert to dragon/baron. When you play these champs, be the team's zone controller at objectives instead of trying to 1v1.\n- Runes/items: Viktor — standard AP scaling path and Morello/Shadowflame/GA; Lissandra — Zhonya's early and CDR/armor depending on enemy comp.\n- Phase coaching: Play for mid-game roams that secure dragons; you’re stronger in grouped objective fights than isolated skirmishes.\n\n### Akali / Zed / Kassadin (assassins)\n- Identity shift: These are high-risk picks given your \"picked-before-objective\" pattern. Only play them when you have a strict plan to split-shove or one-shot a key target AND your team can convert map pressure into objectives. If you continue, force more pre-objective vision and frequently pick Stopwatch.\n\n### General cross-champion habits\n- Ward routine: Buy and place a control ward at 6, 12, and 18 minutes in river/side-bush; swap to Oracle when you begin to contest dragons/baron. Ping your ward timing and objective windows.\n- Communication: If you shove and roam, ping your intention and mark where you want the jungler to be for dragon. If you see enemy mid roaming, call it — many losses are because objectives were taken while you were not present.",
  "itemization_tips": "**Build Efficiency**. Observed likely static mistakes (inferred from low vision, frequent picks, and high deaths):\n\n- Vision items neglect: Your vis score (23.1) and repeated \"got picked before objective\" indicate you underbuy control wards and delay Oracle use. Make 1 control ward per back a minimum and buy Oracle when prepping multi-man objectives.\n\n- Defensive timeout: Frequent high-death games on duelists indicate missing early defensive options. If you die repeatedly on Yone/Riven, adapt by adding one defensive mid-game item (GA/Stopwatch/Sterak's/Death's Dance) before finishing full offensive build.\n\n- Stopwatch/Zhonya's discipline: On mobile mages/picks (Ahri, Lissandra, Viktor), a single Stopwatch purchase per game reduces \"picked before objective\" losses dramatically. If you get targeted pre-objective, that item equalizes many fights.\n\n- Rune-fit to role: You pick champions that either need to roam safely or require split-sustain. If you're playing skirmishers a lot, prefer runes that give sustain/survivability (Conqueror/Second Wind if you're constantly shoved/harassed) or mobility (Phase Rush) when roaming is your priority. For control mages choose keystones that let you guarantee kills or influence fights (Electrocute/Dark Harvest for picks, Aery/Arcane for consistent poke if you want safer macro).\n\n- Plate/timing itemization: When you have lane priority, buy boots + control ward and look to rotate to side lanes to take plates before dragon windows. Don't reach for expensive final items when your team is about to contest an objective—buy a control ward + sweeper instead.\n",
  "goals": "**Top 5 Strategic Priorities**. Ranked, concrete, actionable habits to fix the Root Cause. No fluff.\n\n1) Objective-Vision Routine (Daily drill): Before every dragon/baron/push, ensure: a) your wave state is favorable (shoved or frozen depending on plan), b) at least one control ward in the river/tri-bush, c) either you or your jungler has Oracle. If any of those are missing, back off and fix vision—do not contest.\n\n2) Kill Participation by Wave Management (Practice task): For every game, execute this: 3 times per game push a full wave under enemy tower or slow-push a wave and then immediately roam to create an objective or assist in a gank. Track KP after each game — aim to +0.1 KP within two weeks.\n\n3) 'No-Objective Alone' Rule (Hard rule): Never approach or contest a dragon/baron alone. If you are not within 10s travel time of your team to the objective when the enemy team is starting it, do not facecheck or overextend; instead, shove and rotate with vision.\n\n4) One Defensive Item / Stopwatch Threshold (Item rule): If you die more than twice in the early-mid game (first 20 minutes) on a given champion, immediately change your next build path to include a defensive/mid-game survivability item or Stopwatch/Zhonya's. This prevents repeat cycle of being picked and feeding objective control.\n\n5) Champion Pool Consolidation & Replay Habit (Weekly): Lock to 2–3 core champions that align with objective-play for a block of 12 games (e.g., Ahri + Viktor + one skirmisher like Yone but only as a split-push pick). After each block, review 3 losses and tag: were you present for objectives? Were you warded? Correct one repeatable mistake each week (vision placement timing, roam timing, or back/timing errors).\n\nExecute these five in order; the biggest jump comes from making vision + objective routine automatic. That will immediately raise KP, reduce \"picked before objective\" losses, and let your lane pressure convert into towers and dragons — which is the exact lever missing from your play.\n"
}