{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: The 'Solo-Spike Duelist'. You primarily play skirmishers and assassins (Yone, Riven, Ahri, Viktor) who scale through 1v1/2v2 power spikes and side-lane pressure. Your KDA (3.4) and damage share (~24%) show you can produce when you're involved, but your kill participation (~40%) is low for a mid laner. That combination reads as a player who wins or loses by individual fights and farming power-spikes rather than by consistent team engagement and objective control. You often look for personal duels or safe farming windows instead of reliably translating mid-lane priority into team objectives.\n\n2. **The Root Cause ('Why')**: A mixed identity + macro discipline gap. You default to a duel/split identity (farm, take side skirmishes, play around your spike) but you do not consistently convert that pressure into objective control or coordinated teamfights. The data shows repeated patterns: very high incidence of 'low kill participation', 'lost tower pressure', 'fell behind in dragon control' and 'picked before objectives'. That points to three linked habits: (A) inconsistent roaming/grouping timing (you either stay solo or arrive late), (B) poor vision/clear habits around objectives (you or team getting picked, Oracle/wards underused), and (C) unclear win-condition selection mid-game (split vs group). Mechanically you can fight, but mentally and procedurally you aren't prioritizing the short checklist every mid laner must run before an objective (wave state, vision, position, flank control). When games require coordinated dragon/baron plays, you are frequently absent or gone too early and get caught.\n\n3. **The 'One Big Thing'**: Increase your effective kill participation around objectives by converting lane priority into grouped objective pressure. In practice: every time a neutral objective is available you must run a short 4-step checklist (wave state handled, vision placed/cleared, enemy key flankers tracked, timing to commit). Fixing that single process will simultaneously raise your KP, reduce picks-before-objectives, and stop the repeated tower/dragon/baron losses that make your individual performance irrelevant.",
  "champion_feedback": "**Champion-Specific Adjustments**\n\n### Yone\nLane: Play for controlled priority rather than all-ins pre-power spike. If you shove, shove fully and then move to secure vision or look for side pressure — don’t recall into a blind river. Mid game: you are strongest when you can split-shove while still being able to join for dragons/barons; practice fast shove + pathing to join objective within 15–20s. Late game: avoid initiating alone into fog of war; your teamfight value is follow-up AoE; wait for CC or frontline to engage. Identity shift: from solo-duelist to 'pressure anchor' — create space but be present for timed objectives.\n\n### Ahri\nLane: Your winrate and KDA imply good pick potential. Push windows to roam — but only when you either have vision or minion advantage to make the roam safe. Mid game: use picks to secure dragon priority; if you land charm, back it up with vision and a ward sweep before objective starts. Late game: be the playmaker — don't chase a fight that splits the team. Identity shift: from raw assassin to objective-creating roamer.\n\n### Riven (played mostly top/side)\nLane: Riven wants tempo. Translate side pressure into objective control: after you force recalls or get plates, immediately path mid to help force vision or join dragon if needed. Mid/Late: Riven is a teamfight skirmisher—seek flanks with vision rather than 1v1s that leave your team numerically down at objectives. Mechanical correction: reset combos to avoid overcommit into enemy jungle when dragon is spawning.\n\n### Viktor\nLane: Your small sample shows high winrate but short games. Prioritize safe scale: complete your upgrade as early as possible to assert zone control. Mid game: Viktor should be the zone denial at dragon/baron — position backline and deny entry rather than roam aimlessly. Identity shift: treat Viktor as a 'team zoning scaler' — your value is controlling objective spaces.\n\n### Lissandra\nLane: You die often on this pick — tighten roams and only engage when you have reliable flank vision or follow-up. Mid game: use R/W to lock a target and force fights only when you have vision control. Late: your CC is prime for picking a carry; practice waiting behind frontliners and engaging at a known flank.\n\nGeneral coaching for similar picks: choose one of two roles per game and commit early: (A) split-pressure duelist (Yone/Riven/Jax) who will take plates and then path to the objective within a fixed time budget; or (B) objective-zone mage (Viktor/Ahri/Lissandra) who remains in teamfights to control space. Flip-flopping mid-game is the main failure mode.",
  "itemization_tips": "**Build Efficiency**\n\n- Yone: I see frequent Lifesteal/Shieldbow + BOTRK items. Those are fine for solo duel sustainability, but they encourage extended fights and solo-split behavior. If you want to be an objective-presence mid-game, swap one solo-duel item (BOTRK or Shieldbow) for faster grouping power (e.g., earlier crit spike or mobility defensive choice) depending on matchup. Also increase intentional Oracle/Control Ward buys before objectives; the data shows 'picked before objective' — investing in vision trumps a marginal damage spike.\n\n- Ahri: High use of Malignance suggests a defensive tilt. That's fine versus AP/CC heavy comps, but if you're the primary playmaker, prioritize items that let you re-engage safely (movement/ability haste) and always keep 1 control ward and 1 sweep item before dragon starts.\n\n- Viktor: Data shows you take Farsight and early Sorc shoes often. Make the Hex-core/upgrade priority non-negotiable because Viktor’s ability to control space around objectives depends on his upgraded waveclear and range. Don't skimp on the upgrade for an early situational luxury item.\n\n- Rune choices: notable quirks — Lethal Tempo on Yone (90%) is an aggressive extended-fight pick that reinforces split/duel identity; if you want to improve KP and teamfight consistency, experiment with Conqueror (teamfight uptime) on a controlled 10-game sample and track KP. Syndra's First Strike (62%) and Viktor's Summon Aery (100%) emphasize poke/value play; ensure runes align with the role you commit to that game (roam/kill or zone/defend). \n\n- Vision economy: across champions you under-invest in objective vision sequencing. Small, repeatable rule: before any dragon/baron start, you must have (A) one control ward in river/tribush, (B) enemy vision removed within 10s via sweep, and (C) one body (you or your tank) postured to deny a flank. Buy Oracle or Control early instead of a marginal mid-game damage item when your team lacks vision control.",
  "goals": "**Top 5 Strategic Priorities**\n\n1) Objective Checklist (Non-negotiable): Before every dragon/baron window perform a 4-step routine — wave state (shove/freeze), place/clear vision (control + sweep), track enemy threats (missing enemy jg/side), commit timing (countdown + ping). Make this procedural until it’s automatic.\n\n2) Raise Kill Participation to 55%+: Use simple triggers to join fights: enemy mid missing + your jungle/top pathing + minion wave state favorable. If those conditions are met, roam or path to the objective instead of solo-farming.\n\n3) Vision and Sweep Habit: Buy a Control Ward and a Sweeper/Oracle before the 10–12 minute dragon windows and before every Baron attempt. Train: spend 30s pre-objective on vision duty; losing vision is the single biggest cause of being picked.\n\n4) Wave Management Drill (CS Discipline): Target 7.5+ CS/min in practice (custom or normals). Drill: 10 games focusing only on hitting cspm baseline while simulating 2 safe roams per game. Hitting baseline prevents unnecessary early deficits and lets you convert pressure into plates/objectives.\n\n5) Death-Prevention Ruleset: Make 3 in-game micro-decisions mandatory: (A) If you are the only one showing on mid and enemy jungler is unknown, do not face-check river/brush alone; (B) If your team asks to start objective and you are dead or have no sweep, do not start; (C) If you are 10+ seconds from vision sweep and objective is starting in <15s, stall — better to lose a small timing window than to get picked and lose the objective.\n\nThese five priorities address the single largest blocker (low KP + objective losses) and give you procedural habits to convert your mechanical strengths into wins."
}