{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: \"The Lone Duelist (Low-KP Skirmisher)\". You play a lot of skirmish/split champions (Yone, Riven, some Akali) and a few pick/roam mages (Ahri, Syndra). Your KDA is fine overall and your damage share sits near the high baseline, but your kill participation (0.40 vs baseline 0.65) is low. That pattern — good isolated stats but low team involvement — shows you're a player who wins personal fights and farms well, but often isn't present or effective in objective fights and team engages.\n\n2. **The Root Cause**: \"Macro discipline + positioning mismatch.\" The losses are overwhelmingly correlated with being absent or dead around objectives: low KP, getting picked before objectives (0.91 timeline rate), falling behind in dragon control and losing towers/Baron. The symptom (dying / not participating / low objective control) is caused by two linked habits: (A) repeatedly playing side-skirmish or overextended windows without vision or team readiness, and (B) not adapting champion or build/role to the game's objective rhythm (you either try to split for tempo but don't create usable pressure, or you stay mid and miss the team fight). This creates predictable deaths before or during dragon/baron and hands objective control to the enemy.\n\n3. **The 'One Big Thing'**: Stop being \"the isolated kill\" — increase your objective presence and reduce pre-objective picks. Concretely: before every contested dragon/Baron window you must (a) have vision, (b) clear or slow-push your wave, and (c) be grouped (or in safe flank position) so you are participating in the objective fight rather than being picked off. Fixing this single behavior will raise your KP, reduce deaths, and directly flip the most common loss reasons (tower/objective control, picks, dragon/baron).",
  "champion_feedback": "**Champion-Specific Adjustments**. Use these identity shifts to align how you play each pick.\n\n### Yone\n- Identity shift: from \"I can 1v1 and side-split\" to \"I create pressure for objectives or join teamfights at spikes.\" Yone is a split/skirmish champion — either commit to true side-push plan with vision and timing or stop forcing long roams and instead slow-push then join team fights.\n- Laning: prioritize wave manipulation so you can join drake windows; don’t shove then disappear without vision. If you shove and roam, ping your side-lane and place deep vision.\n- Mid game: buy one defensive or utility item when you are getting picked (Sterak/Death's Dance/GA depending on the matchup). If you are ahead, use side-pressure to draw 2+ enemies and force map plays for your team.\n- Teamfights: wait for controlled CC windows to enter — don't E into fog-of-war without vision.\n\n### Ahri\n- Identity shift: lean into Ahri as your reliable team-influence tool. She has the highest KP and best winrate for you — make her your default “objective presence” champ.\n- Laning: use Ahri’s waveclear to roam efficiently. When you get a shove, go help bot/river and secure vision for dragons.\n- Mid/Late: play picks around vision; Ahri should be the one creating pick opportunities before dragons/baron.\n\n### Riven\n- Identity shift: treat Riven as a committed side-lane win condition (top) or a safe-committed mid carry if you can fully control wave states. You have good winrate on Riven but many of the losses are top-role related — keep Riven games limited to when you can reliably split and draw pressure.\n- Macro: if you pick Riven in mid, have a clear split-push to objective conversion plan (i.e., shove -> force TP from enemy or get turret). If you can't, pick a teamfighter instead.\n\n### Syndra / LeBlanc / Viktor / Lissandra\n- Identity shift: treat these as your objective-control/pick mages. Syndra and LeBlanc are exceptional for creating early snowballs and picks — use them to secure dragons by collapsing with jungle. Viktor and Lissandra are better for zone control in fights — play them safe and position to win the objective fight rather than chase isolated kills.\n\n### Akali / Zed / Kassadin\n- Identity shift: use these sparingly. They are high-risk, low-KP champs for you — only play them when you can commit to full roaming and your team understands your plan to convert roams into objective control.\n\nGeneral rule: If you pick a split/skirmish champ (Yone/Riven/Jax), you must either provide real map pressure (draw at least one enemy) or explicitly transition to side lane and force a map trade. If you pick a pick/roam mage (Ahri/Syndra/Lissandra/Viktor), your job is to be the eyes and the engage/disengage engine around dragons and Baron.",
  "itemization_tips": "**Build Efficiency**. Static errors and rune advice derived from loss patterns:\n- Defensive buys are underused relative to how often you get picked. When you see \"got_picked_before_objective\" frequently, add one defensive/utility item earlier: Stopwatch/Zhonya's on AP picks (Ahri/Syndra/Lissandra/Viktor) and Sterak/Death's Dance/GA on Yone/Riven when opponents are heavy on picks/assassins.\n- Control Ward economy: begin purchasing extra Control Wards (1–2) before every contested dragon. If you are the primary roamer/pick initiator (Ahri/Syndra), carry an extra control ward and an early Oracle or Sweeper (Pink + Oracle timing) to avoid getting caught.\n- Rune alignment: match runes to the game's macro role. If you want to roam and pick, use Electrocute (burst) or Dark Harvest for long roams on Ahri/LeBlanc. If your goal is sustained fights and survivability on skirmishers, run Conqueror/Grasp/Resolve combos on Yone/Riven and take Second Wind/Overgrowth situationally.\n- Wave/power spike builds: on Yone and Riven, respect 2-item spikes and avoid selling for pure lethality too early — a defensive item at the first death is usually better than chasing more damage.\n- Stop one-tricking items: if you’re losing towers and objectives by being picked, prioritize Vision items and defensive options over maximal DPS every game.\n\nSmall checklist before objective starts: have at least one Control Ward placed in a flank, clear the enemy’s forward vision with a sweeper, and ensure your team wave-state is favorable (or you have a plan to clear it).",
  "goals": "**Top 5 Strategic Priorities**. Ranked, measurable, actionable habits to fix the Root Cause.\n\n1) Increase Kill Participation (KP) by 20% in 30 games: commit to two specific roam behaviors per game — either (A) after wave shove, immediately roam river to assist jungle/bot for dragon windows, or (B) slow-push and join team by the dragon timer. Track KP and aim to move from ~0.40 to ~0.48 in the next 30 ranked games.\n\n2) Never enter an objective fight without vision/ally proximity: before any contested dragon/Baron, check the map and ensure you have either (a) a control ward behind the objective or (b) 2+ allied champions within 2000 units. If not, do not commit to the area. Make this a hard rule for the next 20 games; violations should be noted and reviewed.\n\n3) Wave management routine (pre-objective): implement a 3-step pre-objective routine — (1) slow-push or freeze mid-wave 45–30s before objective, (2) place 1 Control Ward and sweep for enemy vision, (3) join squad 10–5s before objective. Practice this until it becomes automatic; measure by reducing \"lost a lot of tower pressure\" occurrences by half in 30 games.\n\n4) Reduce pre-objective deaths (\"picked before objective\") by 60%: when the enemy has vision control or champions missing, fall back or take safer flanks. If you're playing Yone/Riven, buy one defensive item by the second sight of repeated picks. Track \"got_picked_before_objective\" tags — aim to reduce them from ~0.91 to <0.4 in the next 30 tracked games.\n\n5) Champion pool discipline: prioritize Ahri and Syndra as your climbing champions for the next 50 games; limit Yone to a maximum of 40% of your mid queue pool until your KP and positioning metrics improve. Play fewer high-variance assassins (Akali/Zed/Kassadin) unless you have time to review replays and commits to roaming/objective plans.\n\nNo fluff — these five habits target the exact chain that flips your most common loss reasons: visibility/positioning → deaths/picks → lost objectives/towers. Execute them consistently and review each game for the pre-objective routine adherence."
}