{
  "overview": "Markdown. **The Diagnosis**.\n\n1. **Your Archetype**: The Isolated Duelist.\n   - You primarily pick skirmish/duel champions (Yone, Riven, occasional Jax) and some burst mages (Ahri, Syndra). Your numbers show a player who often seeks 1v1/2v2 fights and side pressure: good CS/min near high-level baseline, above-baseline KDA overall, but low team involvement (avg KP 0.40 vs 0.65 baseline) and repeated objective losses. In short — you win or lose by your personal skirmishes rather than by controlling the map with your team.\n\n2. **The Root Cause**: A combination of identity mismatch + macro discipline failures.\n   - Symptom: Low kill participation, repeated \"got picked before objective,\" and objective/control gaps (dragon/baron/towers).\n   - Why: You habitually play like a duelist who tries to create advantages by winning side fights or roaming solo, but you (a) don’t time those fights to objective windows, (b) miss or neglect vision/engage coordination, and (c) get isolated and punished before team objectives. When you lane well individually you don’t translate that into objective control or teamfights; when you try to force skirmishes you often overextend and get picked. The result: good micro (1v1) but poor macro and poor team integration.\n\n3. **The 'One Big Thing'**: Stop playing isolated skirmishes that don't convert into objective control. Make your personal fights either (A) prepare and secure an objective (vision + teammates nearby) or (B) be a committed, timely side-lane that draws pressure and enables your team to take towers/dragons — not a solo threat that dies before fights start.\n",
  "champion_feedback": "Markdown. **Champion-Specific Adjustments**.\n\nYone (Primary):\n- Shift identity: Stop YOLOing into isolated skirmishes. Play Yone as a pressure engine that forces enemy response and creates windows for dragons/baron. \n- Lane: Prioritize wave-management (fast shove -> recall) or slow push to set up side pressure. If you push deep, place deep vision and ping before you commit. \n- Mid game: Use your ult for picks only when the enemy is out of vision or when your team is ready to follow. Avoid flanking into visionless objective fights. \n- Defensive tweaks: Consider one defensive/utility item earlier (Maw/Death's Dance/GA) when enemy has heavy instant-engage or AP burst.\n\nAhri (Most efficient pick):\n- Identity: Teamfight roamer and pick-maker — this fits your winrate and KP. Emphasize roaming to side lanes and creating picks before objective fights. \n- Lane: Use charm to secure deep wards/roams; shove and roam mid-7–10 minute windows. \n- Teamfights: Play as front-middle peel/pick tool rather than an isolated assassin.\n\nRiven (Top/side champion):\n- Identity: If you play Riven, treat her as a top/side split threat. Mid Riven games show mixed responsibility — consider moving Riven to top or account for team comp. \n- Macro: If you split, ensure your team can threaten objectives while you draw pressure. If your team cannot, avoid pure split; instead look for coordinated engages.\n\nSyndra / Leblanc / Viktor (Occasional picks):\n- Syndra & Leblanc: Use as pick tools — target roams and skirmishes where your team can collapse. Avoid blind flanks into objectives where you'll be the first death. \n- Viktor: Safe scaler — prioritize surviving to mid-game and controlling zones in teamfights; if you pick Viktor, play to protect neutral objectives (poke, control zones, don’t chase isolated fights).\n\nGeneral pool guidance:\n- Prioritize Ahri when you want reliable objective impact and higher KP. Yone is fine if you commit to macro adaptation (vision + timing). Deprioritize mid Akali/Akali-like risky solo assassins in solo queue unless you are confident your team will follow picks.\n",
  "itemization_tips": "Markdown. **Build Efficiency**.\n\n- Defensive options matter: On Yone and other melee skirmishers, you take a lot of damage and get picked. Shift one item slot earlier to defensive/utility (Death's Dance, Sterak's/GA, or Maw vs heavy AP) situationally instead of straight glass cannon. This reduces \"got picked before objective\" and high-death losses.\n\n- Stopwatch/Control: Buy a Stopwatch / Guardian Angel more often into games where your team contests Baron/Dragon heavily. Many losses come from getting picked at objectives — Stopwatch wins fights and denies picks.\n\n- Rune alignment: Play runes that match your macro intent. For Yone, Conqueror + Resolve secondary (second wind/overgrowth) when you need sustain and to survive skirmishes; for Ahri, Electrocute or Aery depending on playstyle (Electrocute if you want pick burst and roams). Avoid purely aggressive rune pages when your strength is forcing objectives.\n\n- Vision kit: Spend early gold on Control Wards and buy Sweeper consistently before major objective windows. Your losses show repeated lack of vision and being caught — the cheapest and highest-ROI item change is better warding and an earlier Oracle Lens upgrade.\n\n- Item spikes & timing: Be explicit about when you can force objectives — know your 1/2-item power spike (Yone 2-item, Ahri level 9–11 roam windows) and only force fights/objectives within those windows with appropriate vision.\n",
  "goals": "Markdown. **Top 5 Strategic Priorities**. A ranked list of 5 concrete, actionable habits to fix the Root Cause. No fluff.\n\n1) Objective-First Vision Routine (daily habit): Before every neutral objective (dragon/baron) commit to placing 2+ vision items: a Control Ward in the river/entry and an active Oracle lens on a timer. If you cannot get these, do not be the first engager — ping and wait for teammates.\n\n2) KPI: Raise Kill Participation to 0.55 within 6 weeks: Force it by either roaming with TP/roam windows (Ahri) or by grouping with team when the objective is live. Track KP each session and stop playing side fights unless you have 2+ teammates or vision to back you.\n\n3) Positional discipline at objectives (in-game checklist): 1) Are my wards covering flank? 2) Do I have ult/escape/stopwatch? 3) Is my team in position to follow? If any are no -> do not deep-flank. This will reduce \"got picked before objective\" events.\n\n4) Champion-pool constraint: For the next 50 ranked games, prioritize Ahri + 1 skirmisher (Yone) only. Goal: 70% of games on these two to stabilize decision patterns. Avoid swapping to off-meta/unstable picks mid-session (Akali, random top-lane champs in mid).\n\n5) 2-minute farming sprint & wave control: Add a 2–3 minute warmup in normals or the first 3 minutes of queue to practice hitting 7.5+ CS/min baseline. While farming, practice quick waveshoves and recall timing so your power spikes line up with objective windows (return to map with Control Ward and TP/roam readiness).\n\nExecute these five priorities in order: vision + objective discipline first, then KP & champion pool, then farming discipline. That sequence will convert your skirmishes into team wins instead of costly picks."
}