{
  "overview": "Markdown. **The Diagnosis**.\n\n1. **Your Archetype**: \"The Solo Skirmisher with a Macro Blindspot\".\n   - You gravitate to high-skill, duel-oriented champions (Yone, Riven, Akali, some assassins) and also play pick/burst mages (Ahri, Syndra, Viktor). Your raw KDA (3.49) and CS/min (6.99) are perfectly serviceable and your damage share sits just below the high baseline — this shows you can carry fights and farm, but you often do it in ways that leave the team lacking. High individual performance in wins, mixed responsibility in losses.\n\n2. **The Root Cause**: Identity mismatch + poor objective discipline.\n   - Symptom: Very low kill participation (0.403 vs baseline ~0.65) and repeated \"picked before objectives\" tags. You win more when you outplay in skirmishes, but you lose games because you aren’t consistently present, alive, or coordinated for towers/dragons/Baron. Practically: you either (A) play for solo kills and aren't on the objective, or (B) make aggressive plays that get you caught before objectives, costing map pressure and towers. That explains recurring tower/objective losses and the frequent note of being picked before objectives.\n   - Secondary driver: timing/vision habits. Games repeatedly show lost tower pressure/dragon control and picks before objectives — this is a discipline + information problem (you commit without reliable vision/timers or without confirming your team’s readiness).\n\n3. **The 'One Big Thing'**: Be present and alive for objectives. \n   - Reframe every mid-game decision through one question: \"Will this make me more likely to be on-time and alive for the next objective?\" If the answer is no, don’t take it. Your top lift will come from trading a few solo kills for consistent objective participation and improved vision/timing. Aim to raise KP from ~0.40 toward 0.60 and remove the \"picked before objective\" tag.",
  "champion_feedback": "Markdown. **Champion-Specific Adjustments**.\n\n### Yone\n- Identity shift: From lone brawler to controlled flank/skirmisher. You are strongest after 2 items; don’t force early solo dives without vision or map pressure.\n- Lane: Use early E-safety windows to avoid jungle ganks; shove only when you know enemy jungle position or you have side-lane priority.\n- Mid game: Prioritize being in the mid-to-side lane corridor when dragons spawn. If you want to split, communicate TP/pressure and ensure your team can force or delay the objective.\n- Late game: Look for cleaned up fights rather than initiating blind. If your team lacks engage, be prepared to play peel/secondary engage instead of flash-ins.\n- Runes/items: Conqueror/Press-the-Attack is fine, but add one defensive item earlier when you die a lot (Sterak’s or Death’s Dance / early lifesteal). QSS vs heavy CC comps.\n\n### Ahri\n- Identity shift: Your best value is converting lane pressure into team presence. You already have strong KDA — convert that into higher kill participation.\n- Lane: Shove and roam windows (post-6 charm) — ping roams and path through river/tri-brush to maximize KP.\n- Mid game: Look for picks around mid/side river; buy control wards and set vision before attempting roams so you aren’t counterpicked.\n- Late game: Kite and pick; avoid being the one caught on front lines. Consider Zhonya or defensive boots vs heavy engage.\n- Runes/items: Electrocute/Arcane Comet both work; choose Electrocute when you want burst pickmaking and Arcane Comet when you need consistent wave pressure and poke.\n\n### Syndra / Leblanc (burst mages/assassins)\n- Identity shift: You are playmakers — your job is to create a 4v5 by removing a priority target, then back out to keep objective windows safe.\n- Lane: Prioritize level 6 all-ins and roam immediately afterward. Don’t shove without vision when the enemy jungler can counter-gank.\n- Mid/Late: When Baron/Dragon is contested, be on the flank looking for picks instead of sitting front-line DPS.\n- Runes/items: Electrocute + Lethality/Higher raw AP builds for Leblanc; Syndra wants burst AP and CDR (Morello/Zhonya situational).\n\n### Lissandra\n- Identity shift: Teamfight utility and pick engine, not a solo snowballer. If you’re ahead, freeze wave and rotate to secure vision and zone for objectives.\n- Lane: Play safe and use W/E to control sides for enemy roams; don’t overextend without river vision.\n- Mid game: Use your R to stall teamfights while your team secures objectives; be the front-line disruption, not the first flank unless guaranteed control.\n- Items/runes: Prioritize reliable survivability and CDR; Zhonya timing is critical.\n\n### Viktor\n- Identity shift: Scale-to-zone control. Your priority is safely hitting spike and using platform to secure objective fights.\n- Lane: Farm to augment; trade when you have hexcore upgrades. Avoid aimless roams pre-spike that cost jungle pressure.\n- Mid/Late: Hold zones around Baron/Dragon and force fights on your terms. If your team can’t follow, post-pone split pressure.\n- Items: Focus augment upgrade first, then Rabadon/Shadowflame as game state demands.\n\n### Akali / Zed / Kassadin (assassins)\n- Identity shift: Be the clean-up and flank, not the lead engager. You have high kill potential but get punished when caught before objectives.\n- Teamfights: Enter after front-line CC is used or after enemy flash windows are down. Prioritize QSS/Edge of Night if you are repeatedly CC-locked.\n- Rune/item: Electrocute or Hail of Blades for burst; itemize defensively when the team lacks peel.\n\n### Riven (side-lane skirmisher)\n- Identity shift: If you take Riven mid/top, treat her as a split-push pressure tool that converts into objective leverage — don’t solo die to reclaim towers.\n- Macro: When split-pushing, ensure your team can fight 4v4 or delay objectives long enough. Communicate TP and draw vision on flanks.\n\n(Overall): Narrow pool to 3 reliable champions in ranked sessions and train objective-centric decision-making for each of them.",
  "itemization_tips": "Markdown. **Build Efficiency**. Point out static build errors or rune mistakes seen in the data.\n\n- Defensive versus greedy trade: Your loss pattern (lots of picks/high death) means you should adopt a conditional defensive tier in your build paths. If you die >1 time early in a game on a champion (Yone, Akali, Lissandra), prioritize one survivability item earlier (Zhonya/QSS/Ghostblade/Death’s Dance/Sterak’s) depending on threat type. This is more efficient than piling pure damage and feeding objectives.\n- Rune discipline by role:\n  - Assassins (Akali/Zed/Kassadin): Electrocute or Hail of Blades for kill setups. If you’re constantly punished, swap to Presence of Mind + QSS timing or take a more conservative second rune tree with Conditioning/Second Wind vs poke.\n  - Skirmishers (Yone/Riven): Conqueror is default; if you’re getting burst-hooked by CC, consider taking Conditioning/Overgrowth for later survivability and adjusting item order (early Sterak’s/Death’s Dance).\n  - Control/burst mages (Ahri/Syndra/Viktor): Prioritize waveclear items or RoA/Hextech/Proto depending on scaling so you can reach objectives alive. If enemy team heals, take Morellonomicon earlier.\n- Boots timing: Against lane ganks or heavy roamers, get boots earlier (Boots + Control Ward) instead of delaying for a second-damage item.\n- Situational clarity:\n  - If you are repeatedly \"picked before objectives\": buy Control Wards and one early Oracle/Red trinket swap before objective windows. A single Control Ward placed in the river/tri-brush two minutes before dragon dramatically reduces picks.\n  - If enemy has heavy single-target CC that kills you in engages, QSS is often more impactful than a third damage item.\n\nSmall checklist per buy: \"Do I need damage to secure a kill? Or survivability to guarantee I can contest objective?\" Default to survivability if the answer would keep you alive for the next Dragon/Baron.",
  "goals": "Markdown. **Top 5 Strategic Priorities**. A ranked list of 5 concrete, actionable habits to fix the Root Cause. No fluff.\n\n1) Pre-Objective Presence Protocol (Daily Habit): 45 seconds before any major objective spawn (dragon/Baron), check: enemy jungle location, at least 2 vision spots active around objective, your TP/cooldowns, and that you are on the map (not dead/split). If any part fails, do not commit to a fight — ward and reset.\n\n2) Raise Kill Participation (KP) via Planned Roams: Turn one lane shove into a roam each game. Practical goal: convert two wave-pushes per game into roams that result in a kill/assist or at least force enemy back, increasing KP toward 0.6. Communicate intent with pings before leaving lane.\n\n3) Reduce \"PickedBeforeObjective\" by 60%: Before stepping into river/Baron pit, place or confirm a Control Ward and sweep the area. If you can’t confirm flank vision, do not be the first forward — play around being the second angle/peeler instead.\n\n4) One Defensive Item Rule: Whenever you die more than once in a single mid-game fight on a given champion, force a defensive purchase the next back (Zhonya/QSS/Sterak’s/Death’s Dance) instead of a raw DPS item. Track this in post-game notes and enforce it for 5 straight ranked sessions.\n\n5) Shrink Champion Pool to 3 and Practice Macro for Each: Pick 3 champions that cover your identity needs (example set: Ahri — pick/roam; Yone — skirmish & split; Viktor/Syndra — zone/control). For each champion, practice one objective script (how you behave at first dragon, second dragon, first Baron). Only play outside pool to learn, not in ranked grind.\n\nFollow these in order: tighten vision & objective habit first (1 & 3), then increase KP (2), stabilize mortality with item rules (4), and lock a coherent pool to practice those scripts (5)."
}