{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: The \"Objective Ghost\". You show up on the scoreboard with a healthy KDA and decent farming — you don't often throw by dying in lane skirmishes — but you systematically miss or lose fights that decide the map. Your damage share and kill participation are low for a jungler who plays skirmish/utility champs, and the loss patterns repeatedly point to dragons, Baron, and tower pressure being conceded while you are absent, late, or dead. In short: you look like a safe, high-KDA jungle player who isn't reliably present or effective for objectives.\n\n2. **The Root Cause**: Macro discipline around objectives. The data points to two connected habits: poor pre-objective setup (insufficient vision, poor angle control) and predictable/slow pathing that leaves you arriving late or getting picked off before fights. The \"got_picked_before_objective\" and objective gap tags (0.875 each) are the smoking gun — you lose control because you either start objectives without clearing vision/flanks or you path in a way that gets you isolated and killed. That cascades into lost dragons/Baron, lost towers, then a team that can't safely fight or rotate.\n\n3. **The 'One Big Thing'**: Fix pre-objective discipline and presence. Make the objective fight a process (vision -> flank/wait -> engage on your terms), not a reaction. If you consistently stop getting caught before objectives and instead show up with vision and angles secured, half the loss reasons disappear (dragon/baron/tower pressure, low KP, low damage share).",
  "champion_feedback": "**Champion-Specific Adjustments**.\n\n### FiddleSticks\nIdentity shift: From 'scary ult' to 'objective controller'. You already get good KDA on Fiddle — the missing piece is turning fights around objectives rather than single kills.\n- Early (0:00–10:00): prioritize scuttle and mid-priority gank windows. Use early control wards at enemy jungle entrances to protect your flank.\n- Mid (10:00–20:00): position to zone the pit — place brambles/wards on pit ledges and hold brush that denies approach. Your fear+ult wins fights if enemies are funneled; don't facecheck the pit.\n- Late (20:00+): you should be the zone/denial tool during Baron/Dragon. If you're not certain you have flank vision, wait for an ally to clear or for enemy to commit; initiations without vision are what gets you picked.\n- Rune/item emphasis: favor pick/poke keystones (Electrocute/Dark Harvest) or utility that increases burst reliability; build items that let you control fights (early Oblivion Orb/Morello vs healing comps, Liandry for tankier teams). Always buy Control Wards and invest in sweepers.\n\n### Trundle\nIdentity shift: Split-pressure win condition that translates to objective leverage.\n- Early: path to prioritize lane ganks that grant lane priority and open tower plates. If you get lane priority, force plates or deep vision so you can take Rift Herald/dragon windows.\n- Mid: Trundle's biggest strength is converting a lead into towers. When ahead, push side lanes and threaten to take structures so the enemy must respond — that creates safe Baron/Dragon windows for your team.\n- Late: you should be the raid boss or the Baron escort. Stay alive and take objectives; avoid silly engages without team follow-up.\n- Rune/item emphasis: building a damage/tank hybrid (Sunderer/Stridebreaker + Sterak/Titanic piece depending) — pick the build that lets you either 1v1 a carry or shred the front line and secure towers.\n\n### Zyra (as utility/pick jungler)\nIdentity shift: Zyra belongs as a vision-and-pick engine, not a farm-first jungler.\n- Early: if you insist on Zyra jungle, your goal is early pressure and vision control. Your plants are pit-denial tools — use them to control scuttle and objective brushes.\n- Mid: rotate to mid/side to set up picks and secure deep control wards before objectives. Don't try to solo secure dragons; instead, provide the pick that wins the fight.\n- Late: play as off-engage/zone — you win games by preventing enemy approaches to Baron/Dragon.\n- Note: Zyra in jungle is high-variance. Consider moving Zyra to support if you want consistent objective control tools without sacrificing jungle KP.\n\n### Rammus\nIdentity shift: Rammus must be the disciplined initiator, not a reckless flanker without vision.\n- Early: path for quick ganks into lanes that have CC or are pushed. Avoid blind flanks into river brushes with no vision — that's exactly how you get caught.\n- Mid/Late: your job is to either lock down a priority target or peel carries during objective fights. If you can't commit safely to the pit, hold side vision and wait for the enemy to commit.\n- Rune/item emphasis: Aftershock + early armor items (Thornmail/Dead Man/Spirit Visage variants) to make engages stick.\n\n### Lillia\nIdentity shift: Farm-first skirmisher who times engages to target CC.\n- Early: prioritize safe clear to hit 2-item power spike; don't force early contested dragons unless you have vision control.\n- Mid: pick fights in side lanes and avoid 5v5s where your ult is useless. Use speed/ult to zone and remove priority threats during Baron/Dragon fights.\n\n### DrMundo & Misc\n- DrMundo: treat as side-lane objective magnet. If you pick Mundo, make sure to draw pressure and create Baron/Dragon windows for your team.\n- Sivir (one-off): avoid off-role jungle Sivir — play role-appropriate champions for consistent objective timelines.\n\nOverall: pick champions whose macro role you can execute. If you want to improve objective control, prioritize Fiddle and Trundle and drop Zyra-jungle unless you're using Zyra as a support flex.\n",
  "itemization_tips": "**Build Efficiency**.\n- Vision items are items too: buy Control Wards every back and upgrade a Sweeper early (or a control trinket swap) before attempting contested objectives. The data shows vision failures — this is the cheapest, highest-ROI fix.\n- Match build to the macro role: if your intent is to contest/secure objectives, favor utility/tank items that allow you to soak damage and stay alive in the pit (Rammus/Trundle) or anti-heal and sustained burn to deny healing teams (Fiddle: Oblivion/Morello, Liandry vs tanks).\n- Avoid cookie-cutter hypercarry builds on champions whose job is control. Example mistakes likely happening: building pure single-target burst when you need zone/peel, or delaying defensive/tank stats when your team needs a pit-frontline.\n- Runes (practical guidelines):\n  - Fiddle: pick keystones that amplify pick potential (Electrocute/Dark Harvest) and secondary tree for survivability (Bone Plating/Second Wind) if you get camped.\n  - Trundle: Conqueror/Press the Attack for extended fights and duels.\n  - Rammus: Aftershock for tank engages + defensive secondaries.\n  - Lillia: Phase Rush or Conqueror depending on whether you need kiting or sustained DPS.\n  - Zyra: Electrocute/Arcane Comet for pick power if you play her as roamer.\n- Practical shopping list for objective control games: 1–2 Control Wards per back, early Oracle/Red trinket swap before 12:00, one Talisman/Relic upgrade as appropriate, and the defensive item that lets you survive long enough to contest pit (HP/armor/magic resist as needed).\n",
  "goals": "**Top 5 Strategic Priorities**. A ranked list of 5 concrete, actionable habits to fix the Root Cause. No fluff.\n1) Pre-objective Checklist (mandatory, every objective): 1) sweep/clear flanks with a sweeper, 2) place at least 1 control ward on a pit approach, 3) confirm enemy summoners/teleports/cooldowns, 4) ensure at least 2 allied champions are ready to fight. If any check fails, delay or force a reset. (Measure: reduce \"picked before objective\" tags from 0.875 to <0.25.)\n2) Script 3 Jungle Paths per champion and stick to them: one fast-drag path to arrive at first dragon, one gank-priority path, one counter-jungle/vision path. Practice these in the practice tool until you reliably hit objective windows (arrive 10–15s early). (Measure: consistent dragon/baron presence.)\n3) Role clarity per champ before champ select: write down your objective role (e.g., Fiddle = zone/ult pit; Trundle = split & tower trade; Rammus = pit initiator/peeler). If you cannot perform that role, swap champion. (Measure: KP and damage share increase toward baselines.)\n4) Vision budget rule: buy a control ward every back until mid-game vision is established; first sweeper upgrade by 9:00 on games where objectives will be contested; keep at least one control ward on you when approaching any major objective. (Measure: fewer facechecks, fewer deaths pre-objective.)\n5) Post-game micro-review: for every loss, watch the 2–4 minutes around the first objective conceded and timestamp the exact moment you were absent/picked. Write a 1-sentence plan to prevent that specific failure next time (where you should have been, which ward you should have placed, who to ping). Do this for 3 losses per week.\n\nHit these five in order: start with the checklist and vision budget (they are the biggest immediate gains), then lock in pathing and role clarity, and finish with post-game micro-reviews to ensure the habit sticks."
}