{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: The Isolated Scaler — \"Solo Scaler / Quiet Carry\".\n\nYou play like a mid laner who values farm, scaling and clean fights over chaotic team engagement. Your KDA (3.42) and CS/min (~6.9) show solid individual mechanics and lane control, but your kill participation (0.398) and objective gaps show you rarely translate those strengths into team wins. In losses you’re often one of the better performers individually, but the team loses objectives, gets picked before fights, and falls behind on drakes/barons — meaning your impact is too isolated.\n\n2. **The Root Cause**: Pre-objective positioning + identity mismatch (Macro Discipline).\n\nThe data repeatedly points to the same behavioral fault: you get caught or are absent around objectives (\"got_picked_before_objective\" 88%, objective_gap high, many losses citing lost tower/Baron/dragon control). Concretely: you tend to either (A) stay in lane farming and then appear too late or out of position for a neutral objective, or (B) overextend alone to pressure towers without proper vision/backup, becoming the pick that loses the objective fight. That also explains low KP — you are farming into mid/late without proactively creating or securing plays with your team.\n\n3. **The 'One Big Thing'**: Objective Discipline & Positioning.\n\nIf you treat \"not dying before objectives\" and \"being present and useful at objective windows\" as the single non-negotiable rule for every minute of play, you’ll convert many of those close solo-good games into wins. Fixing pre-objective positioning (vision, lane state, roam timing) lifts most other metrics (Baron/dragon control, tower pressure, KP, teamfight outcomes).",
  "champion_feedback": "**Champion-Specific Adjustments**.\n\nYone (30 games)\n- Identity shift: Stop treating Yone like a solo snowball lane 1v1 only — commit to split pressure OR coordinated midgame side-wave pressure. If you opt to split, be the tempo engine: shove, place a deep control ward, and force the enemy team to respond (creating objective windows) rather than getting caught with no backup.\n- Lane: Play safer until first back if jungle is missing. Freeze or slow-push to deny enemy jungle ganks. Prioritize back timings that line up with item spikes so you can force a 1v1 or shove to roam.\n- Mid game: Use side-lane pressure to create Baron/drake windows. If you join fights, wait for key CC or flank — Yone dies fast if you go in first.\n- Late game: Be the cleanup/secondary engage — avoid face-checking. Prioritize QSS vs heavy CC comps.\n- Runes/items: Conqueror / Triumph / Legend / Coup (or Fleet if prefer sustain); build crit/lifesteal into sustained fights (B. Blade, Infinity, Bloodthirster) and adapt with QSS/Defensive if you’re getting caught.\n\nAhri (10 games)\n- Identity shift: Ahri should be your roaming playmaker, not only a lane finisher. Your high KDA but low winrate means you secure kills but fail to convert to objectives.\n- Lane: Push and roam immediately on a reset. Look to influence sidelanes by 6–10min windows.\n- Mid game: Use charm picks to secure drake/baron fights. If you get a pick, ping and commit to the objective — don’t chase past the river.\n- Late game: Stay mobile and avoid front-lining. Use R to reposition after charm combo.\n- Runes/items: Electrocute or Arcane Comet depending on playstyle; Morello vs sustain comps, Lich Bane if split/roam heavy.\n\nRiven (5 games)\n- Identity shift: Riven is a side-laner/skirmisher. When you play it in mid/top, clear role expectations: you are the duelist — set tempo by pushing, creating side pressure, and baiting enemy resources.\n- Phase coaching: Farm to 2-item spike, then force isolated fights or collapse with jungle. Avoid random roams that leave objectives contested.\n\nSyndra (4 games) & Viktor (3 games)\n- Identity shift: Both are teamfight/burst-control mages. Your job is to create teamfight leverage: control waves, set up vision, and either pick or zone.\n- Lane: Prioritize wave control and safety. Syndra should look for level 3–6 roams; Viktor should safely scale his mid-game power by avoiding risky trades.\n- Mid/Late: Use your burst to secure picks before objective attempts, not to chase isolated skirmishes that cost vision.\n\nLissandra, Zed, Thresh (single games)\n- These picks are tools. Use Lissandra/Thresh to secure picks around objectives with CC and vision control. Zed should be the roamer/assassin on sidelanes — if you pick it, commit to roaming early instead of farming for late split.\n\nGeneral coaching for all picks\n- Before every objective ask: \"Are my side waves in a state that forces a response? Do I have vision/deep control wards? Can I be the pick-maker without overextending?\"\n- Convert picks into objectives. If you get 1 kill, shove and place vision first; don’t chase one-for-one kills into objective windows.",
  "itemization_tips": "**Build Efficiency**.\n\n- Adapt, don't autopilot: If you’re losing objective fights because you die first, build QSS/Defensive earlier (Second or third item) vs heavy CC. Many losses show being the pick — this is solved by timely defensive purchases.\n- Yone/Riven: Prioritize mid-game damage + sustain. If you’re often getting dove or caught, take Death's Dance / Sterak / Quicksilver earlier instead of full glass cannon every game.\n- Ahri/Syndra/Viktor: Transition into a Morello/Liandry vs tanks and Rabadon/LichBane when ahead. Don’t delay mythic/major power spikes; missing the mid-game item timing costs objectives.\n- Boots timing: Get Mobility Boots on roam-focused Ahri or Boots 2 when you need lane safety and quick rotations. Don’t slow your rotations by staying on Tier 1 boots when the team needs your presence.\n- Vision buys: Control Wards should be a regular inventory slot when approaching drake/baron. If you die opening objectives, you are not buying enough or not clearing enemy vision.\n- Rune habits: Yone — Conqueror for sustained fights; Ahri/Syndra — Electrocute for burst pick; Viktor — Arcane Comet/Phase Rush depending on whether you play for picks or kiting. Use defensive secondary trees when you’re getting caught frequently (Resolve second).\n\nNote: I flagged no explicit item logs, so these are prioritized adaptations based on loss patterns: get defensive tools earlier and buy vision to stop getting picked.",
  "goals": "**Top 5 Strategic Priorities**.\n\n1) Pre-objective Positioning Discipline (daily habit): Before every Baron/Dragon attempt, check your lane states and enemy vision. If side waves are unsettled or you lack control wards, do not face-check. Make this an automatic \"stop-and-scan\" step.\n\n2) Stop being the solo lane that creates windows for enemy picks (behavioral rule): If you push a wave, place a deep ward and fall back. If you want to split, shove and force the enemy response — don’t stay isolated in river or enemy jungle.\n\n3) Increase KP via purposeful roams (weekly focus): After a successful shove or base, commit to one roam path each early-mid game (for example, shove→ramp to river ward→gank). Track two successful roams per 5 games as a measurable goal.\n\n4) Vision & Objective Checklist (instant practice): Carry 1–2 control wards at all objective windows and use Oracle/Sweep before committing. If you aren’t the one to clear wards, ping and insist your support/jungler do it — don’t enter first.\n\n5) Role clarity in teamfights (mental anchor): For each champion, define one sentence role and stick to it in fights (e.g., Yone = flank/cleanup; Ahri = pickmaker and disengage; Viktor = zone and DPS backline). Before each fight, mentally recite your role so you stop auto-engaging into CC.\n\nExecute these in priority order starting with #1 and #4 (they prevent the most losses). Track improvement by measuring: percent of games with \"got_picked_before_objective\" tag falling each week and kill participation rising toward 0.55+.\n\n"
}