{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: The Quiet Scaler (Low-KP Mid). You're a mid-laner who reliably farms and deals a fair share of damage but plays too often as a solo scaler rather than a team presence. Your CS, damage share and KDA sit near high-elo baselines, but your kill participation is low (0.40 vs baseline 0.65), and you repeatedly get picked before objectives. In short: mechanically competent and lane-stable, but passive around team windows.\n\n2. **The Root Cause**: A persistent macro and identity mismatch. You are often treating mid as a place to farm and hit item timings (Yone/Viktor tendencies) instead of the pivot role mid should be for objective control and picks. That creates three chained problems: poor pre-objective positioning/vision (you get caught before objectives), low presence in fights (low KP), and a failure to convert lane stability into tower/dragon pressure for your team. When you do try to fight, it's inconsistently timed or you overextend (Yone deaths), which throws away the scale you worked for.\n\n3. **The 'One Big Thing'**: Be the objective pivot — i.e., stop being an island. The single biggest climb lever is increasing your presence and survivability around drake/baron windows: improve pre-objective positioning, vision clearing, and role clarity (shove/roam or freeze/defend) so you get into fights alive and useful. Fixing that one habit will turn your near-baseline mechanical stats into consistent wins.",
  "champion_feedback": "**Champion-Specific Adjustments**.\n\nYone (11 games) — Stop playing Yone like a pure solo brawler. Yone wants two things: lead skirmishes and avoid being isolated before objectives.\n- Lane: Prioritize wave control: shove only if you can immediately roam or reset to place vision; otherwise freeze so you can be at team fights. Respect enemy jungle paths — don't overextend without a control ward.\n- Mid game (objective windows): You should be either on the objective flank with vision or pushing a side wave that immediately forces enemy response. Avoid soloing into fog of war trying to make a play; that's where most 'got picked before objective' events happen.\n- Late: If you're the carry, itemize a single survivability item (Death's Dance/Shieldbow/GA/QSS vs CC) so you don't get blown up before you can impact teamfights.\n\nAhri (3 games) — Play Ahri as the objective pick-maker she is, not a roaming liability.\n- Lane: Use charm to secure safe roams; shove then roam only when you can get vision down on the target or on the adjacent river.\n- Mid/Late: Your goal is to get picks to start drakes/barons — be the one who baits face-checks with vision or punishes over-extended enemies with charm.\n\nViktor (2 games) — You scale well; treat Viktor as your macro-safety pick.\n- Lane: Prioritize safe CS and getting your first upgrade. Don't attempt desperate roams early; instead shove and rotate with a warded path.\n- Teamfights: Zone and kite; you win by controlling space. If your team loses drake control, your job is to hold mid and deny river access, or flank with Viktor ult but only if you have sweepers.\n\nRiven (3 games) — Your Riven results are good when you embrace side-lane/duel identity.\n- Lane: Play for the 2-item spike and look to exert side pressure instead of forcing mid-group fights.\n- Teamfights: Riven wants skirmishes, not full-on prolonged 5v5 if your team lacks follow-up CC. Don't be the engage tool unless you have reliable backup.\n\nSyndra (1 game) — Classic pick-mage identity: don't try to be the late-game scaler.\n- Lane: Use push and threat to deny enemy roams and set up vision for objectives. Look for single-target bursts into the objective pit to secure drakes.",
  "itemization_tips": "**Build Efficiency**.\n\n- General fail likely seen in data: you die before objectives too often — shift one damage-heavy item into an earlier defensive purchase when games are close. For skirmishers like Yone, build a single defensive slot (Shieldbow/Death's Dance/GA) by the time Baron/4th drake windows happen.\n- Against heavy pick/CC comps buy QSS earlier than you normally would (second or third item) so you're not the 'got picked before objective' statistic.\n- Vision items: buy and place 1–2 Control Wards before every major objective; swap a minor damage component (e.g., Long Sword → Control Ward) when your team lacks vision control.\n- Rune alignment: play runes that match the game plan — if you're trying to be the roamer/pickmaker (Ahri/Syndra), prefer Electrocute/PZ or First Strike styles; if you're the sustained duelist (Yone/Viktor), prefer Conqueror or Phase Rush/Grasp alternatives that improve survivability and skirmish uptime.\n- Viktor-specific: prioritize your upgrade and a defensive option (Zhonya's) into heavy engage comps rather than stacking raw AP only.",
  "goals": "**Top 5 Strategic Priorities**.\n\n1) Pre-objective Vision & Positioning Checklist (Immediate, Game-to-game): Before every dragon/baron call, ensure you are either (A) in a shove-and-rotate position with a warded path to the pit, or (B) with at least 1 control ward and sweeper on you in the river flank. If you cannot meet one of those, do not be the first player in river.\n\n2) Raise Kill Participation to 0.6 by Active Roaming Rules (2-week goal): Shove mid and roam on shove opportunities or when enemy mid is recalled. If you see a 2v2/3v3 forming near objectives, be the 1 mid-laner that rotates; call it with a ping and commit — increase presence rather than solo farming.\n\n3) Wave Management Habit (Next 5 games): If dragon in 80–90s, either slow-push and be at the pit or shove fully and reset to place vision. Practice two templates: \"Shove+Rotate\" and \"Freeze+Defend\" — use one per objective spawn.\n\n4) One Defensive Item Rule (Next 10 games): If you have >4 deaths in a handful of games or you are getting picked, buy one survivability item before the big objective window (Baron/4th Drake). Evaluate: Deaths > 4 or >2 got-picked events → buy Shieldbow/GA/QSS next back.\n\n5) Vision & Communication Micro-ritual (Immediate & Ongoing): Before every objective, place 2 control wards and clear enemy vision with Oracle for 5s. Use pings to confirm teammate positioning (\"I will clear ward and watch river\"), and if teammates don't follow, do not step alone.\n\nExecute these five in order: vision/positioning and wave management are the highest immediate wins. Item and KP targets are mechanical follow-throughs that convert your existing lane strengths into wins."
}