{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: The Side‑Lane Soloist. You play skirmishy, 1v1/1v2 champions (Yone, Riven, Jax) and high burst/mobility mids (Ahri, Leblanc, Syndra) and your raw mechanical output is solid (avg KDA 3.5, Dmg share ~near baseline). The problem: you consistently show up as a strong isolated performer who doesn’t translate that pressure into team objectives. Low kill participation (0.40 vs baseline 0.65), repeated objective gaps (dragon -1.7 on average) and a pattern of getting picked before or during objectives show you prefer solo fights and duels over coordinated objective play.\n\n2. **The Root Cause**: Identity–Macro mismatch. Your player identity is \"win lane / win 1v1\" but your macro habits don't support that identity. You often push or duel without converting pressure into vision, rotations, or objective control (you get picked before objectives, you’re absent for drakes/barons, and tower pressure is lost). When forced into team scenarios you either aren’t there (low KP) or you enter fights in the wrong moment and die (occasional high-death games). In short: strong micro, weak macro discipline and objective timing.\n\n3. **The 'One Big Thing'**: Increase kill participation around objectives — make your lane pressure become map pressure. That single shift (shove + roam/ward + be present for dragon/baron windows) will convert your favorable 1v1s into wins more often than incremental mechanical improvement.\n",
  "champion_feedback": " **Champion-Specific Adjustments**.\n### Yone\n- Identity shift: from \"1v1 carry who clutches outplays\" to \"controlled split-push engine and timely teamfight flank.\" Your Yone games show good CS but poor KP and objective conversion.\n- Early items/runes: Conqueror, Phantom Dancer/Death's Dance or Sterak's depending on team comps (survivability buys win teamfights when you are forced to show up). Prioritize lifesteal/mitigation over pure crit in games where you are getting focused.\n- Phase coaching: Lane: slowpush->reset window, then roam/contest scuttle. Mid game: take Herald and force tower then rotate to dragon. Late: avoid entering front-line until CC is used; flank instead.\n\n### Ahri\n- Identity shift: Ahri is your best tool for increasing KP — use roams aggressively but intelligently.\n- Runes/items: Electrocute/Spellbook depending on style; buy Zhonya's vs clean burst/assassin comps. Take mobility boots on planned roams.\n- Phase coaching: Lane: shove 1 wave and look to roam every time the enemy mid recalls. Mid game: use one-charm picks to secure dragon fights, then immediately place vision.\n\n### Riven (played mostly top)\n- Identity shift: keep the skirmish-play but convert lead into outer tower pressure and map control (not isolated kills).\n- Items/runes: Conqueror → Black Cleaver + Death's Dance; one defensive item is frequently necessary when your death count spikes.\n- Phase coaching: Win lane, then force side lane priority, take Rift Herald, and TP/roam to help secure drake windows rather than solo snowballing.\n\n### Lissandra\n- Identity shift: become the team's objective lock-down tool rather than trying to solo carry.\n- Items/runes: More utility/CC items (Zhonya's) and early control wards. Play to engage/pick around drakes.\n- Phase coaching: Waveclear to relieve pressure and then rotate to river vision before objectives. Use R as a counter-engage when objective fights break out.\n\n### Viktor\n- Identity shift: reliable scaling and zone control. Keep him as the safe map preserver who secures objective control with wave pressure.\n- Items/runes: Prioritize upgrade early for wave control; Zhonya's if getting dove. Play around your ability to control zones and force enemies into bad engages.\n- Phase coaching: Play safe lane early; if you can't roam, shove and grant side laners priority so you can show for drake fights.\n\n### Syndra / Leblanc / Akali (burst mids)\n- Identity shift: use them as pick tools to raise KP — your winrate on Syndra is excellent but low games; when you pick them, prioritize roaming post-push to convert kills into objectives.\n- Items/runes: Electrocute/Comet depending on matchup; Morello vs healers; Zhonya's on Syndra/Leblanc for survivability in teamfights.\n- Phase coaching: Push then roam, but practice timing: don’t chase a solo kill that leaves dragon free for 30s. After a successful roam, immediately place vision and reset for objective timing.\n\nGeneral note: If you keep playing skirmish/duel champions, explicitly practice a 2-step macro habit: 1) shove and deny enemy wave, 2) immediately create presence for objective (ward + path to dragon/river). This will directly fix your top loss drivers (low KP, objective gap, gets picked before objective).",
  "itemization_tips": " **Build Efficiency**.\n- Frequent static mistake seen in the data: pushing for kill damage at the expense of survivability. When you get focused in objective fights you die and lose Baron/dragon control. Fix: on skirmisher mids (Yone/Riven) add one survivability/mitigation purchase (Death's Dance, Sterak's, or early Chain Vest->Black Cleaver path) on the second back if enemy comp can collapse.\n- Vision economy: you are not investing enough in control wards or upgrading your trinket on objective windows. Make buying a control ward part of every back after 8 min if the objective is up in the next 2–3 minutes.\n- Rune mismatches: use Conqueror for sustained duelists (Yone, Riven, Jax), Electrocute or Dark Harvest for assassins/burst (Leblanc, Akali, Syndra/Ahri if snowballing), and Aery/Comet or Phase Rush for mages depending on playstyle. Pick runes to increase your objective presence (Phase Rush + boots for roams; Electrocute for reliable pick potential).\n- Stopwatch/Zhonya timing: if your games trend toward \"getting picked before objective\" or being collapsed in fights, a single early Stopwatch (into Zhonya) can flip a lost Baron/dragon fight. Prioritize it vs heavy engage teams.\n- Item priority per role: Viktor—upgrade core early for wave control; Ahri/Syndra—Zhonya's situational; Yone—Death's Dance/Sterak over pure late crit when enemy focuses you; Leblanc—Lich Bane or Shadowflame depending on squish vs MR.\n",
  "goals": " **Top 5 Strategic Priorities**. A ranked list of 5 concrete, actionable habits to fix the Root Cause. No fluff.\n1) Push‑then‑objective routine (KP target): After you shove a mid wave, execute a 10–20s action: (a) place a deep/river ward, (b) path to contest scuttle or join dragon. Goal: raise KP from 0.40 to ≥0.55 in 6 weeks. Track: count roams per game.\n2) Ward every back before objective windows: buy 1 control ward every back once drakes start; swap trinket to Control at 9 min. Goal: +7 vision score per game (target 30+). This reduces \"picked before objective\" occurrences.\n3) One survivability purchase rule: if enemy team has 2+ hard engages or you are being focused in >25% of losses, buy 1 defensive/mitigation item on your 2nd or 3rd back (Stopwatch -> Zhonya, Death's Dance, or Banshee). This reduces high-death throws.\n4) Wave management checklist (lane mechanical routine): 1) Identify shove/slowpush/freeze window each wave, 2) If shove: ping and roam within 8–15s, 3) If freeze: deny enemy recall and pull priority to side lane. Practice this in normals until automatic; aim for 80% correct decision rate.\n5) Objective presence timing (team macro habit): Learn the common drake/baron windows (respawn timers) and your team's win conditions. If you cannot frontline/peel, convert your lead into tower+Herald or shove and force enemy to respond — never be the laner absent from an objective fight because you were chasing one more solo kill. Measurable: within 8 weeks reduce \"objective_gap\" tags by 50% in review clips.\n"
}