{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: \"The Isolated Skirmisher\"\n   - You play like a skirmisher: prefer champions who win 1v1s and look for flank/duel openings (Yone, Riven). Your raw per-game metrics (CS and damage share) are close to a high baseline, but your KDA and — crucially — your kill participation are low. That combination reads like a player who often gets kills or fights alone but fails to convert those skirmishes into team objective control or consistent teamfight impact.\n\n2. **The Root Cause**: Objective-discipline & vision/positioning mismatch.\n   - Symptom cluster: repeated \"got picked before objective\", low kill participation, lost tower pressure, and frequent objective gaps. The underlying habit is a comfort with solo, aggressive plays without the macro scaffolding (vision, coordinated timing, escape routes) that turn those plays into team advantage. You either leave your team under-pressured while you look for isolated fights, or you enter fights/areas around dragon/baron without cleared vision and coordination, which results in getting picked and losing objectives.\n   - Mindset element: you treat mid as a solo-battle lane (skirmish-first) instead of the team's objective-control hub. That identity mismatch means even when you mechanically win trades, you fail to translate them into towers, dragons, or safe skirmishes.\n\n3. **The 'One Big Thing'**: Stop getting picked before objectives — i.e., build a simple, repeatable objective routine (vision clear → wave/state check → coordinated engage/retreat). If you fix vision/positioning + timing around dragons/barons/towers you will immediately convert your mechanical wins into team wins and your KP/damage share will rise.\n",
  "champion_feedback": "**Champion-Specific Adjustments**.\n\nYone (10 games) — \"Stop playing Yone like a blind lane diver.\"\n- Identity: Yone is a skirmisher that needs spikes and safe windows to 1v1. Your games show many quick losses and picks around objectives.\n- Adjustments: shove and reset before roaming; if you plan to flank a dragon/baron fight, ensure enemy vision is cleared or you have backup. Prefer split pressure only when your team can threaten the objective or when you have accurate vision control. If you're getting focused, buy a defensive timing item (see item tips) or take a more backline approach in teamfights until you hit your two-item spike.\n\nAhri (4 games) — \"Be the team's pick-maker, not the solo engager.\"\n- Identity: Ahri should create picks to enable objectives. Your Ahri losses show high deaths and lost objective control.\n- Adjustments: play to roam windows: push a wave fully then look for roams with jungle. Use Charm as an initiation tool before objectives to secure picks; avoid face-checking brushes without an allied follow-up or vision.\n\nViktor (3 games) — \"Play him as the safe scaler and objective-anchor.\"\n- Identity: Viktor excels at controlled waveclear, zoning and late-game DPS.\n- Adjustments: prioritize safe scaling and shove-control; be the midline DPS in teamfights and use zone control to keep enemies from clearing vision around objectives. Viktor games show the best winrate — lean into him when you want consistent macro impact.\n\nSyndra (1) / Riven (2) — \"Use them situationally, not as defaults.\"\n- Syndra: Use picks to secure objectives; avoid trying to solo carry through skirmishes if your team lacks follow-up.\n- Riven: If you use Riven, put her in side-lane/top contexts or be explicit about split-push timing; mid-Riven often mismatches team expectations and objective timing.\n",
  "itemization_tips": "**Build Efficiency**.\n\n- Vision items are non-negotiable: bring and place Control Wards before any dragon/baron attempt, and proactively clear enemy vision with Oracle Lens when contesting. Many losses were \"got picked before objective\" — that stops with consistent warding and clearing.\n- Defensive options vs pick-threats: when you're being targeted before objectives, prioritize a Stopwatch/Zhonya's (AP mids) or Quicksilver Sash against hard CC. These are cheaper, high-impact items that prevent single deaths that cost objectives.\n- Boots choices: adapt — Merc Treads versus heavy AP/CC and Plated Steelcaps versus heavy AD/auto threats. Don’t default to a single boot every game.\n- Yone specifics: prefer a build path that gives you sustain/defensive cushion into your 2-item spike (e.g., lifesteal or early Sterak's/Shields depending on enemy comp). If you keep dying to picks, add QSS into your plan earlier.\n- Ahri specifics: consider Zhonya's as a mid-game pickup when you're the target, and build early Magic Pen only if you can convert roams into immediate objectives.\n- Viktor specifics: prioritize the augment/upgrade that allows safer wave control; delay greedy damage items if it costs you presence in objective fights.\n- Runes (high-level guidance): match rune pages to the objective risk. If you're getting picked, include defensive runes (Bone Plating, Overgrowth, Second Wind). If you need picks and roam pressure, take Electrocute/Electrify-style keystones on Ahri or Dark Harvest only if you can reliably finish roams.\n\nGeneral rule: itemize to reduce one-shot/death-before-objective scenarios first, then optimize for damage.\n",
  "goals": "**Top 5 Strategic Priorities**.\n\n1) Vision Routine (highest priority)\n   - Before any dragon/baron/tower fight: place 1 Control Ward and sweep 2 enemy-deep vision spots; do not fight unless those key spots are cleared or you have clear numerical advantage. Make this a pre-fight checklist you actually follow.\n\n2) Wave/Roam Discipline\n   - Shove or freeze mid wave first. If you want to roam, shove fast and roam with a ping or comms (or ask/confirm with your jungler). You must demonstrate presence when you leave mid: either you secure an objective or you create pressure elsewhere. No more aimless roams.\n\n3) Positioning & Escape Plan\n   - For every objective contest ask: \"Where can I die from? Do I have an escape? Who peels me?\" If the answer is no — play safer. Prioritize Stopwatch/Zhonya/QSS buys in games where enemy picks are frequent.\n\n4) Play-to-Champion-Identity Map\n   - Pick Viktor when you want stability and objective-control; pick Ahri when you want to create picks and roam windows; pick Yone only when you and your team can convert side pressure or when vision is controlled. Reduce playing carry-skirmish champs into chaotic, vision-poor games.\n\n5) 10-minute replay habit + one action per death\n   - After each session (2–3 ranked games), review the one death before an objective that lost a game. Identify the single decision (no vision, wrong timing, poor comms) and define one corrective action for the next game (e.g., \"never start Baron without my control ward in pit\" or \"always ping 2x before I roam\"). This targeted review will rewire the objective routine faster than generic macro study.\n\nImplement these in order: Vision Routine + Wave/Roam Discipline will move your KP/damage share and translate your mechanical edge into wins quickly.\n"
}