{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: \"The Vision-Light Objective Sideliner\". You play a mixed support identity — sometimes a roam-focused pickmaker (Pyke/Pantheon), often an enchanter/utility peel (Yuumi/Nami/Lulu/Milio). Your damage and gold share are slightly above pro-baseline for high-elo supports, and your CS/min is fine, but your KDA and kill participation are low and you frequently show up near the bottom of your team in losses. That pattern fits a player who farms/plays safe but isn’t reliably present or decisive around objectives and fights, and who gets punished by picks before objectives.\n\n2. **The Root Cause**: A macro + discipline failure: poor pre-objective setup (vision, lane priority and timing) combined with inconsistent role identity. The data shows you get \"picked before objectives\" often and lose tower/dragon pressure. In practice that looks like: you either aren’t placing/clearing deep vision before dragon/baron, or you’re out of position when the team chunks HP and tries to contest — then you die or slow-rotate, which lowers KP and lets the enemy snowball towers and objectives. On top of this you flip between roaming playmakers and protective enchanters without fully committing to the playstyle or item/rune choices each requires; that mismatch makes your impact inconsistent.\n\n3. **The 'One Big Thing'**: Stop getting picked before objectives. Make a 10-second vision-and-position checklist before any dragon/baron/tower play: do I have a sweep/Control Ward in the quadrant? Is my frontline/ADC in position? Are enemy mobility/ultimates up? If the answer to any is \"no,\" do not contest. Fixing this single habit will immediately raise your KP, reduce deaths, and convert those objective losses into wins.\n\n",
  "champion_feedback": "**Champion-Specific Adjustments**.\n\n### Pyke\nIdentity shift: from flashy solo-kill gambler to disciplined objective hunter. Prioritize: Control Wards + Sweeper before roams and before starting enemy jungle. Playstyle: only roam when your ADC or mid is in a state to follow or when you have lane priority and a cleared river. In teamfights avoid blind flank facechecks — you should look to catch isolated targets, not run into visionless objective circles.\n\nPhase coaching: lane — push/swap priority then roam; midgame — set deep vision and time roams right before dragon spawns; late — stick to flank corridors with sweeper, avoid starting fights alone.\n\n### Pantheon\nIdentity shift: early-game engine and objective opener. Prioritize: aggressive early pressure while owning vision around bot/river. Use your global to force numbers on key objectives. If playing support-Pantheon, buy mobility boots early and at least one Control Ward every other back.\n\nPhase coaching: lane — bully/poke and secure lane priority; mid — use ult to force fights around neutral objectives; late — split or flank when your team can collapse.\n\n### Enchanters (Yuumi / Nami / Lulu / Janna / Milio)\nIdentity shift: be a reliable survival and vision anchor rather than a passive healer. Prioritize: staying attached to a carry in fights only when that carry has vision/peel around objectives. Buy Control Wards and time your big cooldowns (ult/shield) for objective windows; use ult/peel proactively to prevent picks.\n\nPhase coaching: lane — secure vision and lane priority when possible; mid — sit vision behind your frontline and never facecheck; late — always be in a safe zone with line-of-sight to dragons/baron so you can use ult to save contested objectives.\n\n### Thresh\nIdentity shift: playmaker + vision controller. Prioritize: control-warding flanks and river brushes before objectives, and coordinate hooks with the jungler. If you're ahead, convert vision control into tower dives or objective control — don't overextend alone.\n\nPhase coaching: lane — use hooks to punish overextensions and gain river control; mid — roam and secure deep vision; late — hold flanking brushes and deny enemy picks.\n\n### Senna\nIdentity shift: hybrid utility carry who must be present for objective fights. Prioritize: use ult proactively to start or zone during dragon windows; manage wave to be able to join fights. Buy a Control Ward every second back and work with your support to maintain Scuttle/river control.\n\nPhase coaching: lane — stack souls and pressure turrets; mid/late — position to contribute both damage and objective control; use R to influence fights that happen away from you.\n\n",
  "itemization_tips": "**Build Efficiency**. Pointed checks based on your playstyle data:\n\n- Control Wards and Sweeper Discipline: Your vision score is middling while \"picked before objective\" is high. Buy a Control Ward on nearly every back in the first 15 minutes and swap to Sweeper before objective windows. This is the highest-ROI item change.\n\n- Support Item Progression: Always complete the support item progression relevant to the champion (gold/experience tracks). If you play roamers (Pyke/Pantheon), favor boots earlier (Mobility/Mercs) and a kill/pen item; if you play enchanters, prioritize early Ardent/Redemption/Staff-of-flow type buys depending on team comp.\n\n- Rune-Role Alignment: Don’t take scaling/defensive rune sets on champions that should be forcing windows (Pantheon/Pyke). Conversely, if you lock an enchanter, pick runes that improve lane sustain and roaming utility (Aery/Guardian and secondary that improves mana or cooldowns).\n\n- Situational Defensive Buys: Multiple losses cite \"lost tower pressure\" and getting collapsed. If you notice repeated picks, opt for Locket/Mikael/Aegis-late buys on enchanters to blunt AoE burst and allow your team to defend objectives.\n\n- Avoid mixed identity builds: when you pick a playmaking support, finish aggressive core items (boots, lethality/penetration) and build vision — don’t try to shoehorn both aggressive and purely protective items in the early game.\n\n",
  "goals": "**Top 5 Strategic Priorities**. Ranked, concrete habits to fix the Root Cause.\n\n1) Vision-and-Position Checklist (Before Every Objective): 10 seconds before dragon/baron/tower fight — do I have: (a) a Control Ward in the quadrant, (b) sweeper ready, (c) at least one allied body in front of me, and (d) enemy mobility/ult status known? If any is missing, call a reset. Do this every game until automatic.\n\n2) Commit to One Identity per Queue: pick either the 'roam/playmaker' pool (Pyke/Pantheon/Thresh) or the 'protect/utility' pool (Yuumi/Nami/Lulu/Janna/Milio/Senna) for a session. Play 7+ games in a row with that identity to ingrain decision-making and build/rune patterns.\n\n3) Control-Ward Economy: buy a Control Ward on 75%+ of backs until you have 3 placed around mid+bot river. Upgrade to sweeper before objective timers. Track and replace your wards—if the enemy clears a ward, replace it immediately on your next back.\n\n4) Increase Kill Participation by Helping Secure Objectives: turn every successful roam or poke into objective control. If you get a pick, immediately tilt vision toward the objective (place a Control Ward and sweep) and ping for dragon/baron — don’t trade a pick for a single tower unless it guarantees an objective.\n\n5) Positioning Drill (5-minute pre-game warmup): practice two things in normals/flex — (A) for enchanters: staying behind front line but within LoS of objective to secure shields/ults, (B) for playmakers: approaching objectives via flanks and never facechecking without sweeper. Run this drill for 10 games and track the number of deaths within 10s of objective fights — goal: cut those deaths by 60%.\n\n"
}