{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: The Lone Diver. You play like a high-impact solo skirmisher: high KDA, good CS, decent damage when you land on targets, but you too often act in isolation — you create personal spikes (Diana/Briar) or single-player engages (Rammus) without reliably turning them into team objective control. The data shows above‑baseline KDA and CS, below‑baseline kill participation and slight underperformance in damage share on several losses. That pattern fits a player who wins by outplaying fights individually but loses when team-wide objective execution is required.\n\n2. **The Root Cause**: Macro discipline + identity mismatch. The core habit causing losses is inconsistent objective timing and positional discipline around objectives: you get picked before objectives, miss dragon/baron windows, and fall behind in tower pressure. Those are not random — they result from (a) playing dives/skirmishes on a personal timer rather than coordinating to secure objectives, and (b) poor timing/vision routines before objective commits. In short: you force or commit to fights at the wrong moment (or alone), which turns your individual effectiveness into team deficits.\n\n3. **The 'One Big Thing'**: Objective Discipline. If you fix your decision-making and positioning around drake/baron/towers (arrive on-time, clear enemy vision, don’t face-check or solo-dive before your team is ready), most other problems (low KP, lost objective control, low damage in losses) will shrink. Make arriving alive and coordinated to objectives your default priority — not getting one more isolated kill.\n",
  "champion_feedback": "**Champion-Specific Adjustments**. Use '### ChampionName' headers for each group. Focus on specific identity shifts.\n\n### Diana\n- Identity shift: from 'farm/solo spike' to 'early-mid game objective initiator'. Your CS and solo power are strong — convert that into drake/baron priority: path to be near drake spawns (scuttle/control) and force skirmishes on your terms.\n- Runes & playstyle: Electrocute/Dark Harvest for kill threat; take sudden impact and ultimate hunter to maximize roam/one-shot windows. If games go long, pivot to rune setups that give sustained combat (Conqueror) only when team needs split-push.\n- Itemization: Prioritize a mobility/burst mythic (to access backline and assist with objective fights), Zhonya's/Stopwatch as a second defensive pickup to avoid getting picked when you dive on objective fights. Build enough magic penetration to influence teamfights rather than purely farming items.\n- Phase coaching: Early — aggressive clear into level 6 roams; Mid — be at drakes and force skirmishes when you have ult; Late — avoid solo Baron dives, use your stun window when team commits to objective.\n\n### Briar\n- Identity shift: reinforce your strongest role as the primary skirmisher that sets up teamfights for objective takes. You already show the best damage share on this champ — make that translate to grouped objectives.\n- Runes & playstyle: Electrocute/Press-the-Attack depending on matchup; lean into early dueling and fast scuttle control so you can contest drakes.\n- Itemization: Build for duels but keep one defensive slot (early boots or stopwatch) so you don't become the 'pick' before Baron. Buy Control Wards on recall cycles when you plan objective.\n- Phase coaching: Early — invade/scuttle priority; Mid — force fights around drake windows and pin opponents (don't chase side lanes when drake is contested); Late — be the reliable engage or assassin into their backline only when your team is ready.\n\n### Rammus\n- Identity shift: from high-KDA flank threat to reliable objective frontliner. You're extremely durable and win games by engaging — trade some damage focus for objective security and vision clearing.\n- Runes & playstyle: Aftershock or Guardian based on team comp; prioritize early boots/wrapping to hit CC chains and body up to secure Baron/Dragon pit.\n- Itemization: Full-engage/tank path: mythic that enables fast approach (Turbo Chemtank/Stridebreaker style), source of thornmail/bruiser stats, then situational MR/HP so you can face-check with teammates rather than being the solo check.\n- Phase coaching: Early — secure scuttle and enable laners to push for objective priority; Mid/Late — be first into objective fights with vision cleared and your team nearby.\n\n### Jax / Kai'Sa (occasional picks)\n- Jax: Standard skirmisher rules — farm to spike, split when team lacks side pressure, avoid solo Baron attempts.\n- Kai'Sa: Only play when your team can give you time to scale. If you pick Kai'Sa from jungle or swap, prioritize safe farm and team protection; low damage share in your Kaisa loss suggests poor team coordination rather than pure execution.",
  "itemization_tips": "**Build Efficiency**. Point out static build errors or rune mistakes seen in the data.\n- Common theme: builds or rune choices that favor solo burst/clear but leave you vulnerable in objective fights. On Diana/Briar you sometimes end up too squishy to contest objectives or too committed when your team isn't present.\n- Practical item fixes:\n  - Divers (Diana/Briar): 1) Mythic for mobility/burst (enables you to join objectives quickly). 2) Zhonya's/Stopwatch as a second defensive purchase to prevent being the pre-objective pick. 3) Finish magic penetration or AP spike only when you can translate into team damage (don’t over-farm defensive rounds).\n  - Tanks (Rammus): 1) Mythic that helps engage/approach. 2) Anti-heal/armor (Thornmail) vs heavy healing comps. 3) Durable stat items that let you tank Baron/Dragon pit reliably.\n- Warding & trinket habits (itemization-adjacent): buy at least 1 Control Ward every back if an objective is upcoming; prioritize Oracle Lens on recall before contested objectives. Many of your losses show 'got picked before objective' — this is primarily a vision and trinket usage failure, not a damage-number failure.\n- Rune mistakes to avoid: picking purely farm-scaling runes on divers when your team needs you to be present at objectives (e.g., overly late-scaling secondaries). Favor electrocute/early-hunter/haste or defensive secondary runes that improve your presence at fights.\n",
  "goals": "**Top 5 Strategic Priorities**. A ranked list of 5 concrete, actionable habits to fix the Root Cause. No fluff.\n1) Objective Arrival Window: Be in position 10–20 seconds before drake spawns (and 20–30 seconds before Baron). If you are not within ~1200 units of the pit with vision cleared at T-10s, do NOT start the fight. Practise pathing so you are there alive.\n2) Vision Routine: Before any contested objective, sweep and place 2 control wards: one in the pit/choke and one on the enemy approach. Buy at least 1 Control Ward on any recall that precedes a likely objective. Use Oracle Lens before you step into the pit.\n3) No Solo-Snowballing Before Objective: If your laners are dead/slow to respond or enemy vision remains, do not attempt single-player dives to secure kills that delay objective timing. Wait, reset, and come grouped. Convert kills into towers/objectives, not solo score.\n4) Increase Kill Participation via Pings+Pathing: On champ select, plan two early gank routes that either secure scuttle or apply immediate lane pressure. Ping 10–15s before you commit and make gank timing predictable to your laners so they can assist and you increase KP by +10–15%.\n5) Adaptive Item Checklist: For each game, answer three quick questions at 12:00 and 18:00 minutes: (A) Who needs me at the next objective? (B) Do I need Zhonya/Stopwatch or defensive boots to be useful alive? (C) Where is my Control Ward count? If the answer to any is negative, prioritize that slot this back. Make it a hard habit — if you're diving for an objective, you must have either a Stopwatch or sight control.\n\nMeasure progress weekly by tracking: KP (target +0.1), dragon gap (target close to 0), and 'picked before objective' occurrences (target 0 in your next 20 games)."
}