{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: The 'Split-Pressure Skirmisher who vanishes at objectives'. You're a mid-lane skirmisher/main carry profile (lots of Yone + Riven games) who can produce high personal impact on picks and side-lane fights but shows inconsistent team integration. Your KDA and damage share are near-high enough to win solo fights, but your kill participation (0.40 vs baseline 0.65) and objective involvement are the outliers. You repeatedly either (A) get picked before objective windows or (B) play a side-lane/skirmish game that doesn't translate into dragon/baron or tower control, which hands objective control to opponents.\n\n2. **The Root Cause**: Macro-discipline and role-identity mismatch. The pattern isn't raw mechanical failure — it's a decision problem. You habitually play champions and patterns that excel in isolated skirmishes (Yone, Riven, sometimes Akali) but aren't converting skirmish advantages into objective control or team fight presence. That mismatch shows as low KP, frequent 'picked before objective' events, and objective deficits (avg dragon gap -1.7). Compounding that: inconsistent vision/positioning around objective windows so you either aren't present for fights or you die and lose the objective before the team can contest.\n\n3. **The 'One Big Thing'**: Stop being absent (or dead) at objective windows. Your single highest-leverage change is to convert your solo skirmish strength into objective influence: show up alive, with vision, and in the right place/time for dragon/baron and tower trades. If you make being present for objectives your default behavior, your low KP and objective gaps start closing and your current mechanical strengths will carry games instead of being isolated highlights.",
  "champion_feedback": "**Champion-Specific Adjustments**.\n\n### Ahri\nIdentity shift: From a pure pick-roamer into the team's proactive objective alarm. Lane: Prioritize wave-trading that lets you shove and roam at +15–25s before dragon spawns. Mid game: Use charm to secure picks *while* a control ward/Ally is nearby so kills turn into dragons/towers. Late: don’t overextend to solo-kill if the dragon/baron is live — pull back and use R defensively to avoid being picked.\n\n### Yone\nIdentity shift: From 'solo carry outplaying opponents' to 'controlled split-pressure tool'. Lane: Freeze or slow-push to reach item spikes safely; avoid solo dives without a jungle/vision lead. Mid game: If you split, place deep vision and time your rejoin so you’re not forced to teleport back from base as objective fights start. Late: prioritize surviving engage (buy defensive options/positioning) — Yone games show many deaths that cost objectives.\n\n### Riven\nIdentity shift: Turn lane dominance into map pressure rather than raw snowball attempts. If you play top, communicate your intent to force side pressure and drag the enemy top to relieve dragon pressure. If you bring Riven mid occasionally, remember she’s a side-lane tool — coordinate with jungler for herald/dragon windows.\n\n### Viktor / Syndra / Lissandra\nIdentity shift: Play them as objective-control mages. Lane: focus waveclear and shove so you can be at mid-lane control during pre-dragon/baron windows. Mid: hold ult/cc for objective fights and use zone control to prevent picks. Late: buy Zhonya/Stopwatch or position slightly behind frontliners so you remain alive to win teamfights and contest baron.\n\n### Assassins (Akali / LeBlanc / Zed)\nIdentity shift: Only roam when objectives or vision advantage exist. Your data shows picks-before-objective — assassins that die off-timer hand games away. Lane: wait for clear vision or set up with a control ward, then roam. Mid: be the cleanup/exec role, not the engage.\n\nGeneral: consolidate to 2 primary playstyles: (1) Ahri / Syndra / Viktor — objective-aware control/roam mids; (2) Yone / Riven — side-lane skirmisher toolkit. For each match pick which role you will play BEFORE loading: teamfight-presence (mages) or split-pressure (skirmishers). Execute that identity consistently.",
  "itemization_tips": "**Build Efficiency**. Pointed suggestions based on patterns, not every-game rules.\n\n- Buy defense vs. high-CC / pick-prone enemy comps. Multiple losses list “got picked before objective” — on Ahri/Viktor/Lissandra consider early Stopwatch/Zhonya or Mercury’s when enemy CC/burst is high. On Yone, build some defensive lifeline (Phantom Dancer/Death’s Dance/Quicksilver) more often when opponents have reliable lockdown.\n- Vision items matter more than an extra offensive item. Upgrade/hold Control Wards near objective timings; if you are the roaming mid, keep a control ward in inventory entering dragon/spawn windows. Oracle/Red trinket clears have high ROI for your profile.\n- Rune alignment with role: your highest-EFF Ahri games imply Electrocute/Phase Rush fits her roam-pick identity; for Viktor/Syndra, prefer Arcane Comet or Aery with Precision secondary for lane poke and objective pressure. For Yone, Conqueror with sustain or Lethal Tempo situational — but if you are dying before objectives, consider taking a defensive secondary (Bone Plating/Second Wind) vs heavy all-in lanes.\n- Avoid greedy single-item spikes in games where your team lacks engage. If your team has no front line, prioritize items that let you survive 1v1s and then convert to objectives (Zhonya/Edge-based lifesteal/defensive boots).\n- Stop skipping control wards. The macro tags show objective-gap — cost of not buying a ward far outweighs incremental offensive stats.\n\n(These are prioritized: survivability items ahead of purely damage when objective windows are contested.)",
  "goals": "**Top 5 Strategic Priorities**. Ranked, concrete, actionable habits to fix the Root Cause. No fluff.\n\n1. Shred the 'picked before objective' problem: Always have one control ward and one sweep (or Oracle) in inventory 60s before dragon/baron spawns; if you cannot place vision safely, do not solo-forward — call a reset or take lane priority instead.\n2. Increase Kill Participation via planned roams: After hitting lane shove, make at least one purposeful roam per minute-mark window (6–12, 12–18, 18–24) tied to objective timers — log each roam: was it to secure scuttle/ward/dragon or just chase? Aim to raise KP from ~0.40 to >=0.55 within 20 ranked games.\n3. Two-role clarity rule: Before champ select or at latest at 1:30, declare whether the game plan is 'teamfight mid control' (pick Ahri/Viktor/Syndra) or 'split skirmish' (Yone/Riven). Play only champions that match that plan for the whole game; this reduces identity mismatch and poor objective transitions.\n4. Vision & Positioning checklist pre-objective: 30s before objective — ping intent, place deep vision on enemy approaches, clear enemy vision, and be in a team position that guarantees you won't be caught rotating. If you die approaching, mark it as a failure and analyze why (no vision / bad timing / solo approach).\n5. Item/rune decision discipline: For each game, pick your first defensive item or Stopwatch when enemy has 1+ reliable hard-CC or 2+ instant-burst threats. Also commit to buying at least 1 control ward every objective cycle. Track results for 10 games: fewer deaths during objective fights and improved objective win-rate.\n\nImplement these five in this order; focus first on #1 and #4 (vision and not getting picked) — they unlock all other improvements."
}