{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: \"The Solo-Diver who forgoes the objective\". You are an aggressive, skirmish-first jungler (Diana / Briar / occasional Rammus) who consistently finds kills and sustains a high KDA and healthy CS — you're mechanically solid and win a lot of small fights. However your impact is noisy and isolated: your damage share sits slightly below the meta baseline and your kill participation is well under where it needs to be for a carry-style jungler. That combo produces games where you look dominant in personal stats but the team loses towers, dragons, and Barons when it matters.\n\n2. **The Root Cause**: Macro-discipline and timing around objectives. The dataset repeatedly flags \"got picked before objective\" and large objective gaps (avg_dragon_gap -1.8) — you are frequently off-timing your engages or taking fights without the vision, team readiness, or objective priority to convert them into map control. In short: you can win skirmishes but too often those wins are isolated (or you die before the objective), so they don't translate into dragons/barons/towers. That leads to you being lower relative to your team in losses.\n\n3. **The 'One Big Thing'**: Stop being the pick that's made before the objective window. Convert your kills and skirmishes into secured objectives by (A) refusing to commit without sufficient vision or teammate readiness and (B) prioritizing presence and objective timing over chasing a solo elimination. Fix that and the rest (damage share, winrate consistency) will follow.",
  "champion_feedback": "**Champion-Specific Adjustments**. Use '### ChampionName' headers for each group. Focus on specific identity shifts.\n\n### Diana\n- Identity shift: From \"I make a solo flank\" to \"I create an isolated fight that my team can convert to an objective.\" Your strength is decisive isolation and dive — use it to force 2v2/3v3 skirmishes around dragon pits and Baron entrances, not to hunt a lone carry out of vision range.\n- Mid/early game coaching: Clear to level 6 quickly, then path to river scuttle and set up a visible flank with a control ward on the objective quadrant. If you get a pick, ping immediately and either take dragon or shove a tower — don’t chase into fog.\n- Teamfights: Wait for your frontliner CC or for enemies to burn their escape. Don't R into the objective pit alone; flank from side where your team can follow.\n- Rune/item note: Favor burst+mobility (electrocute/hextech-like approach) when you have coordinated follow-up; if your team lacks engage, consider a Zhonya timing to survive longer in objective skirmishes.\n\n### Briar\n- Identity shift: Use Briar as an early-mid game objective controller — her kit is tailor-made to force fights and isolate targets. Your Briar games show high damage share when you're allowed to operate; make that the rule instead of the exception.\n- Mid/early game coaching: Coordinate with the bot lane before deep invades and set a hard timer on dragon windows. When you go in, have at least one vision control and one teammate ready to commit to the pit.\n- Teamfights: Target backline but not at the cost of dying first; bait out CC and then execute.\n\n### Rammus\n- Identity shift: When picking Rammus, be the objective-driver, not a random initiator. Your Rammus games have very high KDA — use that reliability to secure towers and force Baron/dragon control.\n- Mid/early game coaching: Use Rammus as a tempo tool: if enemies are overextended, collapse and turn kills into tower plates or a dragon. If you get a pick, immediately move to objective vision instead of farming.\n- Teamfights: You are the on/off switch for engages — prioritize peel or channeling for your carries if the team is weak at follow-up.\n\n(Secondary picks like Jax are side-lane-exploit picks: use them to create pressure while your team secures neutral objectives — don't try to be both the split-pusher and the objective-taker simultaneously.)",
  "itemization_tips": "**Build Efficiency**. Point out static build errors or rune mistakes seen in the data.\n\n- Default to role-appropriate mythics: On Diana/Briar play an assassin/diver mythic that provides either mobility or survivability (Hextech/Night Harvester-style or a defensive mythic depending on follow-up). On Rammus take a engage tank mythic (Turbo Chemtank / appropriate engage mythic) to ensure you can reliably start or secure objectives.\n- Common static errors to avoid: building pure burst and then expecting teamfights to convert when your team lacks follow-up; building squishy never-ending damage when you need to zone for objectives. If your team lacks frontline/engage, shift to slightly tankier builds (early stopwatch/Zhonyas or one defensive item) to survive objective contests.\n- Summoner/Smite usage: Use Red Smite when you need dueling/secure on dragons; use Blue Smite for chase control if your identity is to catch picks. Consider taking defensive Flash or Exhaust more often in games where you are the primary engager and get picked.\n- Vision & Control Wards: Add a conscious purchase habit — at minimum 1 control ward before every contested dragon/Baron and one deep control ward after a successful gank to keep enemy vision denied. Your losses show repeated 'got picked before objective' — a control ward is a tiny, high-ROI purchase there.",
  "goals": "**Top 5 Strategic Priorities**. A ranked list of 5 concrete, actionable habits to fix the Root Cause. No fluff.\n\n1) Objective-first decision rule: If you take a fight and it doesn't instantly result in an objective (+60 seconds), disengage and establish vision. Every pick must be followed by vision/control placement and leading your team to the objective.\n\n2) 'No-go without 2': Do not start or flank for an objective contest unless you have at least 2 reliable teammates committed AND at least one control ward or clear enemy vision. If you go alone, accept that you must not then try to force the objective alone.\n\n3) Pre-objective checklist (30s timer): ping objective, place a control ward, clear one enemy ward, confirm 2 teammates within 1000 units (or a pinged commitment). If any item fails, delay the contest.\n\n4) Increase kill participation via micro-communication: After a gank, ping \"dragon\" or \"tower\" within 3s; if you score a pick, auto-assign yourself as objective leader and path to the objective rather than chasing a fleeing target. Practice this for 10 games to turn solo kills into map advantage.\n\n5) Champion pool discipline: Play 2 primary styles and 1 situational tank — Main: Diana/Briar (carry-diver) for games where team can follow; Backup: Rammus (tank/engage) when you need reliable objective control. Limit swapping to under 20% of games to build consistent macro habits.\n\nApply these five for the next 20 games: track every objective you contest (won/lost + whether you had 2+ teammates + vision). Your climb will come from converting your strong individual fights into consistent global advantages."
}