{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: The Midlane Split-Skirmisher Who Forgets Objectives\nYou play like a duel-first midlaner. Your most-played champs (Yone 61, Riven 28) are skirmish/split-oriented picks; you also oscillate into control/roam mages (Viktor, Ahri, Lissandra). Your numbers show a player that can produce decent personal stats (KDA and damage share near high-elo baselines) but rarely converts those fights into team wins. Low kill participation (0.388 vs a 0.65 baseline) + repeated objective deficits indicate you often take isolated fights or lane priority without turning them into dragon/baron/tower control. Signature behaviors: decent CS, middling damage share, high variance across champion identities.\n\n2. **The Root Cause**: Identity Mismatch + Objective Blindness\nSymptoms: frequent low KP, games lost from tower/dragon/baron control, and a high rate of getting picked before objectives. The underlying cause is twofold: (A) inconsistent champion identity — you alternate between melee skirmishers and control mages without a consistent macro plan, so your decisions after winning lane (push vs roam vs group) are unclear; (B) poor objective approach and vision discipline — you enter objective fights under-warded, get picked before objectives, and fail to convert lane pressure into secure dragons/barons or tower plates. In short: you win small fights or farm but fail the map-level follow-up.\n\n3. **The 'One Big Thing'**: Make your post-lane decision automatic and objective-focused\nWhen you take a lead or win a trade, decide immediately: \"I am converting this into an objective (vision + group)\" or \"I am splitting safely (vision + TP control)\". The single most critical change is to tie every successful skirmish or push to a concrete objective plan (place control wards, sweep, ping, and either group for dragon/tower or clear and join with TP). Fixing that flow will raise your KP, reduce picks, and close the objective gaps that are causing losses.",
  "champion_feedback": "**Champion-Specific Adjustments**\n\n### Yone\n- Identity: Yone is a skirmisher that needs either side-lane priority or a clear join-to-objective plan. Your Yone winrate is decent but losses show you often die around objectives or fail to be present.\n- Mechanical/behavioral shifts: after pushing a wave, check dragon/side-lane timers and either place a control ward and path to the drake, or reset to group. Avoid solo deep roams toward objectives without a sweeper or teammate.\n- Rune/build note: you prefer Lethal Tempo; keep it if it helps your trading, but practice two templates: aggressive (Lethal Tempo, lifesteal items) for split skirmishes and grouped (Conqueror or a more durable spike) when you plan to contest objectives with team.\n\n### Riven\n- Identity: pure side-lane skirmisher. If you play Riven mid/top, commit to split-push windows and TP timing. Your build (Sundered Sky, Death's Dance) fits the goal — the problem is translating side pressure into objective wins.\n- Macro: prioritize pushing and forcing the enemy team to respond before dragon spawns. If they don't, you take tower plus vision; if they do, you join for the objective with TP advantage.\n\n### Ahri\n- Identity: roamer-assassin. Your Ahri games show high KDA but low wins — you're getting picks but not converting into objectives.\n- Behavioral shifts: prefer roaming earlier (post-6) on successful wave clears; however, ensure mid wave is pushed and you or your team place at least one control ward near the drake before roaming. Make your roams count: get an assist + ward control or a lane tower.\n- Rune/style: Electrocute fits; focus on roam timing windows (8–14 minutes) and then return to lane or group for drake.\n\n### Viktor\n- Identity: teamfight brawler/zone control. Your small sample shows strong results. Treat Viktor as your 'group champion' — you should be the reliable backline damage and zone for objective fights.\n- Behavioral shifts: prioritize waveclear and the item/level spikes that let you safely control space around objective fights. If playing Viktor, be the one choosing to contest Baron/Dragon when vision is present.\n\n### Lissandra / Syndra (Unreliable picks right now)\n- Both provide pick/zone but your winrates are low. Until objective & vision discipline is fixed, avoid these if you intend to carry through macro — they reward precise roam/CC follow-up which is currently the team's weakest link.\n\n(General): Consolidate to 2–3 mid identities: one control mage (Viktor), one roam-pick (Ahri), and one skirmisher (Yone or Riven) — practice the post-lane decision for each.",
  "itemization_tips": "**Build Efficiency**\n\n- Vision spending > niche lifesteal ordering: You buy Oracle Lens fairly often on Yone but your vision score is still low and you get picked before objectives. Shift gold to early control wards and earlier sweeper timing before contest windows. Rule: if dragon is up in <=120 seconds, buy a Control Ward on your next back, or upgrade to Oracle earlier when contesting.\n\n- Yone: Your typical core (Berserker's Greaves, BOTRK, Shieldbow, IE) shows a survival-first approach. That's fine as a secondary plan, but if you intend to be the team's objective force, prioritize power spike itemization that lets you clear waves and threaten turrets faster (adjust ordering so you can shove and join). Also consider a defensive lifeline (Shieldbow) only when you routinely get burst-picked in fights; otherwise convert to more damage or sustain that helps tower pressure.\n\n- Riven: Your Sundered Sky + Death's Dance path is coherent. Improve timing: finish Sundered Sky earlier to accelerate tower-taking windows. If you plan to split, take Teleport when appropriate and buy TP combat items (earlier boots, QSS situational) to avoid being collapsed on during objective windows.\n\n- Viktor: You already lean into Rabadon/zone tools. Make Hexcore/upgrade and your mid-game power spike priority so you can control fights around dragons/baron. Buying Farsight often is helpful for safe objective checks; keep it when you know you'll need to scout when sieging.\n\n- Ahri & Lissandra: You're buying Malignance and Lich Bane on Ahri often. Order matters: do not delay boots and key AP spike. If you roam, take a mid-tier AP item and boots first to maximize map impact.\n\n- Universal items: place at least 1 Control Ward before every team fight where an objective is contested. Buy Oracle Lens earlier than you currently do when the enemy has strong ward coverage or when you have playmaking windows (e.g., 14–20 minute drake fights).\n\nAvoid: spreading gold across too many situational survivals that reduce your ability to pressure towers or buy vision. Buy fewer tertiary components and more objective-enabling items/wards early.",
  "goals": "**Top 5 Strategic Priorities**\n\n1) Objective Ward & Contest Checklist (Immediate habit)\n- Before every dragon/baron: ensure at least 2 total control wards on the map on your team side and you have a sweep (or have pinged for one). If you cannot guarantee vision, do not face-check. Metric: reduce 'got picked before objective' games by 50% in next 20 games.\n\n2) KP Boost by Roam Discipline (Tactical habit)\n- After pushing a mid wave, set a micro-plan: (A) shove + roam (place a control ward en route), (B) shove + recall + join, or (C) shove + freeze and deny. Do this automatically; aim to raise KP to 0.5+ in 15 minutes by increasing purposeful roams and grouping for drakes.\n\n3) Consolidate Champion Pool to 2 clear roles (Identity habit)\n- Limit your queue to 2 mid identities: a) control scaler (Viktor) and b) skirmisher/roamer (Yone or Ahri). Play each for at least 10 games in a row to lock in decision-making patterns.\n\n4) Wave Management Drill (Mechanical/macro habit)\n- Practice 10 games focusing only on wave control: learn two key timings — shove to reset and immediately roam vs freeze to deny and call for vision. If you can reliably push and be at dragon spawn, your team wins objective fights more often.\n\n5) Pre-Objective 5-Second Mental Checklist (Mental habit)\n- Every time your team approaches an objective, run this checklist in your head: \"Do we have vision? Who is alive? Where is enemy jungler/side-lane? Who gets the money for plates?\" If any answer is uncertain, wait and place wards or ask for a sweep. This reduces picks and prevents throwing leads.\n\nBonus: Play focused VODs: review 5 losing games and timestamp 3 objective sequences where you were absent or died pre-objective. Identify the exact moment you could have bought a ward, pinged, or grouped differently.\n\nStart with these, measure KP and dragon gap after 20 games, and iterate."
}