{
  "overview": "**The Diagnosis**.\n\n1. **Your Archetype**: \"The Duelist Operator (Split‑first, Team‑second)\". You play like a mechanically skilled skirmisher: Yone/Riven/Zed tendencies — you farm well, win many isolated fights, and keep a solid personal KDA. That strength shows: your overall KDA (3.42) is above baseline and in losses you're often one of the better performers, which means your lane/mechanics individually are fine. But your damage share and — critically — your kill participation are low for a midlaner. You frequently end up as a high‑impact solo player who isn't integrated into team objective play.\n\n2. **The Root Cause**: Identity + Macro Discipline. You are treating mid like a solo duel lane or side‑lane role too often. That creates three linked failures: poor objective control (you lose Dragons/Barons and towers), low KP (you aren't present for decisive fights), and frequent 'picked before objective' events (0.884 tag rate). In short: you either overextend seeking skirmishes without vision or you split without creating consistent team pressure. The symptom (low KP, lost objectives, getting picked) points to the same habit — you prioritize solo advantage over coordinated objective setups and vision discipline.\n\n3. **The 'One Big Thing'**: Stop getting picked and start winning objectives. Make objective/vision discipline the default decision filter for every engagement. If the objective (Dragon/Baron/tower) is contested, your default should be: have vision cleared, be inside team formation, and only engage when you have clear flank/peel — not when you have a solo window. Improving this single behavior will raise KP, reduce lost objective counts, and convert many close losses into wins.\n",
  "champion_feedback": "**Champion-Specific Adjustments**.\n\nYone (30 games) — \"Stop playing Yone like a constant solo-splitter.\":\n- Identity shift: Treat Yone as a team skirmisher who looks for flanks and controlled engages rather than constant tower dives. Your best value is winning 2v2/3v3 skirmishes around objectives or cleaning up teamfights, not roaming alone into visionless jungle.\n- Laning phase: Manage waves so you can either base+join or push and roam on a known window — don’t shove blindly and walk into river control wards. If you want to split, only do so when your team has vision and the enemy cannot fight for objectives.\n- Mid→late: Prioritize Control Wards and Oracle before important objectives. If you’re dying early consistently on Yone, buy one defensive stat (early Mercury’s or Sterak’s situationally) rather than forcing snowball plays.\n\nAhri (10 games) — \"Turn Ahri into the team's roamer/pick engine\":\n- Identity shift: Move from solo killseeker to objective enabler. Ahri’s best role is to shove then roam to secure skirmishes and picks for Dragons/Heralds.\n- Laning phase: Shove reset windows and look for river control with your jungler. Electrocute picks translate directly into objective advantages if you follow through with vision.\n- Mid→late: Prioritize Ionian/Boots for roam speed, and always bring a Control Ward to clear entrances before you look for a charm target.\n\nSyndra / Viktor (scaling burst/battlemage picks) — \"Play them as objective controllers, not solo assassins\":\n- Identity shift: Use waveclear/zone to secure vision and contest control rather than chasing isolated kills. These champions win through controlled teamfights and space creation.\n- Laning phase: Hold your E/R to zone off enemies from jungle entrances during Dragon/Baron fights.\n\nRiven (5 games) — \"If you pick split/side‑lane Riven, communicate and time plates\":\n- Identity shift: Riven wants side‑lane windows where your team can force or back you up. Don’t constantly 1v1 while your team gets dove or loses objective vision.\n\nZed / Thresh (rare plays) — Use them for purposeful play: pick Zed only when you will follow a coordinated roam; play Thresh to improve vision control and force picks before objectives.\n\nOverall champion rule: If your champ’s natural identity is \"duelist/skirmisher,\" force a behavioral addendum: \"I will only split or look for roams if the team is in position to secure objectives and vision is cleared.\" If your champ is a control mage, default to waveclear → zone → vision control around objectives.\n",
  "itemization_tips": "**Build Efficiency**.\n\n- Vision items are underused relative to your losses. Habit check: every reset before a contested objective, buy a Control Ward and upgrade your trinket to Oracle/Bronze sweep at the 12–18 min window if you plan to contest. Not a suggestion — a ruleset.\n\n- Defensive items on duelists: when Yone/Ahri games show repeated early deaths, frontline some defensive stats. For Yone, consider Sterak's/Death's Dance or a Hexdrinker early if you are getting one‑shot; the goal is to survive initial burst so you can convert fights into skirmishes. Dying early reduces your KP and objective presence.\n\n- Rune alignment with identity:\n  - Yone/Riven: Conqueror primary (sustained skirmishes). Take a defensive secondary (Resolve) vs heavy poke/CC matchups.\n  - Ahri/Syndra/Viktor: Electrocute or Arcane Comet for laning kill pressure; choose Transcendence/Celerity to help roaming if you want to be the team's pick engine.\n\n- Item sequencing for objective control: prioritize boots + control ward + sweeping lens before buying a damage spike if you plan to fight for Baron/Dragon. Skipping vision for a slightly faster mythic purchase is reliably what gets you 'picked before objective.'\n\n- Common static errors to fix: building pure damage when you die first in teamfights; forgetting situational MR/tenacity when enemy has high CC; not buying any control ward for 10+ minutes into games where objectives decide wins.\n",
  "goals": "**Top 5 Strategic Priorities**.\n\n1) Objective/Pre‑fight Checklist (Non‑negotiable): Before any contested Dragon/Baron/Herald or tower dive — you or your shotcaller must confirm: (a) At least 2 Control Wards placed around the zone, (b) Sweepers have cleared enemy vision in approach lanes, (c) Your team is on the same side of the map or has numbers advantage. If any of these fail, DON’T facecheck. (Metric: reduce \"got picked before objective\" flags by 50% in next 20 games.)\n\n2) Kill Participation Focus: Increase active involvement rather than solo kills. Practice one behavior per game: if you shove mid, follow up by rotating to Dragon/side lane within the next 40 seconds. Target +0.15 KP in your next 20 games (aim 0.55+).\n\n3) Wave Management Routine: Every minute mark review: Do I need to shove and roam, slow push to force enemy response, or freeze to deny enemy roam? Use this to create safe windows to join objective fights. (Metric: reduce \"lost tower pressure\" by actively converting 1–2 plates per game when ahead.)\n\n4) Vision Budgeting Habit: Spend at least one Control Ward every back after 8 minutes and upgrade your sweeping at objective windows. Commit to buying a Control Ward on 90% of backs pre-20 minutes. This directly reduces picks.\n\n5) Situational Itemization Discipline: If you die repeatedly early on a champion, immediately change one buy on your next game to include a single defensive item (boots earlier, Sterak’s/Hexdrinker/early MR as appropriate). Track whether teamfights look different — if you're surviving the burst you will swing close games in your team's favor.\n\nExecute these five priorities as hard rules for the next 20 ranked games before tinkering with champion pool or mechanical practice. If you implement the objective/vision checklist first, KP and objective control will improve and many close losses will flip into wins.\n"
}