{
  "draft_analysis": "- **Enemy comp**: Triple dive/engage (Wukong, Warwick, Yasuo) + reset hypercarry (Tristana) + enchanter (Karma). Strong early-mid skirmish, hard engage, and strong snowball.\n- **Your comp**: Hecarim/Yone dive with Jinx as only backline DPS, Heimer for zone control, Milio peel. You are out-engaged and your only real front line is behind in gold (Hecarim).\n- **On paper edge**: Enemy. Their comp punishes immobile ADC + scaling mid with no true tank, and they outperformed in early skirmishes, accelerating their already stronger mid-game spike.",
  "pick_quality": "- **Yone vs this comp**: You are playing a melee scaling skirmisher into heavy point-and-click CC (Warwick), strong anti-dive (Karma shields/speed), and a lane opponent (Yasuo) who matches your kit and outscales you in organized 5v5.\n- **Issues**: Your team already had dive (Hecarim) and shaky peel for Jinx; adding another short-range diver (Yone) instead of control/utility mid makes fights even more chaotic and unreliable for Jinx.\n- **Better archetype**: A control mage (e.g. Orianna, Viktor, or Azir if in your pool) that can: 1) outrange Yasuo/Warwick, 2) provide zone control and peel for Jinx, and 3) punish Wukong/Yasuo dives. If you lack that style, **new champ to learn**: **Orianna** – safe lane, strong teamfight, fits with Hecarim/Jinx/Milio and answers dive comps well.",
  "story": "- **Turning point**: The 9–16 minute lane phase into Yasuo: 0/3 vs Yasuo by 16 minutes, losing mid tower at 14, then top at 16. This removed all mid prio and river control.\n- **Consequences**: Once mid outer fell, Warwick/Yasuo/Wukong owned your jungle entrances. Every rotation you made (18–23 min) was from behind in tempo and vision, so each attempted contest turned into another pick/death and more towers falling.\n- **Snowball effect**: Their solo lanes got to play from mid first, collapsing on sides and dragons, while you were still completing 2-item spikes. The game ended before your comp (Jinx/Yone/Hecarim) could stabilize on 3+ major items.",
  "ideal_build": "- **Rune baseline (current meta, mid Yone)**:\n  - Keystone: **Press the Attack**\n  - Domination secondary (Taste of Blood + Treasure Hunter/Ingenious) or Resolve secondary for durability.\n- **Core build (from meta, adapted to this game)**:\n  1. **Berserker's Greaves**\n  2. **Blade of the Ruined King** (excellent vs Warwick/Wukong/Yasuo bruisers)\n  3. **Immortal Shieldbow** (survivability vs dive and burst)\n  4. **Death's Dance** (anti-burst & damage delay vs Yasuo/Wukong/Trist burst)\n  5. **Wit's End** if Yasuo/Karma AP+on-hit is threatening, else **Bloodthirster** for more lifesteal/shield vs Trist/Yasuo\n  6. Situational last slot: \n     - **Guardian Angel** (when ahead or even, to teamfight vs heavy engage) \n     - **Maw of Malmortius** (if Karma AP + mixed damage is too high)\n\n- **Order example**: BORK → Berserkers → Shieldbow → Death's Dance → GA/Wit's End → defensive flex.",
  "build_vision": "- **What you built**: Doran's → early Vamp Scepter → rushed **BORK**, then **Berserkers**, then **Shieldbow**; core 3 completed at ~22 min while very behind (1/7/4).\n- **What’s missing**: No **early defensive bridge** (e.g. Stopwatch/Cloth Armor/Null-Magic) and no **third defensive-DPS hybrid item** like Death's Dance; you went full standard damage curve despite being very behind vs a fed Warwick (14/5/8) and Yasuo (10/3/9).\n- **Why ideal build is better here**:\n  - **Earlier survivability**: Rushing BORK is fine, but when 0/3 vs Yasuo and Warwick is camping, you need to delay extra damage (Pickaxe/Crit) for **Stopwatch** or at least an earlier lifesteal + defensive component to survive all-ins.\n  - **Death's Dance or GA 3rd/4th** turns you from a one-shot target into a real frontline threat in skirmishes. Your final fights (18–23min) were decided before you could leverage your damage because you died instantly to CC + burst.\n  - Same core items, but **timing and priority of defensive slots** should shift once you fall behind; you played a \"snowball\" build in a losing game state.",
  "mistakes": "- **What lost THIS game**:\n  - **Lane deaths vs Yasuo (9–16 min)**: Each solo death = wave loss + plate gold + lost mid prio. By 14–16 min you had no outer towers and no safe mid wave, which gave Warwick/Yasuo free roam.\n  - **Fighting while under-itemized**: Contesting skirmishes at 11–18 min when you only had partial BORK and no completed defensive item vs fed Warwick/Yasuo turned every objective fight into a losing 4v5 or 5v5.\n- **Silent killer habits**:\n  - **Overextending for mid waves after losing tower**: Still walking into long mid lane without hard vision while their comp has multiple long-range engages (Warwick R, Wukong R, Yasuo R setup, Karma speed-up) – this will keep getting you picked.\n  - **No adaptation in build/tempo**: Continuing the default damage curve instead of shifting to survival (Stopwatch, early Null-Magic, or DD/GA earlier) when behind against hard engage will keep making you a free reset for enemy hypercarries.",
  "verdict": "- You played a scaling melee diver (Yone) into a stronger early-mid engage comp, lost lane priority hard vs Yasuo, and then followed a greedy damage curve instead of shifting to defensive tempo, leaving you unable to function in mid-game fights."
}