{
  "draft_analysis": "**Draft & Win Condition**\n\n- **Your comp**: 4 AD assassins/fighters (Yone, Qiyana, Cho'gath damage build, Ziggs low peel, Brand support) → No frontline, no engage, zero peel, mostly short-range dive.\n- **Enemy comp**: Strong wombo + peel: Yasuo/Pantheon/Fizz (hard engage + burst), Caitlyn (high-range DPS), Rakan (premier peel/engage). They out-engage, out-peel, and have better backline access.\n- **On paper edge**: Enemy. Your team is **full AD, no tank, no disengage** vs double assassin + dive + hyper-ADC with enchanter-style peel. If you don’t snowball lanes hard and control vision, front-to-back fights are unplayable.",
  "pick_quality": "**Pick Critique (Champion Identity)**\n\n- **Yone fit**: Adds *more* dive and AD into a comp already overloaded with squishy melee AD (Qiyana, Cho). Enemy has easy tools to punish dashes (Pantheon stun, Rakan charm/knockup, Fizz R, Yasuo R). Hard for Yone to get clean, repeated fights.\n- **Better pick from this kind of pool**: If you insist on a fighter/assassin style: a **single AP control mage (e.g. Viktor, Orianna, Syndra)** would have fixed damage profile and given peel/zone control. From an assassin pool, **Kassadin** vs double AP (Fizz/Rakan) could scale better than Yone.\n- **New champ to learn**: **Viktor** – safe scaling control mage, gives: waveclear, zone control for objectives, real mixed damage, and safer positioning vs Rakan/Yasuo/Panth dives.",
  "story": "**The Turning Point**\n\n- **Early lane deaths**: 3 early deaths to Yasuo by 8m (2m, 5m, 8m) gave him tempo, allowing mid pressure → your mid outer down at 13m while you were mostly top.\n- **Mid-game ADC gap**: Caitlyn quietly farmed, then started picking you at 21m in bot and cleaning fights (15/3/11). Your comp had no hard engage or peel, so once she hit 2–3 items, fights became unwinnable front-to-back.\n- **Macro collapse 21–29m**: After your team traded some outer/inner turrets, you died 3 times in 4 minutes (21m, 26m, 27m) around river/jungle → no frontline, no vision, enemy chained picks into tower/nexus push.",
  "ideal_build": "**Objective Best Build (This Game)**\n\n- **Mythic/Legendary Core** (standard on-hit crit Yone, high DPS vs squishies):\n  - Berserker's Greaves\n  - Blade of the Ruined King (early vs Yasuo/Cait/Pantheon health and to win side)\n  - Immortal Shieldbow (survivability vs burst from Fizz/Pantheon/Yasuo)\n  - Infinity Edge (big DPS spike once you have 2 crit items)\n  - Bloodthirster (shield + sustain vs high poke/burst, improves durability in teamfights)\n  - Situational 6th: Guardian Angel (heavy reset fights vs Pant/Yas), or Wit's End (if AP damage from Fizz/Rakan was oppressive).\n\n- **Boot enchantment**: Swap to **Plated Steelcaps** or **Merc Treads** if Yasuo/Pant/Pantheon CC/burst was deleting you; greed for Berserkers only if you’re already ahead.",
  "build_vision": "**Build Critique & Itemization Logic**\n\n- **What you did right**:\n  - Followed meta core: **Berserker's → Bork → Shieldbow**, then started building **BF Sword + Pickaxe** → clearly heading towards **Infinity Edge**. This is fundamentally correct for DPS.\n- **What was missing for this game**:\n  - No clear **defensive pivot**: vs Rakan/Yasuo/Pant/Fizz, you need at least **one** defensive layer (Merc Treads or Steelcaps, GA, Wit's End, or early Stopwatch). Full glass-DPS vs 4-man hard engage is unrealistic.\n  - No **anti-burst/sustain layering**: A later **Bloodthirster** or even **Wit's End** would help you survive initial combo and stay in extended fights vs Cait + Yasuo DPS.\n- **Why ideal build is better here**:\n  - The enemy comp doesn’t have tanks; your damage is already sufficient with Bork + IE. The limiting factor is **living through first rotation of CC and burst**. Shieldbow + BT/GA or Wit's End lets you actually **use** your DPS window instead of dying on entry.",
  "mistakes": "**Critical Mistakes & Bad Habits**\n\n- **What lost THIS game**:\n  - **Early 1v1 mismanagement vs Yasuo**: 3 deaths pre-10m gave Yasuo prio; losing mid prio cascaded into early tower loss (13m) and freed Yasuo/Pantheon to roam and pair with Rakan.\n  - **Mid-game deaths around side/jungle (21–27m)**: Dying side vs Cait at 21m, then again at 26m and 27m, removed your only late-game physical DPS threat from critical fights, allowing enemy to roll through towers.\n- **Silent killers for your climb**:\n  - **Over-dive with no vision**: Multiple deaths happened in river/jungle without established vision or clear info on Pantheon/Rakan positions. Yone cannot be first to facecheck – you must wait for enemy CC to be shown or engage from fog with E.\n  - **Not matching your comp’s needs**: Your team was already full AD and low peel. Locking another melee AD diver and going pure DPS build left your team without any champ trying to be the stabilizing, backline-protecting, or AP damage role. Long term, this draft-blindness will stall your climb even if your mechanics improve.",
  "verdict": "**Final Verdict**: The loss came from draft disadvantage (4 AD divers, no peel) amplified by early deaths to Yasuo and repeated visionless mid-game picks, preventing your otherwise solid Yone build from ever being used in stable, winnable fights."
}