{
  "draft_analysis": "**Draft & Win Condition**\n\n- **Your comp**: 3 AD divers/skirmishers (Riven, Jayce, Twitch) + 2 fragile picks (AP Kai'Sa, Shaco). Very high damage, low front line, low reliability in 5v5; best as **pick / flank / side lane** comp.\n- **Enemy comp**: Aurelion Sol + Vladimir + Amumu + Jhin + Blitz = **hard scaling teamfight wombo** (AoE CC, AoE damage, strong backline, double AP threats).\n- **On paper edge**: Enemy. If game goes past ~25 minutes and they group, their comp massively outperforms yours in front‑to‑back fights. Your win condition is: snowball early through sides, deny Aurelion Sol tempo, and force skirmishes around vision instead of grouped 5v5s.",
  "pick_quality": "**Pick Critique**\n\n- **Riven viability**: Riven mid/top is fine into double AP (Vlad + Aurelion Sol) if you abuse early levels and create side‑lane pressure; but with no true tank and double ADC, your comp becomes 4 squishy damage dealers + Shaco, which is very volatile into Amumu + Blitz.\n- **Better from typical fighter/assassin pool**: If you have something like **Sylas** or **Irelia** in your pool, they bring similar skirmish power but scale better into teamfights vs AP + wombo comps (Sylas especially loves stealing Amumu/Vlad/Aurelion Sol ults).\n- **New champ to add**: Learn **Nautilus** (mid/top support flex). He gives you: hard engage, peel vs Blitz/Amumu/Aurelion Sol, and an actual front line so your Twitch/Kai'Sa can DPS in later fights.",
  "story": "**The Turning Point**\n\n- **Mid‑game shift (~20–28 min)**: You took outer/inner towers top and mid, but then repeatedly died to Aurelion Sol (25m, 28m, 33m, 35m). Each death bought him time to scale, stack his passive, and control mid waves.\n- **Base race / map collapse**: While you were trading kills and structures, they won the crucial **mid inhibitor + nexus turret sequences** off Aurelion Sol‑centered teamfights (Amumu engage + Aurelion Sol follow). Your comp couldn’t play front‑to‑back into that once behind in tempo.\n- **End state**: Your side‑lane pressure didn’t convert into vision control or objective setups; their scaling teamfight comp got to group mid and end through repeated picks and won 5v5s.",
  "ideal_build": "**Objective Best Build (This Game)**\n\n- **Start**: Doran's Blade + 1 pot (you want lane prio/kill threat, not Shield, into AP skillshot/DoT champs you can all‑in).\n- **Core** (mid Riven meta + vs double AP + Vlad heal):\n  - Ionian Boots of Lucidity\n  - **Axiom Arc** (core mid‑Riven for ult uptime and snowball potential)\n  - **Sundered Sky** (main mythic for sustain, HP, and extended fight DPS)\n  - **Maw of Malmortius** (3rd/4th vs Vlad + Aurelion Sol burst)\n  - **Serpent's Fang** or **Chempunk Chainsword** depending on shields vs healing (here: more value from anti‑heal → **Chempunk**, or finishing **Mortal Reminder** later)\n  - **Guardian Angel / Death’s Dance** as last slot depending on who’s fed (GA vs Aurelion/Jhin burst, DD for extended skirmish vs mixed damage)\n- **Situational swaps**:\n  - If Amumu/Blitz hooks and hard CC are deciding fights: **Mercury's Treads** are correct.\n  - If front line becomes an issue: consider **Black Cleaver** 3rd/4th instead of pure damage to shred Amumu and front‑to‑back with Twitch.",
  "build_vision": "**Build Critique (Your Build vs Ideal)**\n\n- **What you built**: Maw → Merc Treads → Ravenous Hydra → Death’s Dance → Mortal Reminder.\n  - Positives: Early Hexdrinker→Maw vs Vlad/Aurelion is good; Mercs into Amumu/Blitz reasonable; anti‑heal (Mortal Reminder) is correct conceptually.\n  - Issues: No **mythic at all**, no **Axiom Arc**, and delayed your **CDR/damage spike** by rushing Maw + Hydra + DD.\n- **Why ideal is better here**:\n  - **Axiom Arc**: huge for repeatedly ulting in skirmishes and quickly cycling ult in fights vs a scaling comp – gives you actual burst windows to delete Aurelion/Jhin.\n  - **Sundered Sky**: HP + sustain + damage makes you far tankier vs Amumu/Aurelion’s AoE while still one‑shotting squishies; much better front‑to‑back than early Hydra.\n  - **Hydra timing**: Hydra 2nd is greed; it adds waveclear you don’t strictly need while delaying tankiness/CDR and your primary damage mythic. It also encourages perma‑side‑lane when your team needs you for coordinated fights.\n  - **Double early defense (Maw + DD)**: Over‑indexes on survivability without enough raw threat or ability haste, making it harder to actually kill Aurelion/Jhin before they get peel/CC off.",
  "mistakes": "**Critical Mistakes & Bad Habits**\n\n- **What lost THIS game**:\n  - **Overstaying/coin‑flip fights vs Aurelion Sol after taking towers**: Multiple deaths at 25m, 28m, 33m, 35m handed their main carry gold + time to scale, instead of you resetting, controlling vision, and forcing picks on side.\n  - **No mythic / late spike**: Skipping core mid‑Riven mythics meant you never hit a strong, clean 2‑item timing; mid‑game you were durable but not threatening enough to reliably delete enemy carries in one rotation.\n  - **Wrong fight selection**: Your comp wants flanks and numbers advantages; you kept fighting into their grouped 5v5 (Amumu + Aurelion Sol + Jhin) where their comp is designed to win.\n\n- **Silent killers (will hurt your climb long‑term)**:\n  - **Defensive early start (Doran’s Shield) on a snowball champ**: You gave up lane pressure in a game where your job is to accelerate tempo before scaling kicks in.\n  - **Poor gold efficiency / component clutter**: Many Long Swords, late mythic, and tier‑2/3 items led to messy power curves. Getting to clear 2‑item spikes (mythic + 1 legendary) fast is more important than stacking random AD.\n  - **Side‑lane without setup**: Pushing side without deep vision or tracking enemy mid/jungle leads to repeat deaths; you must only pressure side when you know where Aurelion/Amumu are and your team can pressure opposite side or mid wave.",
  "verdict": "**Final Verdict**\n\n- You had the right champion archetype for snowballing, but inefficient itemization plus repeated mid‑late deaths to Aurelion Sol and grouped 5v5s into a superior teamfight comp prevented your early side‑lane pressure from converting into a win."
}