{
  "draft_analysis": "**Draft & Win Condition**  \n- Your comp: Standard front-to-back + engage (Leona, Lillia, Yone follow-up, Jhin cleanup). Wants *controlled* 5v5s and objective setups where Leona/Lillia start and Jhin/Yone free-hit.  \n- Enemy comp: Heavy scaling AP teamfight (Vlad/Gwen double AP threats + Amumu hard engage, Braum peel, Cait long range). Extremely strong 5v5 at 2+ items, especially vs melee.  \n- On paper: Enemy scales harder and punishes short-range melee divers. Your win condition was: snowball mid/jungle, break outer towers early, then force picks and 4v4s before Vlad/Gwen hit 3 items and group mid.",
  "pick_quality": "**Pick Critique (Yone Identity)**  \n- Into Gwen + Vladimir + Amumu, Yone is playable but **not ideal**: triple AP, heavy AoE CC, and peel punish your all-in and force you into MR/defensive items, lowering your carry potential.  \n- A safer, higher-value pick from a typical mid pool would be: **control mage (e.g., Viktor/Anivia/Orianna)**—long-range waveclear, zone control vs Amumu/Vlad, and strong scaling front-to-back.  \n- If your pool lacks strong control mages, **new champion to add**: **Viktor** – fits current meta well, scales hard, safe laning vs Vlad, and gives high-DPS, low-risk teamfight damage your comp was missing.",
  "story": "**The Turning Point**  \n- 13–23 minutes: repeated deaths around mid/jungle (13m, 14m, 15m, 19m, 22m, 23m) while outer towers fell meant you traded kills for **zero wave control or vision**; enemy took top tier 2 and base turret by 20m and a nexus turret by 22m.  \n- You hit core items late and kept fighting into tight choke teamfights where Amumu + Vlad AoE outscaled your short-range comp, so every lost fight converted instantly into structures and map loss you couldn’t recover from.  \n- Even after strong picks at ~30m (kills on Gwen/Vlad and taking mid inner), base was already broken mid/top, so one last lost fight (36m death to Cait) ended the game via open nexus.",
  "ideal_build": "**Objective Best Build (Given Meta & Game)**  \n- Rune page (mid Yone current meta):  \n  - **Precision**: Press the Attack (core), Triumph, Legend: Alacrity, Last Stand.  \n  - **Secondary**: Resolve (Second Wind/Bone Plating + Unflinching) vs Vlad poke & Amumu/Gwen CC.  \n- Core items (as per meta, adapted to enemy comp):  \n  - **Berserker's Greaves**  \n  - **Blade of the Ruined King** (early dueling, %HP shred vs Gwen/Amumu)  \n  - **Immortal Shieldbow** (anti-burst vs Vlad/Amumu + lifesteal)  \n- Optimal finishing build for this game:  \n  - 1) Berserker's Greaves  \n  - 2) Blade of the Ruined King  \n  - 3) Immortal Shieldbow  \n  - 4) **Wit's End** (double AP solo lanes + Amumu; MR + on-hit DPS)  \n  - 5) **Mortal Reminder** (anti-heal vs Vlad/Gwen + armor pen vs Braum/Amumu)  \n  - 6) **Guardian Angel** (or Randuin's vs Cait crit if Amumu/Vlad not one-shotting you)  \n- Situational swaps: if enemy lacks armor, you can delay Mortal Reminder; if you’re perma-focused in fights, bring GA earlier as 4th.",
  "build_vision": "**Build Critique**  \n- Positives:  \n  - You followed the **core meta skeleton**: Berserkers → BotRK → Shieldbow, and correctly bought **Executioner's/Mortal Reminder** vs Vlad/Gwen healing plus **Wit’s End** vs double AP+Amumu. Conceptually solid.  \n- Problems:  \n  - **Timing & duplication waste**: Multiple Recurve Bows and duplicated Immortal Shieldbow/Mortal Reminder purchases in the log suggest inefficient back timings and gold usage, delaying real power spikes when the enemy was breaking your base (20–22m).  \n  - **Late defensive slot**: Spectre’s Cowl came very late and never upgraded to a full MR tank item or GA; you stayed in a greedy DPS+on-hit setup vs insane AoE burst (Vlad + Amumu) when you actually needed a strong survival item to function in front-to-back fights.  \n  - With your comp already having damage (fed Jhin), a **GA or even Randuin’s** over raw MR components would have let you play more aggressively on flanks and survive first rotation of spells instead of dying and losing structures.",
  "mistakes": "**Critical Mistakes & Bad Habits**  \n- What lost THIS game:  \n  - **Chain dying through mid game** (13–23m): deaths every ~2–3 minutes during the most important objective window handed over tempo; top lane collapsed entirely (outer, inner, base turret by 20m) without cross-map trade pressure from you.  \n  - **Fighting in losing terrain**: repeatedly contesting around mid river/jungle chokes vs Amumu + Vlad where your melee champ gets full AoE dumped on them instead of forcing side-lane picks or using your E to trade on sides and then collapse *after* big ults are down.  \n- Silent killers (long-term climb issues):  \n  - **Over-indexing on fights instead of waves**: your kill participation was decent, but every death lined up with your team losing multiple towers—shows a habit of taking skirmishes with no wave priority or vision setup.  \n  - **Late, reactive itemization**: you bought correct counters (anti-heal, MR) but **too late relative to enemy spikes**; strong players pre-build these (Executioner’s earlier vs Vlad, earlier MR vs double AP) so they hit their survivability thresholds before the enemy reaches their 2-item teamfight power.  \n  - **Overstaying after wins**: around 30m you got key kills and a tower, then died to Gwen at 31m—rather than reset with gold and vision, you stayed on map and gave shutdown/tempo right back.",
  "verdict": "**Final Verdict**  \n- Your build concept matched the meta, but repeated mid-game deaths in bad terrain and slightly delayed, inefficient item timings let a stronger-scaling Vlad/Gwen comp hit unstoppable 5v5s long before you could leverage Yone’s side-lane and skirmish strengths."
}